{"id": "nluav20", "text": "For starters, why are you looking at all the resumes? In my ATS, I Boolean search the applicant pool and 5k candidates drops to 40. Then I find 3-5 to get moving with.", "timestamp": "2025-10-28T15:17:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlunxaf", "text": "I love me a good boolean string", "timestamp": "2025-10-28T16:20:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1pa0t", "text": "Which ATS do you use? Also, I was wondering if people are using any AI tool(s) to screen the resumes in bulk?", "timestamp": "2025-10-29T17:51:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm2bmpr", "text": "DayForce. Ai grades them but it’s useless. I just look on my own. I’ve hired people that ai called a “D” candidate. Yes they use elementary school gradin lmao and it’s likely just how many times they say the correct buzzword from the JD.\n\nEdit: the ai generated summary is pretty cool and I use that to send to managers along with resume.", "timestamp": "2025-10-29T19:37:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmapr26", "text": "Looking from my own perspective, good idea regarding the summary. What's the input for the AI you use? Ad + resume, or just a resume?", "timestamp": "2025-10-31T01:27:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmb5cyu", "text": "Just resume summary. Nice, clean, to the point. I’m a fan.", "timestamp": "2025-10-31T03:02:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmblsr2", "text": "The question was how you get  resume summary? Chat gpt, or that tool you mentioned?", "timestamp": "2025-10-31T05:10:10Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmcpl8w", "text": "Built into the ATS.", "timestamp": "2025-10-31T11:30:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm7zbe3", "text": "Could you elaborate on this a little bit? What do you Boolean search for? Do you type in exact strings to match with the resume? What part of the job description details do you pull from most (responsibilities, qualifications, etc.) for example, if “copywriting for social content” is listed as a responsibility, but not explicitly spelled out in the qualifications, do you search for both?\n\nI’m struggling to get traction in the job market and so I’m trying to understand how ATS works on your end. Thanks for any insights.", "timestamp": "2025-10-30T16:55:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm87ujt", "text": "I type in basic words from the job description that are listed in required. I slowly eliminate some words based on how many applicants that brings back.\n\nEdit: for your example, I’d type it but when job titles can be called multiple things I try to keep things generic as possible.", "timestamp": "2025-10-30T17:36:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nltf3wz", "text": "Of course I pre-load my requisitions with knock out questions and, yes, I will review the rejected candidates for thoroughness. Yes, it does become tedious when reviewing a req that has been highly subscribed, especially when so many candidates with H-1B work visas apply (the company does not sponsor). However, fairness to each candidate is paramount.", "timestamp": "2025-10-28T12:26:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1r0jf", "text": "Exactly. I don't want to miss out on a good candidate, and going through so many resumes is very time consuming. Have you explored any AI tools for screening yet?", "timestamp": "2025-10-29T17:59:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1ry7z", "text": "No. I want to be able to confidently say each candidate was reviewed by me.", "timestamp": "2025-10-29T18:04:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5bep1", "text": "\\^ The Real MVP", "timestamp": "2025-10-30T06:11:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5eg1y", "text": "Waste of time. Not best use of your time.", "timestamp": "2025-10-30T06:41:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5hr12", "text": "Meanwhile, I fill positions and the hiring team is happy.", "timestamp": "2025-10-30T07:15:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm8jmno", "text": "So what else do you spend your time on, if this is recruiting?", "timestamp": "2025-10-30T18:32:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmosxcs", "text": "Sourcing (I do not depend on the posting exclusively), follow up with active candidates, weekly hiring team meetings, weekly meetings with compensation, benefits and HR", "timestamp": "2025-11-02T11:42:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5edr8", "text": "What's point of knockout questions if you are going to still review? Then they are not actually knowck out questions. \n\nIf so many candidates are H1b just have if they require sponsorship as knock out question like every other company does.", "timestamp": "2025-10-30T06:41:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5hp5r", "text": "Within the ATS, candidates that do not possess the required skills or experience based on the knock out questions are highlighted. I then focus on the candidates that may be a fit (usually much fewer). Then, I review the highlighted candidates for final review. This makes the process much more efficient", "timestamp": "2025-10-30T07:14:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlsuq5p", "text": "depends on the ats:\n\nput in questions .. some ats will allow auto reject.\n\n- quick scan of actual answers to questions.  with 300 applicants, reject those who don’t take the time to answer properly.  i’m sure r/recruitnghell will state they don’t have the time to fill in all questions - but the ones that do will stick out. check those first. \n\nsome allow filtering by location - often get overseas or non target country applications even though it would clearly state where we are willing to hire remotely.  \n\nthen actually check the final filtered one by one….\n\nsome may suggest using an ai tool or pitch theirs. results vary.  have seen some tools miss fantastic candidates because some arent the best at writing resumes. \n\ncan also build your own local ai tool with various open source tools such as ollama if you can read up on it. simple and free and no privacy issues.\n\nbut yeah, go through them if you don’t have an ats…", "timestamp": "2025-10-28T09:46:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1q8j7", "text": "Thanks for the detailed response! 🙌🏻\n\nBut isn't going through all the data too tedious? Especially now when you can build agents to do this work. Just thinking out loud and trying to understand if recruiters are interested in exploring AI tools to screen the candidates.", "timestamp": "2025-10-29T17:56:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm3azhs", "text": "there are so many AI tools out there and made by those who have a long history in recruitment which it seems you don’t. \n\nseems like you didn’t read my comment and are just trying a weird engagement thing to pitch your version…. very crowded market", "timestamp": "2025-10-29T22:28:03Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm65www", "text": "I read your comment. In all honesty, this is no engagement stunt. Like I said, I was just thinking out loud, but thank you for taking out time to drop a comment. Appreciate the help!", "timestamp": "2025-10-30T11:04:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlukic5", "text": "Yes, I go through them manually. But you can remove at least 30% without really looking at the resume. Then you can take about 10-20s per CV and be done in one day. With enough knowledge of the role, this is doable.", "timestamp": "2025-10-28T16:03:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1tuw8", "text": "I don't want to miss out a good candidate :/\nHave you explored any solutions that can, maybe, scan/screen all the candidates and give you the best ones?", "timestamp": "2025-10-29T18:13:10Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm2q49a", "text": "No, I don't need these. I prefer to screen them myself 🫡 I work in a very niche industry, and I feel like such tools would never be able to tailor to the nuance of what we're looking for (or that setting up the tool in a way that it can capture that nuance would require hundreds of hours of work, something I can afford since I effectively do two jobs and only do recruitment 20% of my time 😂). \n\nI have 10 years of experience, 5 of which are in that niche industry, I think that is what is required to stiff through 300 applicants a day. Once you're done, you should be able to find a candidate if you have even only 10 good ones. Usually the passthrough rate is about 10:1 between the first interview and hiring, as long as you are very critical on the screening.", "timestamp": "2025-10-29T20:45:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nltvpt1", "text": "Due to increasing applicant volume your best course of action is to screen applications in the order they are received and stop when you have a decent slate of viable candidates.  If that means screening only the first 10, that's a nice little victory from a workload perspective.  If it takes 100 or more, then that's what it takes.  But note that there is no legal obligation to review every applicant but for compliance reasons, it is key to review them in the order received rather than cherry-picking.  \n\nYou should also ensure your ATS includes a disposition code for rejecting those un-reviewed applications as *\"not considered (position already filled)\"* or something similar.  \n\nReceiving 300 applications isn't all that bad by comparison.  I recently posted a technical role that received over 1,200, all but a handful of which weren't viable.", "timestamp": "2025-10-28T14:00:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1ti2u", "text": "How much time did it take you to screen those 1200 candidates? Did you do it manually?", "timestamp": "2025-10-29T18:11:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm20fao", "text": "I didn't screen all 1,200, I got through about 500 before I had a slate of candidates I could be comfortable with.\n\nI did have to do that screening manually, but it actually went pretty quick.  We work onsite 3 days per week, so I prioritized local candidates. I then eliminated a ton of folks who were recent grads that didn't meet the 5-year experience requirement for the posted role.  After that it came down to skillset.  All in, it took me the better part of a single afternoon to build my initial contact list. Had those calls gone poorly, I would gone back to screen additional applicants but fortunately, I didn't have to.\n\nIt's also worth noting that I took the post down when it the 1,200 mark. I learned from that experience and now take my postings down when they hit 500.", "timestamp": "2025-10-29T18:44:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm405rk", "text": "OK, and when you say manually,  you mean 500 Resumes, one by one on your computer and scanning them with your eyes?  I'm being serious,  here.  \nIt's super scary when there is no rhyme or reason or consistent process across industries and companies.", "timestamp": "2025-10-30T00:46:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm6unnj", "text": "You are correct, 1 resume at a time within my ATS, reviewed by me, not by AI. I use an ATS that allows me to do so relatively quickly.  I simply hit a button that says, 'Start Review' and it allows me to quickly walk through applicants one by one in the order in which they applied.  On the candidate profile there are two buttons, a simple 'yes' and 'no'.  If I select no upon reviewing the resume I'm presented with an option to reject the candidate, select a specific disposition and send them an email notifying them they were not selected. If I select 'yes' the candidate moves to the next stage of the workflow and I'm then presented with the next candidate in line.  Once I feel I've reviewed enough candidates to have a decent slate of people to talk to, I exit the review and click on that next stage in the workflow where I can mass email the selected candidates a link to provide their availability for a phone interview. \n\nSorry, that was a lot of detail, but I wanted to clarify what I'm working with system-wise.  I know every ATS is different and there are plenty of recruiters out there who don't have an ATS.  This is just what I have.\n\nYou really hit the nail on the head in noting that there isn't a consistent process across industries and companies.  I've been fortunate to spend my career as a tech recruiter inside tech companies that are willing to spend money on good tools.  I have friends that recruit for different industries or for companies that don't value tech and the stories they tell me about their recruiting tools and process are in stark contrast to mine.  I have one friend who still tracks candidates on an Excel spreadsheet and is accepting applications through an email on the company website.  In 2025!", "timestamp": "2025-10-30T13:38:40Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm8328i", "text": "Can you tell me about the process for eliminating recent grads? I have never used an ATS system, and am a job candidate.  I’m asking because I went back to school post-pandemic, so, I am a recent grad with a BA, MS, but also actively working towards an MBA.  That said, I had about 10 years of experience before going back to school, and have taken on intermittent work since then as well.  \n\nSo, for example, do you parse for something like “graduated between YEAR - YEAR” and then knock out those candidates? Also, do you have any advice for how to communicate that academics have been my primary focus so that the reader understands why the relevant work cools down around that period? For instance, the only breaks where I have not been enrolled at about 1.5x full time enrollment were inbetween starting one degree and beginning the next.\n\nI don’t know if ATS can even parse my education section correctly.  Right now my resume looks something like this, \n\nEducation\nUniversity of XYZ / 2021 — Present\nMBA, certificate: AI in business / eta: 2026\nMS, Marketing / 2025\nBA, Digital Media / 2023\nFocus: AI, Brand, Business, &amp; Marketing Innovation. \n- GPA (MS): 3.95 / 4.0\n- GPA (MBA): 4.0 / 4.0", "timestamp": "2025-10-30T17:13:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmfzdqm", "text": "How bad are some of the misses? I see people talking about applying to thousands of jobs, which tells me they aren’t remotely qualified for any of them. I recall a manager telling me he was getting resumes from people that had never used a computer applying for database jobs.", "timestamp": "2025-10-31T21:58:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmsm3gc", "text": "I'm lucky being a tech recruiter I suppose in that the vast majority of my applicants that miss the mark aren't egregious.  Almost all fall into one of three categories:  \n\\- Didn't meet the minimum requirements for years of experience  \n\\- Location (we're onsite and often have folks apply who live in other states. I have templated response email I send to confirm they are relocating. None of them are.  \n\\- Temporary visa holders and we don't provide sponsorship.  This is noted in both our job description and in the screening questions.", "timestamp": "2025-11-02T23:51:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5ew9g", "text": "So if the top candidates are in the last 500 you miss them. Not a good process at all. Poor use of your time , slows hiring down and you may very well miss best candidates.", "timestamp": "2025-10-30T06:46:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm6t0b9", "text": "Define top candidate? The challenge with our line of work is that there is always someone better if you just look long enough. That is why you so often in this forum see recruiters lamenting hiring managers that have good candidates in play but ask to see more.  \n\nI also have to disagree with your assertion that my approach is a poor use of my time and slowing hiring.  Reviewing every applicant out of that 1,200 would take much longer than it took me to review less than half of them.  Had I found good candidates in the first ten, it would have taken even less time.  The more applicants I review, the longer it takes and that is how the process slows.  If you have a different explanation of how time works, lay it on me.", "timestamp": "2025-10-30T13:29:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmaspml", "text": "Hiring is just a coin toss anyway.", "timestamp": "2025-10-31T01:45:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nltltkf", "text": "You don't have to screen all the resume. You can probably get 5 candidates from first 3x resumes. Pass them to the hiring manager and look for feedback. Only go back to screen ing if those resumes aren't working.", "timestamp": "2025-10-28T13:06:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1qqf5", "text": "That's one hack. :p", "timestamp": "2025-10-29T17:58:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlwyrfl", "text": "It takes me three seconds to know if a candidate is a potential fit. 3s x 300 resumes is only 15 mins. Just immediately decline those that are obviously not qualified, then you can go through the resumes of potential fits in a bit more detail. \n\nBut also you should be filtering with your ATS and going in order of application. You don’t need to go through every resume if you find enough good ones.", "timestamp": "2025-10-28T23:11:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5buj3", "text": "If you stop when you find enough good ones, do you close the positing, or allow people to still apply?\n\nAlso if you know in 3 seconds, and the average person can read about 15 words in that time, are you only looking at the summary, companies worked for, job titles? \n\nI'm just curious for myself to see how to improve my resume, because I feel while many won't say it, this is the norm.", "timestamp": "2025-10-30T06:15:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1swj1", "text": "Woah, 3 seconds. It's definitely taking me a lot more time than that. What all do you look at when you're skimming through the resumes?", "timestamp": "2025-10-29T18:08:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlszllu", "text": "Set the screening questions tough as such according to the requirements. Review only those who fit the exact although there are people who lie and would still click yes even if they don't fit the requirement", "timestamp": "2025-10-28T10:30:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1s95e", "text": "True. Only if there was a way to quickly interview the candidates and get a brief report? That way we can filter high intent candidates and validate if they fit the requirement at least as a part of initial screening.", "timestamp": "2025-10-29T18:05:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm6s5u5", "text": "Yup, I do that although there are still going to be candidates who choose yes even if they don't fit in", "timestamp": "2025-10-30T13:25:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nltby2t", "text": "what kind of job and what requirements?", "timestamp": "2025-10-28T12:05:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1skid", "text": "Software development intern (focused on front end)", "timestamp": "2025-10-29T18:07:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1zulm", "text": "oh that’s bc it’s an intern role and everyone is qualified. search for the relevant frameworks/libraries and education and reject the rest.", "timestamp": "2025-10-29T18:41:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmathzk", "text": "It's fucking intern position. No need even for that. It should be assumed they will learn.\nBtw, I'm agreeing with you. OP should send based on marks, toss a coin, it's as good a candidate as any other. Education : software related? That's it. Requirements are met.\n\nCause OP doesn't really possess any relevant knowledge that would allow them to judge, anyway.", "timestamp": "2025-10-31T01:49:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlyystj", "text": "Honestly, I don’t even look at all the resumes anymore!  \nI use Recruiterflow and it has a feature called AIRA Matchmaker, it basically scans my whole database and pulls up the best matches automatically. Saves me from going through hundreds of resumes manually.", "timestamp": "2025-10-29T07:40:34Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm5c0pz", "text": "With this software, and the way you use it, are you essential for the process still? Just curious if a Hiring Manager can essentially do this?", "timestamp": "2025-10-30T06:17:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm62nb0", "text": "Yes, you are still needed on a human level, where you need to be the judge to see if that person will fit! But you just don't need not spend hours going through them in detail!", "timestamp": "2025-10-30T10:38:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1t3ec", "text": "That's cool. I'll give it a shot. Thanks! 🙌🏻", "timestamp": "2025-10-29T18:09:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm4f2u6", "text": "For every job post we create a form with disqualification criteria, asking exactly what is needed for the job. It helps, however is not a solution.\n\nNowadays the CVs are mostly ChatGPT refined to the job description, and with \"Easy Apply\" and all the AI auto-application software is becoming a challenge! \n\nThere is no fool proof solution, nowadays is AI eating AI.", "timestamp": "2025-10-30T02:11:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm7a54u", "text": "there are new tools also working with regex instead of ai, which lets you filter for skills, experience and so one without relying on ai.", "timestamp": "2025-10-30T14:55:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmapga9", "text": "My wife does it manually, for administrative assistant  or co-op for accounting firm roles. \nSometimes I help, out of curiosity.\n\nI always urge her to give people a chance and be less critical, especially when someone is already unemployed - you don't know what you will stumble on. And there is always a testing period - one month is more than enough to see whether it's going to click or not. I understand that it takes time to bring someone up to speed, but that's why you have to be very fast to part away during the trial period if the coin flip of hiring someone didn't work your way.", "timestamp": "2025-10-31T01:25:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmikbhe", "text": "I only read about the screening in this thread. But how do you send them an answer giving them feedback why they're not the right fit? And on AI screening. Do you have any concerns on legal requirements as HR Software falls under high risk at least with EU AI Act.", "timestamp": "2025-11-01T11:00:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmn0ebk", "text": "Boolean and caffeine. I get an average of 2k-5k applications a week for my desk load. Monday Wednesday and Friday I have two hours blocked as Do Not Disturb that I dedicate to just application/resume reviews.", "timestamp": "2025-11-02T02:23:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "noi140d", "text": "For overcoming this problem,\n\nI’ve built an AI tool that interviews candidates and shares a clean report to help you screen faster &amp; smarter.\n\nLet me know if it can help?", "timestamp": "2025-11-12T18:46:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "ntb3jom", "text": "Lol yeah, 300 resumes is the recruiter version of a boss fight.😅  \nBut we do not manually screen candidates or their resumes anymore. We use a talent assessment platform integrated with our ATS, which does the first-pass sorting for us.  \nSaves a ton of time and a bunch of “why did you apply for this??” moments.  \nTL;DR: let the tools do the heavy lifting, keep your eyeballs for the finalists.", "timestamp": "2025-12-10T16:03:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlsvy2m", "text": "If you’re using Ai to screen CVs only, it won’t work.", "timestamp": "2025-10-28T09:57:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1rfjh", "text": "What do you suggest?", "timestamp": "2025-10-29T18:01:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm23j1j", "text": "Yes used a few. Main reason not to screen CVs is they’re a document that is by definition a polished version of someone, based on history rather than potential. You’re just speeding up rejections, which isn’t good", "timestamp": "2025-10-29T18:58:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm7alia", "text": "i think ai is not the best solution. regex is just accurate and is provided by many companies out there", "timestamp": "2025-10-30T14:58:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmat8if", "text": "So, we all should play bullshit bingo? Which we do anyway, I guess.", "timestamp": "2025-10-31T01:48:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmc073m", "text": "why bingo? I said regex NOT AI. With regex there is no bingo, as the code really just compares the requirements as text, with the whole text of the application", "timestamp": "2025-10-31T07:34:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmc2883", "text": "AI has potential to \"read between the lines\", the regex doesn't, so each resume would need to include keywords exactly as they are in the job ad.", "timestamp": "2025-10-31T07:55:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nmc5rvs", "text": "no it would not. Programmers are actually not that dumb. If you for example search for a stack that includes express.js, in regex we could filter for express, expressJS, express.js and so on. so we simply need to add a file that has all sorts of the given requirement / any requirement", "timestamp": "2025-10-31T08:32:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlxo6to", "text": "No one uses AI to screen resumes", "timestamp": "2025-10-29T01:34:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nlz3ed1", "text": "I disagree", "timestamp": "2025-10-29T08:28:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1r8ki", "text": "Why do you think so? Have you tried exploring any tools yet?", "timestamp": "2025-10-29T18:00:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm1rtpx", "text": "I use it to understand jobs and the technology behind them better. I use it to help me rewrite something that I want to say, particularly in an email or a chat. I don’t use it to scan resumes. I do my best to read through/skim resumes. I don’t deal with boatloads of applicants though. I go out and find my people.\n\nedit: I will say there are certain clients who will send their candidates resumes through Gemini to find out if they’re a good match. For that client I do the same thing before sending candidates over.", "timestamp": "2025-10-29T18:03:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "nm6r7gl", "text": "This is a huge error. Using LLMs without proper rubric and criteria will create rank roulette. CVs will get different scores sometimes just because of server load", "timestamp": "2025-10-30T13:20:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
{"id": "no27r2q", "text": "ATS first. Then pre-recorded video interviewing. By that point, I just have a few candidates to talk to face to face. I recommend VidCruiter for video interviewing. Hope that helps.", "timestamp": "2025-11-10T05:25:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Candidate screening", "url": "https://www.reddit.com/r/recruiting/comments/1oi42if/candidate_screening/"}}
