{"id": "ix8paww", "text": "This is always a frustrating topic to me.  \n\nYes,  they are valid predictors of performance (when aligned with the job, for example extraversion for sales jobs).\n\nThis has been well established for decades. \n\nSchmidt, F. L., &amp; Hunter, J. E. (1998). The validity and utility of selection methods in personnel psychology: Practical and theoretical implications of 85 years of research findings. Psychological bulletin, 124(2), 262.\n\nBertua, C., Anderson, N., &amp; Salgado, J. F. (2005). The predictive validity of cognitive ability tests: A UK meta‐analysis. Journal of Occupational and Organizational psychology, 78(3), 387-409.\n\nShaffer, J. A., &amp; Postlethwaite, B. E. (2012). A matter of context: A meta‐analytic investigation of the relative validity of contextualized and noncontextualized personality measures. Personnel Psychology, 65(3), 445-494.\n\nNye, C. D., Ma, J., &amp; Wee, S. (2022). Cognitive Ability and Job Performance: Meta-analytic Evidence for the Validity of Narrow Cognitive Abilities. Journal of Business and Psychology, 1-21.\n\nRoth, P. L., &amp; Huffcutt, A. I. (2013). A meta-analysis of interviews and cognitive ability: Back to the future?. Journal of Personnel Psychology, 12(4), 157.\n\nSchmidt, F. L. (2002). The role of general cognitive ability and job performance: Why there cannot be a debate. In Role of General Mental Ability in industrial, Work, and Organizational Psychology (pp. 187-210). Psychology Press.\n\nMount, M. K., &amp; Barrick, M. R. (1998). Five reasons why the “big five” article has been frequently cited: The big five personality dimensions and job performance: A meta‐analysis. Personnel psychology, 51(4), 849-857.\n\nSackett, P. R., Zhang, C., Berry, C. M., &amp; Lievens, F. (2021). Revisiting meta-analytic estimates of validity in personnel selection: Addressing systematic overcorrection for restriction of range. Journal of Applied Psychology.\n\nSome characteristics are valid for nearly all jobs (e.g., conscientuousness and cognitive ability). \n\nSome companies do design really crappy ones though that are not valid measurements of the thing they are trying to measure.\n\nAll of this said, they obviously shish be the only thing used (e.g., resume, skills test, interviews, etc.).", "timestamp": "2022-11-21T16:38:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbyyta", "text": "I'm a big nerd for assessing individual differences in selection, so really appreciate this post.\n\nJust to add to that, I find people often think that when a candidate scores high on X they will always be performing good at Y. While that could generally be true, as the hiring party you might not be aware of certain moderating variables where in this specific case, the X Y relationship isn't there. In my view, the use of assessments in selection is about increasing your chances of succesful hires, not about ensuring every hire is succesful.", "timestamp": "2022-11-22T08:13:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixdfjvr", "text": "&gt; Some companies do design really crappy ones though that are not valid measurements of the thing they are trying to measure.\n\nLooking through job offers, I've only really seen companies use shitty tests.   \n\nThey're usually employed by HR people, not by IO psychologists, and that shows.", "timestamp": "2022-11-22T16:44:10Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixb6cqg", "text": "Take my upvote. Best response of the day on Reddit", "timestamp": "2022-11-22T03:08:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbaetc", "text": "Just wanted to add additional commentary here: There is an entire field (IO psychology) and other areas (management, org sociology) that have researchers who dedicate their lives to the rigorous study of personality and cognitive tests in selection. These questions have been asked and answered and will be continue to be investigated rigorously, psychometrically, and robustly. \n\nIt’s fair that people don’t know about these fields and the work they do, but just want to let you know, OP, these questions are being thoroughly explored and personality and cognitive ability tests have utility when it comes to hiring when used correctly. (That’s not to say they are not without issues)\n\nOf course all the research in the world won’t force a company to use these tools correctly. But many strive to do so. \n\nIt’s simply physically impossible for many companies to not use automated recruitment tools in hiring processes - especially those with general skill requirements that get 100’s of applications if not 1000’s. There’s ample evidence (empirical and scientific) that shows bias and harm is much greater from individual judging other individuals based on their perceptions. But again, there’s room for bias everywhere and systems are not always perfect. \n\nApplicant experience, procedural justice, and perceptions of processed are also widely studied by IO psychologists. So you’re asking the right questions but perhaps not to the right audience, try google scholar to explore some of these questions as well.", "timestamp": "2022-11-22T03:42:12Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "iz62q73", "text": "&gt;Of course all the research in the world won’t force a company to use these tools correctly.\n\nFear of litigation for discrimination keeps some of this in check. That fear should keep companies at least using well validated assessments for job relatedness and business necessity. You would think ethics would do that too. Ultimately people just don't know.\n\nGreat response by the way!", "timestamp": "2022-12-06T19:19:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbp0e5", "text": "this is incredibly see through, sort of like faking adhd, I've never seen a corporate personality exam that wasn't some fluffed version of MBTI.\n\nAre people seriously thinking that it isnt easy to map questions to which of the big 5 they’re interested in. Gee I wonder what questions are fishing for conscientiousness, as if any 12 year old with half a brain couldnt figure this out.", "timestamp": "2022-11-22T06:06:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "iz63bkt", "text": "&gt;this is incredibly see through, sort of like faking adhd, I've never seen a corporate personality exam that wasn't some fluffed version of MBTI.\n\nSo you are clearly not knowledgeable about the very complex and nuanced subject.\n\n&gt;Are people seriously thinking that it isnt easy to map questions to which of the big 5 they’re interested in\n\nSome people do think it's easy to guess what is being measured. Your post is evidence of that. It is not easy and there are very complicated and rigorous processes to make sure the assessments are actually measuring what they are intended to do and that the output of the test and each item are reliable and valid.\n\n&gt;Gee I wonder what questions are fishing for conscientiousness, as if any 12 year old with half a brain couldnt figure this out.\n\nYou'd be surprised there are ways to mask this and to catch people responding dishonestly.", "timestamp": "2022-12-06T19:22:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixafuco", "text": "Cross-posted in r/IOPsychology for input, as they're the folks who develop these.", "timestamp": "2022-11-21T23:44:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixcld5o", "text": "Cool ![gif](emote|free_emotes_pack|feels_good_man)", "timestamp": "2022-11-22T12:56:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8r8qa", "text": "Really surprised at the responses here. \n\n[This article discusses a meta-study of over 100 years of hiring research](https://medium.com/org-hacking/want-to-improve-recruiting-start-by-learning-from-100-years-of-research-schmidt-a1daa29efcfb) and found that General Mental Ability tests and integrity tests actually are the best combination of predictors for future performance on average. Better than 31 other predictors like years of experience, interviews, phone screens, reference checks, etc. according to their data.\n\nNow, whether or not a company is using a validated test for their process is a whole other can of worms, but the concept as a whole isn't ridiculous at all.", "timestamp": "2022-11-21T16:52:03Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix9g0l5", "text": "I'm surprised I had to scroll almost to the bottom just to find one citation.\nThanks for the reference, great read!", "timestamp": "2022-11-21T19:35:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "m0locq5", "text": "homie messed up the math so its not entirely accurate", "timestamp": "2024-12-05T21:10:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "m0ms9go", "text": "It's funny because I went digging through the original study some time ago and the way the numbers are presented on the study don't match *any* of the easier to read articles about the study that I could find. I don't know where things are getting lost in translation. Its annoying cause the data is really interesting but the study requires a bit of deciphering from what I recall.", "timestamp": "2024-12-06T00:55:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix90rd3", "text": "Yeah...but no. I know I'm going to send an article from Vice which is not a scientific paper, but I still like the way they summarize it.\n\nhttps://www.vice.com/en/article/bjv8y5/the-myers-briggs-personality-test-bullshit", "timestamp": "2022-11-21T17:55:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixal2pb", "text": "You won't find anyone in the r/iopsychology sub that thinks the MBTI should be used in the selection process. Generally, it's not used in selection - Personality tests developed on the big 5 theory of personality are.", "timestamp": "2022-11-22T00:25:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix93vd1", "text": "That's about one specific personality test. The post was describing personality tests and cognitive tests as a whole and the culture of screening candidates out based on those kinds of criteria. According to the research I was looking at, that's a valid thing to do if done right. At least more valid than many other very common methods like totaling up experience or using reference checks, etc. The paper even examines other types of \"personality\" tests that are specifically for conscientiousness or interests, and they fair worse than the integrity and GMA style tests. So I am not saying every personality test is good. \n\nNo doubt there are some very stupid personality tests out there in the selection process, but the practice itself isn't unfounded so you'd have to critique on a case by case basis.", "timestamp": "2022-11-21T18:15:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixaperq", "text": "What everyone else has said, MBTI is snake oil. Big 5 has validation evidence to support its use", "timestamp": "2022-11-22T00:59:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixb2m4j", "text": "Any one who has study personality psychology will tell MBTI is bullshit.", "timestamp": "2022-11-22T02:39:40Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbz6xc", "text": "Anyone with a functioning brain will probably also be able to tell this", "timestamp": "2022-11-22T08:17:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc08vm", "text": "There seems to be a lot of people without functioning brains then.", "timestamp": "2022-11-22T08:32:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc0eb6", "text": "To be fair, that sort of matches expectations lol", "timestamp": "2022-11-22T08:34:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix7x58s", "text": "After 20 years of recruiting and a good tech sense, I firmly believe cognitive/personality tests are not helpful and only create unfair walls around perceived good and bad fit candidates", "timestamp": "2022-11-21T13:01:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8xnww", "text": "Furthermore, studies have shown that cognitive testing is highly discriminating. They are normed on typically white, middle class families. If you are a person of color (ANY color other than white) you are going to automatically test lower. They often ask questions that require background knowledge that is culturally specific. For these reasons, some states (California, Larry P. VS Riles) have determined they cannot be administered to some students in schools. It’s wild that they use cognitive testing for jobs. That is a huge red flag they are probably screening for certain people. \n\nIn regards to personality testing, I think it depends. Many of those tests could be helpful if the goal is to learn how to best communicate with each new employee. My current job does that and our sites psychologist instructs managers on how to go about this.", "timestamp": "2022-11-21T17:35:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "iz658gr", "text": "&gt; studies have shown that cognitive testing is highly discriminating. They are normed on typically white, middle class families. \n\nThis is not the case in this day and age. A lot of the public's view and understanding of the topic are decades behind where the research and state of the art truly is. \n\nI was actually looking at the tech manual for a very high quality and widely used cognitive ability test earlier today. I'm pretty sure what I cite below will be dismissed but here goes:\n\n*Questions and associated information provided should* ***not cover any topic that might produce an advantage or disadvantage for a specific grou****p. o* ***Questions that demonstrate bias against members of a specific race, ethnicity, gender, or age group based on statistical analyses will be removed from the question pool****. o No questions will be included that require previous factual knowledge (e.g., formulas, measurement conversions, historical facts) outside of the information included in the associated question.* \n\nThe assessment I am reviewing is normed 58% white to 42% non-white subjects. Yes, that still heavily weighted toward white people, but it is also normed against people from around the world.\n\nThey are also not only translated for use around the globe but adapted to avoid any cultural misunderstanding which is another incredibly complicated process.\n\nAnd the tests are screening for certain people. Smart people capable of doing a job well.", "timestamp": "2022-12-06T19:35:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixclrer", "text": "Agree. There is also language discrimination. If the test is taken in a language that is not your mother tongue, you are probably scoring lower than you should be.", "timestamp": "2022-11-22T13:00:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix92cmv", "text": "I’m an expert at the Myers-Briggs, and I agree it’s helpful to streamline communication. I find that the risks of misuse far outweigh the benefits of application though, IMHO", "timestamp": "2022-11-21T18:05:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbaxwf", "text": "What does it mean to be an expert in the Meyers Briggs? Especially since it's not even a valid test for recruitment and selection and barely correlates with other tests of personality", "timestamp": "2022-11-22T03:46:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbyc5u", "text": "Maybe I should say I’m proficient rather than an expert for precision of language. It means that I have spent many many hours reading about and applying the test. The scales are pretty impactful in my opinion. I have a Psychology background but I’ve never been a clinician.", "timestamp": "2022-11-22T08:05:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbyo0d", "text": "As a PhD in psychology, you're going to have to do better than \"in my experience\"\n\nThe MBTI should not be used for hiring purposes. It's even on their website. It's NOT a real psychological assessment and is less well made than your average buzz feed quiz about what is your favorite type of pizza.\n\n\nThere are endless academic and non academic sources explaining why you should not use the MBTI. It is not a valid psychometric instrument and using it for hiring can open up ones company to serious legal liability.", "timestamp": "2022-11-22T08:09:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbzn2y", "text": "Furthermore, understanding a person’s preferential method for taking in information is not buzzfeed at all. Saying that someone is more literal, present-minded, detailed and observant can be very helpful to understand their lens of communication versus someone who is more big picture, perhaps sarcastic and conceptual who is always anticipating rather than experiencing. I find the test to have merit. I just haven’t personally used it since around the 1990s/early 2000s.", "timestamp": "2022-11-22T08:23:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc0c1a", "text": "What you've said is true, the problem is the MBTI doesn't tell you any of that lol. A real, valid, scientifically designed personality test will.", "timestamp": "2022-11-22T08:33:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbz8xd", "text": "I don’t use it in hiring decisions/at work. In my experience spans as long as many people’s careers! Per my comments above I’ve been clear I don’t find personality tests appropriate for the workplace.", "timestamp": "2022-11-22T08:17:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc07kp", "text": "Why not? They are perfectly useful tools for predicting performance and other workplace behaviours.", "timestamp": "2022-11-22T08:31:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc5hcd", "text": "Having a hundred years of experience with MBTI doesn't mean it can't be a poor psychometric test (which it is).", "timestamp": "2022-11-22T09:47:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixdbr9v", "text": "MBTI should stay faaar away from any recruiting or hiring process. At best can be used as an icebreaker for people who like letters. \nNo validity or reliability, and will definitely not hold up in court.", "timestamp": "2022-11-22T16:18:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixajymq", "text": "Kolbe and Predictive index are the only two legally allowed in preemployment screening because the rest are inherently discriminatory.", "timestamp": "2022-11-22T00:16:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixap2er", "text": "Not true at all", "timestamp": "2022-11-22T00:56:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixba6ud", "text": "Which part?", "timestamp": "2022-11-22T03:40:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbix0y", "text": "Validation and equity studies are done on a case by case basis. You wouldn’t say one particular assessment isn’t “legally allowed” because it’s dependent on the individual job/role that you are wanting to use it for. Lots of other assessments besides those 2 can be legally fine to use if you have solid supporting evidence/research to back it up. Legally it only becomes an issue if there is adverse impact, but even if there is you can still use those types of assessments if you have both content validation evidence (I.e., the assessment is job related) and criterion related evidence (I.e., the assessment is predictive of job performance). So for example, the Predictive Index could be fine to use for one type of job but not for another type, it depends on the population you are recruiting for and if the assessment is meant for that type of role.\n\nThere are entire companies that are dedicated to pre-hire assessments that don’t use the 2 assessments you mentioned.", "timestamp": "2022-11-22T05:01:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8y1yx", "text": "It is mostly a result of moving the hiring process on-line. In the way back machine you used to have interviews face to face. During those interviews I had the option to assess your personality first hand. Even with zoom type interviews this isn’t possible today. I’m sure that turnover has been affected by this as well. For most businesses you can train people with technical shortcomings but you can only fire a douche. More tech= more hiring problems.", "timestamp": "2022-11-21T17:37:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc4u7u", "text": "So there already have been a number of responses citing very good sources on the efficacy of assessment in selection, so I won't bother going into that any further. I would instead just like to address the reason(s) why I think people tend to be quite dismissive when it comes to these kinds of assessments.\n\nOn the surface, what candidates get to see is just a bunch of often somewhat silly questions of which they're told they should be measuring personality. And with only the information at hand, I do think these assessments come across as pseudo-science. \n\nOftentimes when I talk to people about cognitive capabilities or personality assessments, I find people think these concepts are too complicated to be reliably and accurately represented by an assessment or score, which I guess has some truth to it. Such assessments will always be an oversimplification of the underlying construct. However, that does not mean that these assessments are not reliable or valid. There is for example predictive validity (among other types of validity) to these assessments, meaning we can predict real world, often valuable, outcomes. This does to me imply that at the very least there is something we're measuring that has some value to it.\n\nOf course this does not mean there are no adverse effects of conducting assessments, I believe there were even several papers published on this not too long ago. Additionally, it also does not mean there's not a crap ton on BS tests that are just glorified corporate horoscopes. Seems obvious to have to mention, but people better stay away from those. You might be better off just flipping a coin.\n\nHaving said that, I do generally find people just don't have a solid enough grasp of survey design, research methodology and statistics to be able to judge the efficacy of such assessments fairly, which is understandable, these topics can be very dry and boring to a lot of people. And it's good to be skeptical of course (it's even my favorite hobby), but it's difficult to argue you can deliver fair criticism to such assessments without fully understanding them in my view.", "timestamp": "2022-11-22T09:38:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixarbpy", "text": "I was thinking about this the other day too, because I feel annoyed as a candidate when I have to do all this interview prep and then sit exams.  I found them humiliating and annoying too.  \n\n\nBut I started also thinking, is the purpose to give candidates who aren’t the strongest interviewers another way to showcase themselves?  We all have a story of a colleague who’s great at talking/interviewing but was terrible at the job.", "timestamp": "2022-11-22T01:14:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8b3ai", "text": "My short answer is no. But, I did use the Predictive Index in a past life and I can say with out a doubt it was the best tool I have ever used. I used as such a tool, never to outright make a decision. It had two questions: Check off words that describe yourself and check off words that you feel others describe you. Once that was complete it created a profile. Things like it takes time for this person to warm up to others. They are loose with rules. Things of that nature. I found it very helpful to deliver to hiring managers as this was the ‘type’ of person I was submitting. It also came with a selection of behavioral interview questions.", "timestamp": "2022-11-21T14:58:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8f8m3", "text": "I second this!", "timestamp": "2022-11-21T15:28:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixaxle2", "text": "Well they can't always be right because I think we all know people who think they have a different personality than everyone around them thinks they do!", "timestamp": "2022-11-22T02:01:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix7w9oo", "text": "I doubt you'd ever be able to find truly scientific proof, because these tests are all designed by different companies using different methodologies. I'm pretty sure that some are better than others, and there are a lot of really useless ones out there. At one point in my career, I took one of these tests that was supposed to assess the working relationship I'd have with my boss, the CEO. I 'passed' with flying colors. Two months in, I handed in my resignation, because it was hands-down the worst working relationship I've ever had.\n\nMy general thought is that companies should never use these as hiring decision-makers. A test shouldn't be the reason you decide to hire someone or not. If they're used as a management tool, I think the good ones could be useful. To help managers understand how an incoming employee is best coached and managed, what kinds of things motivate them, that sort of thing.", "timestamp": "2022-11-21T12:52:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc19z9", "text": "If only there were a scholarly search engine where you could see if there was scientific proof instead of making claims based on your limited experience. I can save you the time, there is a lot of evidence to the contrary of what youre confidently claiming. https://scholar.google.com/scholar?hl=en&amp;as_sdt=0%2C48&amp;q=meta+analytic+estimate+personnel+selection&amp;btnG=\n\n\nAlso this is a “dont let perfect get in the way of better” scenarios. If not one of these (scientifically supported) tests, what assessment will you employ instead? A conversation or two about a resume (a known source of bias and less accurate assessment) and maybe a job knowledge interview thrown together by the hiring team in between doing their actual work? Are they going to put together a properly structured rigorous selection system based on a thorough analysis of the job?", "timestamp": "2022-11-22T08:46:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixcsrfs", "text": "Oh, man. Where to even start with this pompous, arrogant dog's breakfast of a comment.\n\n&gt;If only there were a scholarly search engine where you could see if there was scientific proof ...\n\nScientific studies are interesting from an academic standpoint. And in this case, for the purpose of *answering the question that OP was asking*, pretty much inapplicable to the real world. For the ***scientific proof*** you're demanding, an experiment would need controls related to the empirical qualifications of the candidates, the working environments they're going into, and the circumstances under which the tests are applied (so you're comparing apples to apples). The tests would have to assess performance over time, and of course the performance measures would have to be strictly objective and identical across the board. Oh, and it would also have to apply those same controls testing multiple assessments, since - as I pointed out before - there are literally hundreds of these assessments, and some are certainly going to be better than others. So, no. There's no 'scientific proof' available to answer OP's question.\n\n&gt;making claims based on your limited experience\n\nYou mean my 'limited experience' of over 25 years recruiting (agency and in-house), and hiring people, including the use of probably a dozen different kinds of these assessments over the years? Okey dokey.\n\n&gt;there is a lot of evidence to the contrary of what youre ***confidently claiming***.\n\nIf you weren't comprehension-challenged, you would have seen that my actual words were 'I doubt you'd ever be able to find truly scientific proof'. Odd words to use when making a 'confident claim'.\n\nBut hey. Don't let logic and facts stop you from starring in your own movie.", "timestamp": "2022-11-22T14:01:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixd6v7l", "text": "I might have come in a little spicy, but you can still confidently encourage doubt which you did with claims like “companies should never use these as hiring decision-makers”.\n\nA meta analysis uses a combination of hundreds of studies to isolate the effects of interest and to show how it varies with variation in the context. Scientifically derived tests adhere to common models and part of proving their value is showing the degree with which their measurement agrees with the tests of the same model which allows you to pool across given sufficient convergence. Yes implementations vary but we can quantify and model that variance. If you want to argue semantics with what op meant by scientific proof (I’m not interested in reducing this down to I think therefore I am) that’s your prerogative, but given the evidence there is much more support for these assessments working than not.\n\nYes 25 years of one view is a very limited amount of experience, which is why it’s better to rely on large numbers of data points collected over decades. if all you’re pulling from is your own narrow view of the world (not a jab, all of our views are) you will be relying on limited experience. Also a note on experience. 25 years of doing something incorrectly/ignorantly only means that you’ve cemented this nonsense, practice doesn’t make perfect, practice makes permanent, perfect practice makes perfect.\n\n“Logic and facts” is your response to me citing the most accepted, research backed stance and you citing your gut (as well as a few misunderstandings of science).", "timestamp": "2022-11-22T15:45:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixduv15", "text": "We're going to have to agree to disagree about whether academic studies of some assessments scientifically support the effectiveness of the innumerable assessments available on the market. But I stand by this statement:\n\n&gt;you can still confidently encourage doubt which you did with claims like “companies should never use these as hiring decision-makers”.\n\nI chose my words carefully; *a test should not make a hiring decision*. If you're going to throw out the informed judgement of several people in the hiring process (assuming that the hiring process has been well designed and executed), and either a) hire a candidate nobody was confident in because the test results were good, or b) reject a candidate everyone felt was strong because their test results were poor, you're not doing it right.", "timestamp": "2022-11-22T18:23:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixgq25a", "text": "Too tired for a full fledged thing. But high level points:\n\nNot all assessments are legit (e.g., mbti, disc, pymetrics, enneagram) but op asked for any not all. These academic studie\n\nTests are physically incapable of making decisions as they are not sentient. Making decisions based off rigorous systematic standardized processes are generally a good way to avoid bias and improve validity, and what is a test if not a systematic, standardized set of questions. \n\nYou say you choose your words carefully but then say things like “reject a candidate everyone felt was strong”. Feelings do not abide by a lot of best practices with employee selection, not to mention loaded with bias, because guess what, people tend to feel better about people who are like themselves (similar to me bias, aka birds of a feather bias). This is a sure fire way to homogenize your workforce.\n\nI dunno dude, sorry I offended you, but also im kinda bummed you’ve been pushing this stance for 25 years. Especially when personality meta analyses date back 31 years… and thats just meta analyses, which are the culmination of many other studies that predate them.\n\nEdit: guess I wasn’t too tired given the length of my response 😅", "timestamp": "2022-11-23T08:51:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixhe77f", "text": "&gt;You say you choose your words carefully but then say things like “reject a candidate everyone felt was strong”. Feelings do not abide by a lot of best practices with employee selection, not to mention loaded with bias, because guess what, people tend to feel better about people who are like themselves (similar to me bias, aka birds of a feather bias). This is a sure fire way to homogenize your workforce.\n\nAt the risk of being pedantic, definitions for 'feel' also include: 'to ascertain by cautious trial', 'to be aware of by instinct or inference', and 'to have a marked sentiment or opinion'.\n\nI'm not arguing that the hiring process is perfect, but *when it's done well*, it's better than anything else that's come along. Delegating a decision to test results, in an effort to eliminate bias, only introduces a different set of biases. A person's state when they're taking a test - whether it's text anxiety or a state unrelated to the fact that they're taking the test - can have a massive effect on the outcome. I'd rather focus on making the human element of a hiring process better by following best practices and improving on those, than override the human element with a (potentially flawed) test.\r  \n\n\n&gt;I dunno dude, sorry I offended you, but also im kinda bummed you’ve been pushing this stance for 25 years. Especially when personality meta analyses date back 31 years… and thats just meta analyses, which are the culmination of many other studies that predate them.\n\nI haven't been pushing any stance for 25 years. When clients have told me that they wanted to use an assessment, I've put candidates through the assessment. When colleagues wanted to use assessments, I've used them. I've expressed opinions about them from time to time, and encouraged people to use the results in better ways, but only in rare cases have I 'pushed' my opinion. (Also, appreciate the apology but it's not necessary. I don't offend easily, and wasn't offended at all.)", "timestamp": "2022-11-23T13:43:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "izaqih5", "text": "Doing the Lord’s (IO’s) work here woooohh love this response", "timestamp": "2022-12-07T18:58:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "iz66md3", "text": "&gt;Scientific studies are interesting from an academic standpoint. And in this case, for the purpose of   \n&gt;  \n&gt;answering the question that OP was asking  \n&gt;  \n&gt;, pretty much inapplicable to the real world.\n\nJust had a conversation about this \"real world experience\" as more reliable than scientific evidence earlier today.  It's the same as overestimating \"gut feelings\" and \"common sense\"\n\n&gt;If you weren't comprehension-challenged,\n\nTrust me. u/bonferoni is far from comprehension-challenged in this field.", "timestamp": "2022-12-06T19:43:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "iz65w4l", "text": "&gt;I doubt you'd ever be able to find truly scientific proof, because these tests are all designed by different companies using different methodologies.\n\nYou can compare and contrast these things to validate the usefulness of the results. That's a very fundamental aspect of developing them and making sure they are doing what they are supposed to do. In fact this cross over validity is exactly how intelligence was found to be a psychometric property in the first place.", "timestamp": "2022-12-06T19:39:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8y24z", "text": "There is actually wide evidence that supports they are biased and do not have good sensitivity or reliability. They are not necessarily good measures for a lot beyond baselining and measuring cognitive change. This is mostly do to design or study flaws where. They could be improved upon, but as of yet, that hasn’t happened.", "timestamp": "2022-11-21T17:37:34Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc06zo", "text": "Cog ability tests show group differences (different averages), which is not the same as bias (differential prediction), this is generally not true of scientifically developed personality tests (i.e., big five or hexaco based models rooted in the lexical hypothesis).\n\nAlso your reliability/sensitivity critique is only true of cog neuro assessments (like pymetrics, gag). Cog ability and personality tests have well documented stability over time, and when applied appropriately, validity (correlation with time lagged job performance).\n\nSee any of the many meta analyses that come up when you punch “employee selection meta analysis” into google scholar", "timestamp": "2022-11-22T08:31:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixgbj1d", "text": "Thank you for your excellent work, Bonferoni. Making all us I/Os proud!", "timestamp": "2022-11-23T05:44:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8fum0", "text": "its a red herring, a distraction. I would like to see a stat that shows the number of candidates hired and fired who scored high on cognitive tests. No one is giving correalations when selling their software ie Predictive Index", "timestamp": "2022-11-21T15:33:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8funv", "text": "Sorry, your submission has been automatically removed. Accounts with less than 5 comment karma a will be flagged for moderator approval. This is to combat spam.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruiting) if you have any questions or concerns.*", "timestamp": "2022-11-21T15:33:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix98t5p", "text": "The tests always make it clear who the superstars are supposed to be.\n\nOn the flip side...if a company is dumb enough to rely on this it is relatively easy to answer personality test questions in such a manner as to track into the superstar category. Don't be empathetic, emphasize your plan/data driven approach, indicate you make decisions quickly, when asked stupid things like \"what kind of car are you?\" the answer is always a Ferrari (refined, classic, fast). You are a visionary. You are NOT a dreamer etc.", "timestamp": "2022-11-21T18:48:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixa50pq", "text": "    I saw a video on Linkedin last week which compared claims of recruitment activity with effectiveness of products like face cream etc\n    \n    https://www.linkedin.com/posts/johnmillican_recruitment-hiring-hr-activity-6998423002115702784-rEJi", "timestamp": "2022-11-21T22:23:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbr3kq", "text": "Those are usually a signal that I will not enjoy working at that company. Essentially they help identify cooperative sheep so the company can do what they want without anyone to push back.", "timestamp": "2022-11-22T06:31:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc0ejj", "text": "While personality tests like MBTI &amp; DISC do reveal a lot of interesting insights, it is non-sensical to use from a hiring perspective, since there is no clear research establishing any link. Big 5 is the only one to have any consensus from the scientific community in terms of it's validity.\n\nAptitude or cognitive ability tests have however been proven to have the highest validity of any selection methods including structured interviews &amp; take home assignments. This article summarizes some of the findings of Schmidt and Hunter if you're keen to dive deeper: [https://www.adaface.com/blog/are-aptitude-tests-accurate/](https://www.adaface.com/blog/are-aptitude-tests-accurate/)", "timestamp": "2022-11-22T08:34:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixdby4w", "text": "It depends if the test was validated and specific outcomes were predictive of performance in that specific role. \nSource: I'm an IO psychology practitioner.", "timestamp": "2022-11-22T16:20:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8d27x", "text": "The personality tests are usually pet projects of really annoying hiring managers or senior leadership who think they’ve cracked the secret to good hiring.\n\nIt’s really stupid and those are usually stupid managers to work with.\n\nNot sure how automated recruitment could be tbh- ZipRecruiter tried and failed spectacularly.", "timestamp": "2022-11-21T15:13:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix9d3be", "text": "This has been the whole of my experience. I’ve completed several, and far as I know, my results were immediately filed in an HR folder, never read, never considered, never seen again.", "timestamp": "2022-11-21T19:16:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "iz673mm", "text": "&gt;The personality tests are usually pet projects of really annoying hiring managers or senior leadership who think they’ve cracked the secret to good hiring.\n\nSadly enough that's often true and another conversation I had earlier today. That's why there are experts, IO psychologists that should be consulted before implementing these things.", "timestamp": "2022-12-06T19:46:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix84q0m", "text": "No. They’re absurd. I won’t apply to positions that request them.", "timestamp": "2022-11-21T14:09:24Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "lod1vbr", "text": " It to mention that they are ableist. As an autistic recruiter. You are screening for —neurotypical normal thoughts. But what if you are not neurotypical? They isolate any good autistic candidate, and it is one of the biggest people s that the autistic community have with employment. It is absolutely discriminatory and we need to do better. ", "timestamp": "2024-09-22T13:56:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "lod1vdt", "text": "A phrase was caught in the insult filter: \"autistic\". This is a place for friendly discourse.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruiting) if you have any questions or concerns.*", "timestamp": "2024-09-22T13:56:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8qg9u", "text": "You misjudge what the purpose of many of those tests really are.\n\nI'm a big proponent of certain types of testing, but you have to understand that these tests only show someone's *preferences* in regards to work.  Not their skill-level or competency for the job.  This is one of the biggest misunderstandings.\n\nFor example:  Myers Briggs-  If I'm an employer who has had a bad previous experience and really wants to hire someone who genuinely **prefers** to sit in front of a computer and problem solve for hours on end without chatting up the receptionists around them, then hiring someone who scores an \"E\" on the Myers Briggs exam would not be a good idea and it would be a better idea to hire someone that scores an \"I\".\n\n***However that does not mean*** that someone who happens to score an \"E\" won't actually be the most skilled at the tasks of the job.  All it means is that this person who is the most skilled at the job is also going to be likely to chat up all the support staff as he works.  And most employers at the end of the day really won't care and just want the work done (and someone that they relatively enjoy working with).\n\nYou have to know what the tests really claim to accomplish.  The fact is that most employers just don't care much about anything as long as the person has a certain skill-set and they are likable enough as a person.  It's for this reason, that these tests are usually a waste of time for most hiring staff.  But in rare cases, they can be helpful.", "timestamp": "2022-11-21T16:46:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixc0ar6", "text": "While I appreciate the nuanced reply, just try to avoid MBTI at all cost. It's not very reliable (and thus by definition can't be called valid either), which means you could be basing your decisions on data that just simply doesn't represent reality. Better alternatives are assessments based on the Big Five personality model (e.g. HEXACO, NEO-PI-r). \n\nWhile these assessments do tend to roughly measure things like preferences, it is important to keep in mind that alignment of a person's preferences with a job's characteristics may actually allow a person to perform better. Having said that, it's also important to keep in mind that people can develop strategies to compensate for low (or high) scores in traits that otherwise would've been considered detrimental. If someone were to score low on the conscientiousness trait, they can try and bridge that gap by for instance, keeping detailed lists, scheduling, finding a structured approach to their work.", "timestamp": "2022-11-22T08:32:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixfv52q", "text": "What you're doing is the same as saying an English lit test is not reliable and invalid for measuring a person's ability to bake well.  Calling the English lit test invalid here is extremely unfair &amp; disingenuous.  The only thing invalid here is what you're using that test for.  It's not meant to measure how good a person is at baking so you can't call it invalid.  It's how *you're* using it that's invalid.\n\nNo.  There's no scientific proof that an English lit test works for baking. Why?  Because no scientist has bothered to test this.  Why would they?\n\nFor the same exact reason, there is no no scientific proof that a lot of personality/cognitive tests including MBTI work for recruitment.\n\n*edited for brevity*", "timestamp": "2022-11-23T03:09:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixqpc4k", "text": "I get where you're coming from and if I remember your comment pre-edit, you mention MBTI is about preferences. Which is largely what their website also states (though there is plenty of mention of personality there too).\n\nIt is however very difficult to argue that preferences in the context of the components that MBTI consists of would not be a part of personality. Heck, introversion/extraversion is even the same construct as the Big Five personality model (and you can easily argue overlap between MBTI components and other Big Five factors). If you look at for instance the HEXACO test (a pretty well researched personality inventory), you'll find that a lot of the questions are phrased in such a way that essentially they're just asking about preference. So in my view, MBTI claiming to assess anything other than personality is a very difficult to defend position and seems to be nothing more than just a way for them to be able to circumvent any sort of legitimate (scientific) criticism. \n\nThen, you mention: \"there is no no scientific proof that a lot of personality/cognitive tests [..] for recruitment\". Which is just simply not true (assuming we look at well-researched, reliable and valid psychometric tests), just take a look at the papers the other dude in this thread posted. Of course there are tests that measure something irrelevant to someone's post-hire performance (e.g. someone's baking ability may not be meaningful to take into account when hiring for basically any job other than baker), but the reality is that most of such tests don't hold any predicitive value simply because there's something wrong with the test. That could be conceptualization of a construct, it could be related to the survey design or a number of other reasons.\n\nAnd then even if we assume that MBTI does not intend to measure personality, but rather preferences. It doesn't make sense to categorize it in types. Take the thinking-feeling component for instance. People's preferences (and ironically enough, personality) are influenced by a crazy amount of independent factors, meaning that logically they'll follow a normal distribution. It's a lot more likely that people's preferences will fall on a spectrum somewhere between thinking AND feeling, rather than be one or the other. \n\nI'm not trying to be a dick about it or anything, but having a bit of understanding of survey design and research methodology goes quite a long way in being able to evaluate psychometric instruments. The reason why I mention this is that I feel that real harm can be done when the information you use to base decisions on is not well understood, or the instrument itself just simply doesn't reflect whatever it intends to measure very well.", "timestamp": "2022-11-25T15:54:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixqsquh", "text": "\"They mention preferences, Though they mention personality too...\"\n\n\\- They talk about peanut butter... but they mention Nut butters too...   Peanut butter is also a nut butter.  They're not different things... Nut butters is just a much more broad and non-specific, non-measurable term.\n\nYou do realize that \"personality\" is the same thing as preference, right?   But \"personality\" doesn't mean anything.  It's just a subjective term they are using to explain a very broad idea to laymen like you because most people think \"personality\" is a concrete thing.  Even you see it that way because you see it as different from preferences.  No one measures \"personality\".  Personality is simply broad subjective term that is synonymous to everything.\n\nThis only proves further that you do not understand how to use the test and it is therefore your use of it that is invalid.", "timestamp": "2022-11-25T16:20:34Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixr1jg3", "text": "Ok so I see you edited your post, so what I wrote below is largely still based on your initial reply, though I guess they're still the same arguments.\n\nBut yes, that's exactly my point! I would say preferences are inherently linked to personality. Though they're not the exact same, there is definitely overlap. So why then do you give the example of the English lit test as a means of assessing how well someone can bake? You even say they could almost be considered synonyms (which I actually partially agree with). Even stranger is that, if personality is too broad a term, why do Big Five based personality assessments have strong predictive validity for a number of outcomes (in hiring context, but also outside of that) and MBTI doesn't? You'd logically expect that a more specific assessment would have greater predicitve validity than an assessment measuring something more broad. \n\nAdditionally, if you look at actual research that assesses the reliability of MBTI you find that its test-retest reliability, interrater reliability and internal consistency scores are very poor and in most cases don't even meet an acceptable threshold. So whatever it even intends to be measuring, it objectively does a poor job at doing it reliably. This is the absolute minimum required for a test to have any value other than just entertainment. These types of reliability tests don't take into account what a test is for or if the application of it is done in the right context. I don't even see how this is disputable.\n\nAlso, I do disagree that personality is subjective. Because it's absolutely not. There is decades of research on personality (even in hiring context) that establishes what personality is, what components it consists of (Big Five traits) and how to measure it reliably. We can measure it, objectively. We can tell it generally stays pretty dang consistent across peoples' lives (as is the case for other trait-like individual differences). We can use proper tests to predict real world outcomes. Personality, next to intelligence, is one of the most well researched topics in psychology. At this stage it's hardly possible to dispute the Big Five model, let alone say that personality is subjective. And remember, this model was conceptualized in the 80s, so it's been under scrutinization and held up.\n\nI'm sorry to say, but a lot of what you're saying is just simply not true and there's a lot of research that can tell you exactly why (to start, see the papers in the top comment). I don't know why you seemingly don't want to see \nthat MBTI is just not a good test and that there are great alternatives for it, but please keep in mind that there's a risk to basing potentially life changing decisions on assessments that are highly questionable.\n\nEdit: Just to add to the English lit example. What you say in a previous comment that I only now read correctly: \"an English lit test is not reliable and invalid for measuring a person's ability to bake well\". I don't think you understand what reliability and validity mean... In the context you provided, saying that an English lit test is not reliable and invalid for measuring whatever relationship you're trying to assess is just random words strung together. I'd say you can only really sensibly say a measure has construct validity or predicitve/criterion related validity when referring to its relationship with a dependant variable.", "timestamp": "2022-11-25T17:25:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixr7z1d", "text": "I don't deny that there may be better alternatives for the MBTI, but I think that it's better to use a test you know how to use then one you're not that familiar with.  \n\nThe only time I use MBTI in the work place is when I've had to put together a team of people that have already been hired by the company, but now need to be able to work a specific way for a long period of time.  As you well noted, people are fluid and they can go in and out of certain moods and traits. People can \"fake\" (for lack of a better word) a preference for shorter periods of time, but an Introverted person for example, can't remain in an extroverted mode for 10 hours a day, 12 days in a row.   They can do it for maybe the first couple of days, but then they start to become more and more exhausted and eventually struggle to keep up the appearance.  It's really not a test that works for 99% of recruitment needs though.  There's just too much that goes into the hiring process for the test to be of any real help in most cases.", "timestamp": "2022-11-25T18:13:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixsgnwa", "text": "The edit didn't leave out anything important. You are using it in a way it's not meant to be used because MBTI is about preference and not about whether a person would be a better hire.  Since you had a difficult time understanding that I simplified it by using the English lit/baking example instead.", "timestamp": "2022-11-25T23:52:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix9ebjo", "text": "Quite the opposite, actually. \nhttps://www.bloomberg.com/opinion/articles/2018-01-18/personality-tests-are-failing-american-workers", "timestamp": "2022-11-21T19:24:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbmid4", "text": "Nope, total nonsense. Doesn’t matter what you answer if they like your resume. Or, if they don’t.", "timestamp": "2022-11-22T05:39:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ixbtedm", "text": "They’re garbage", "timestamp": "2022-11-22T07:00:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8962e", "text": "None at all.", "timestamp": "2022-11-21T14:44:12Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
{"id": "ix8ehkh", "text": "No. They only serve to perpetuate bias.", "timestamp": "2022-11-21T15:23:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Is there any scientific proof that personality and cognitive tests work for recruitment?", "url": "https://www.reddit.com/r/recruiting/comments/z0y2su/is_there_any_scientific_proof_that_personality/"}}
