{"id": "j9xbzaj", "text": "I don’t want you to stress but I once pushed very hard for higher compensation and got it, the upper level\nmanagement never let me know that they DID have higher expectations and wanted something that was never communicated to me at all. Not once. I was seriously confused my first six months as I was performing and such but I found out later there had been a lot of drama with their accepting my salary requirements. It has made me so nervous ever since to push too hard and I hate that just one employer could forever make me anxious about it! I wish you luck and I’m sure you will be great!", "timestamp": "2023-02-25T06:00:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xcqja", "text": "Gosh, I'm sorry you had that experience.\nThanks for sharing.\n\nI wish the best for you as well!", "timestamp": "2023-02-25T06:09:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xcxto", "text": "It’s so strange to me, why would they pay more when I asked and then not ever let me know that it “caused issues with the budget”. Like, you didn’t budget well and if you couldn’t afford my salary hire someone else lol", "timestamp": "2023-02-25T06:11:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zhcsg", "text": "Right, fuck their budget, don’t make the hire if it’s a concern.", "timestamp": "2023-02-25T18:32:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja0nchd", "text": "That’s a fucking shell game. They are only upset that you negotiated successfully because they were expecting to be able to under pay you, or at least low ball you. It’s so funny when they get stressed, like you say, if you don’t have the budget then hire someone else? Don’t blame the candidate. I’ve had these fights when hiring people (did you tell them what your previous salary was because this will get them in a tizzy every time- because if you got a jump they will be upset that the last people got you for cheap) where leadership says oh we can’t pay them that, but when I ask for the budget we have it. Their rationale is bullshit. \n\nOP take the money, do your best and don’t worry about their posturing.", "timestamp": "2023-02-25T23:24:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zh9lz", "text": "Some companies are total bitches about candidates that negotiate salary offers. It’s a terrible, immature mindset. You’re being hired to do work, not the best possible work under all circumstances with no tolerance for error simply because you got yourself closer to the top of a given market. Just ignore the recruiter and do the job you were hired to do, not the job plus something you didn’t agree to.", "timestamp": "2023-02-25T18:32:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja1x3cr", "text": "I mean if it’s well above competitive market wage, like ex: associate software engineers usually start in the $90k-$110k range, and you negotiated for $160k and got it, you better be a goddamn genius that performs well above average", "timestamp": "2023-02-26T05:48:07Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xc8mh", "text": "My guess is the client may be driving this.  Saying that this candidate is expensive we have higher expectations?\n\nIf the overall exp has been good then that's my hunch", "timestamp": "2023-02-25T06:03:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zh31f", "text": "100% the client driving this. I actually think this is good work from the recruiter, they are giving you a heads up. However I do think he should’ve said this over the phone or in person rather than via email", "timestamp": "2023-02-25T18:31:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zz4eg", "text": "Yup phone all the way.", "timestamp": "2023-02-25T20:31:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xjtsu", "text": "Yeah I also think this may be the case. I work in internal HR, spent only a few months in an agency but clients had a lot of strange requests.", "timestamp": "2023-02-25T07:32:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xapft", "text": "Recruiter: don’t fuck it up", "timestamp": "2023-02-25T05:47:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja0yc89", "text": "... or else the recruiter might look bad with their client, the company.", "timestamp": "2023-02-26T00:48:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "jb4m9jo", "text": "Why would the recruiter look bad?  A recruiter didn’t make the hire.   The clients makes the hire after a rigorous interview process especially for an engineer", "timestamp": "2023-03-06T11:56:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xbizk", "text": "That's quite terse, but probably accurate.  Though I would not say it's conducive to a successful outcome.", "timestamp": "2023-02-25T05:55:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zs7aq", "text": "If this is feedback recruiter got from employer than this is just setting expectations with you which is nothing but a good thing. If this is him being a prick cause he wants you to just not fuck it up, screw him. I'd suss that out before you give any grief or let this affect any communication from you.", "timestamp": "2023-02-25T19:44:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja0bu4s", "text": "Having a clear view of their expectations is never a bad thing. It’s up to you to either step up  to the challenge or fail.", "timestamp": "2023-02-25T22:00:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xppqh", "text": "I’ve been a recruiter for 17 years. The comments all seem to be ripping the recruiter for seding this email but I think it’s a little unfair. From what I can tell from the email this is a contract position. Right or wrong it is very common for my clients to quickly dismiss contract employees/consultants for the dumbest reasons - ESPECIALLY if they are paying a premium over other contract employees on the team. Part of being a recruiter is being an expert in your market being consultative to both candidate and client. Establishing trust and building long term relationships. Only possible if you act with integrity and truly understand the market you working in. While this email might come across as insensitive or shitting on OP for negotiating a higher rate, they are simply saying the client has high expectations and they likely more or less said to the recruiter what they emailed. A good recruiter is essentially an agent. I personally wouldn’t have said this in an email, all the comments as one example. Email is often read the wrong way. Just my 2 cents.", "timestamp": "2023-02-25T08:52:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja55lk8", "text": "I have to admit, I'm with BCP31 here, strange as this may sound. Anyone that has seen me on here or r/recruitinghell knows my stance on specific recruiter behaviors from a specific subset of recruiters, but I can read from the context here that the recruiter has gone in to bat for the candidate to get that renegotiated rate increase, so they're basically reminding OP that they've managed to squeeze the proverbial blood from the stone and that it had better be worth the effort. Generally it's for the following reasons:\n\n1. For OP's benefit, OP is (hopefully) worth the non-budgeted rate increase. The recruiter has talked the big game and waxing admirably about the benefits of OP being taken on by the organization. The client has considered the possibility and are making an investment of taking on OP at ***x + increase dollars / hour***. The recruiter's reminding OP of the effort being made on their part.\n2. The phrase \"You get what you pay for\" comes heavily into play here, because OP is being put across at a higher rate, and thus you would expect that they perform to expectations, and more than likely exceed the expectations of the client.\n3. The recruiter's reputation is at stake here, and has talked up the candidate to the client... If the candidate fails to meet the expectations detailed by the recruiter to the client, out they go, along with the recruiter's reputation for providing top-notch candidates, and their relationship with the client is in jeopardy.\n4. Lastly, of course, is the pay. The client are investing in both the recruiter's reputation and testimony for the candidate, and the candidate's ability to provide a ROI for the amount of money they're putting in for this position.\n\nLet's go with what we know, that the budget contract rate for this position is $80/hour, a modest rate for the industry in electrical engineering. The recruiter has arranged a rate increase to $86/hour. Recruiters also charge an amount on top as commission in many cases, so we'll go with this assumption rather than a flat fee, let's estimate that as 20% of that. So now, instead of an overall cost to the client of $96/hour ($80/hr + 20% commission ($16/hr)), they're now charging $103.20/hour ($86/hr + 20% commission). Now they're $7.20/hr in the red (which works out to be about $14,400 on a 40hr week, 50 weeks a year) on top of their intended budget. They probably knew there'd be a commission to take into account and hoped it would simply be the extra $16/hour in this case (\\~ $32K/year).\n\nSo here's the situation, the client, decides to go the contract route and through a recruiter... they're biting the bullet knowing they're having to shell out an extra $32K on top of what would equate to be a $80/hr contract (equivalent to $160K/year), so thus $192K out of pocket to pay the recruiter and candidate. The rate increase is negotiated, and it jumps to $103.20/hr ($86/hr for the candidate, $17.20/hr for the recruiter), which becomes $206.4K/year being \"budgeted\"... The client while not necessarily happy with the situation is willing to pay, hoping that the amount they're losing will be supplemented by the increase in revenue they hope to get in return. The recruiter, sensing this, lets OP know in no uncertain terms that they need to perform to show how much they deserve that pay increase.\n\nGranted, it's coming off as very passive aggressive, (and it shows in the email), but if you were in the recruiter's shoes you probably would sweating in the vain hope that OP lives up to the hype in the eyes of the client. The recruiter has come into bat for OP to get them this pay increase and is reminding OP of this fact and what the rate increase represents, an investment in OP and his abilities to perform.\n\nI know the phrase \"The more you make, the more I make\" comes into play many a time with regards to contract rates being discussed between a recruiter and their candidate - I've heard this phrase used ad nauseum, but this goes beyond money. The recruiter has done something that not all recruiters are able to do, successfully negotiate a pay increase. If the candidate expects to glide through and pocket more money, the recruiter is reminding them, that this is not a walk in the park, they're expected to work for the increase, show they're worth it, otherwise it's the candidate's livelihood and reputation as well as the recruiter's reputation and livelihood on the line.\n\nIs the recruiter being passive aggressive in their approach to OP? Hell yes... Is it justified? Somewhat, the recruiter is being incredibly realistic and not laying out any bullshit on the scenario they're in now. Could it have been handled a lot better? Most definitely. But that being said, I would appreciate the no-nonsense from a recruiter like this than a recruiter who wasn't upfront and honest about the situation and what they managed to do for me.", "timestamp": "2023-02-26T22:37:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "leo3er3", "text": "I thought that for Professional Engineer positions that 80-100% mark up over the hourly was industry standard. So in your example of the employee was getting $80/hr the recruiter would bill ~$160/hr??", "timestamp": "2024-07-24T06:14:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "lesq4zz", "text": "If a client’s budget was allowed for $80/hr for a position would you seriously expect them to pay double that to an agency/recruiter in order to pay the same for an engineer and themselves…?\n\nThat’s going to bleed a company dry and then some… No client would agree to that…", "timestamp": "2024-07-25T00:37:24Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "let57lv", "text": "I have a buddy that recruits and that’s what he told me. It didn’t sound too crazy because the hourly for an engineer from a consulting firm is typically some where between $120-160. \n\n The hourly for Millwrights in my region is between $90-$130. An electrician that is running pipe charges $80 to $120. So that pay range didn’t sound that crazy.", "timestamp": "2024-07-25T02:14:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "leo2ryr", "text": "I agree with bcp31. However- the recruiter should have left it as an invitation to discuss specifically the deliverables the client company would be expecting so everyone gets on the same page. \n\n I can validate a few thoughts that have been mentioned. Companies usually have high expectations for contractors. This can create difficult situations especially in environments where it may take months just to get to know the complicated systems specific to a company. Well said company may not provide the same grace period to a contractor as a full timer. \n\n Yes - contractors are the first to be let go when the ebb and flow of workload swings in the wrong direction. \n\nFinally - from my experience - companies are horrible at providing contractors actionable feedback and criticism.  Ad feedback will come out of left field and it’s usually accompanied by that’s why we decided to end your contract. I literally have set up quick-connects with my manager as a contractor and received nothing but “you’re doing great” for 8 months until one day I wasnt. \n\n The best insight I can add to this is that as a recruiter you should really hammer home the expectations that come with contract roles. Often employees are sold on contract positions as a trial period to full time employment. Then that employer has the wrong mindset.", "timestamp": "2024-07-24T06:07:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xf3be", "text": "I read it as trying to be helpful and congratulatory, seems like they want to keep you informed as to expectations and even want to help after they are done filling the spot. But I may be to trusting of what people say instead of what they mean?", "timestamp": "2023-02-25T06:35:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xfn9o", "text": "Yea I do agree that the recruiter's intentions were probably genuine.  But everyone interprets messages differently.  Maybe I interpreted things wrong as well.\n\nI think I will call up the recruiter and address it next week.", "timestamp": "2023-02-25T06:41:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xq3zq", "text": "As someone with 20 years of recruiting experience, this likely has nothing to do with his commission being affected and everything to do with the business, his account manager or both making a comment to him about higher expectations. The problem is likely his lack of experience delivering this type of message and his generation preferring electronic communication when they’re uncomfortable. The message is right, the delivery is awful. I read all the comments and responded to this one because you should definitely call him, be polite, let him know you want to make it work, but ask him about the points that were bizarre like the 25 years of experience. He likely heard that from someone else and I’d want to know if it came from the business. \n\nHe gets a cut of every hour you work so it’s in his best interest for you to succeed. If he’s mid-twenties and 2 years in, he needs to get better and your call will probably help him in the long run. Best of luck in your new gig and congrats on the higher rate!", "timestamp": "2023-02-25T08:57:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zubd4", "text": "I'm a 32 year old successful agency recruiter with 7 years experience. What's wrong with sending this over email? He laid everything out perfectly, set expectations, and had a great tone.\n\nI personally appreciate when people are able to communicate over email, instead of turning everything into a meeting.", "timestamp": "2023-02-25T19:59:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zz772", "text": "This feels like something where the “real” message is between the lines so a phone call that isn’t as on the record as an email might allow some better hinting.  \n\nLike… did this mean that the hiring manager had to go above the “normal” level to approve an exception and that VP/C level is annoyed and going to be watching like the eye of Sauron for a while?  Or is this not supposed to be a warning about internal politics at all and the recruiter is doing a “kids these days making so much money!!!” rant that’s meaningless?", "timestamp": "2023-02-25T20:32:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "leo436y", "text": "It sounded like plate hiring company had something to say about OP “baking in 3 weeks vacation”. Haha. I also read most of the comments. One thing I have noticed is that often young folks are sold on contract positions as a trial period to full time. Well guess what - companies view contract roles as they should be getting immediate value with a whole lot less hand holding. As a contractor you are often seen as some independent consultant. Can you imagine bringing on an independent consultant and then they disappear for 3 weeks?\n\n I learned this lesson. Not so much in a very hard way but it took me awhile to stop thinking like an employee and have the contractor mentality.", "timestamp": "2024-07-24T06:21:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x0j5o", "text": "This is honestly just unprofessional and kinda whack. You shouldn’t be shamed for advocating for yourself, and the recruiter who wrote this should not be allowed to write additional emails like this. \n\n-Another recruiter", "timestamp": "2023-02-25T04:08:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9z3lcz", "text": "That’s not how I read the message. My guess is this position has been a tough fill and or has experienced some churn. OP pushed hard for higher pay and the client obliged because they really need his skill set  (good for you OP) but they want to see an ROI as quickly as possible. In my experience contract work is wayyy different than hiring for FTE. There’s usually a very specific product or project they want OP to work on - with a specific timeline and outcome. Personally, I’d be grateful if someone communicated those expectations for me. \n\n- ex tech recruiter", "timestamp": "2023-02-25T17:02:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x2jbz", "text": "I would never. I wouldn’t blame any candidate for balking at the opportunity. Just plain crude and aloof.\n\nEdit: coming from a corporate recruiter myself.", "timestamp": "2023-02-25T04:26:34Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x3pkj", "text": "That's the feeling I got originally.  \n\nRecruiter has been 100% pleasant until this email.  :/", "timestamp": "2023-02-25T04:37:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y57v8", "text": "Forward the email to their boss and describe your concerns and the team that you are going to be on. This is just unacceptable.", "timestamp": "2023-02-25T12:26:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yrh2u", "text": "OP, you can do this if you want, but I honestly wouldn’t. The guy thought he was trying to help you out, no need to rat him out to his boss.", "timestamp": "2023-02-25T15:40:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x26zi", "text": "Always great to hear insight from another recruiter.\n\nNow I'm trying to write a thoughtful response that isn't disrespectful to this recruiter.", "timestamp": "2023-02-25T04:23:24Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x3y7a", "text": "Honestly, I’d just keep it short and simple, like they should have done. \n\n“Thank you for reaching out and highlighting the role expectations. I look forward to starting with X company, and I feel confident in my ability to meet the team’s needs. Have a great weekend!”\n\nP.S. If this is a fixed-term (not Contract to Hire) role, This recruiter is likely salty because their spread (The amount they are being paid for commission) likely took a hit OR the bill rate (the amount the other company pays the recruiting company) was increased and their account manager got on their ass about it. But in either case, there’s a certain level of passive-aggression here that just sucks. I’m sorry your recruiter is a meanie Bo beanie OP", "timestamp": "2023-02-25T04:39:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xwga5", "text": "If this is a fixed term contract then he likely isn’t making a spread right? It’ll be a percentage fee meaning he probably gets more if you get a higher salary. Recruiter’s primary concern is him not getting through probation which would mean having to pay back the fee", "timestamp": "2023-02-25T10:29:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xovsp", "text": "This is probably a stupid question. But, can anyone give me an example of how the recruiter pay works? If not, I understand. I’m just curious. Thanks!", "timestamp": "2023-02-25T08:40:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xqff2", "text": "If it is an agency recruiter (external) we get paid a % of your base salary for perm (normally 20% to 30%) and contract we add between 18% to 35% on to your hour rate. \n\nI.e client gives us a bill rate of £130 p/hr we find the candidate and decide to pay them £96 p/he. \n\nBut if you negotiated the rate with the hiring manager this probably isn't the structure they have in place.", "timestamp": "2023-02-25T09:02:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "leo4oct", "text": "Follow up question: If it’s a bill rate of $130 does the client company know the rate you pay the employee? It could be anywhere from $65 to $100?\n\nIs the bill rate set before or after the hourly rate is agreed upon with the employee?", "timestamp": "2024-07-24T06:27:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "les65wm", "text": "The rates aren't discussed between the candidate and client, if they are both are unprofessional. The bill rate is determined before, and the pay rate is determined by the recruiter, how easy the job is to fill, how good you are/ how much they can talk you down. Sometimes there's flex in the bill rate for the right candidate.", "timestamp": "2024-07-24T22:33:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "let5vuy", "text": "I think you are assuming a whole lot. Which is par for the course with this being the internet and then Reddit on top of that. \n\n The whole “it being unprofessional for a candidate and company to discuss pay rate is being unprofessional” is assuming the everyone is operating within the same set of rules that you do.", "timestamp": "2024-07-25T02:19:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "leu4ieh", "text": "I guess it depends on industry, but you can also tell your client not to.... Poor candidate and client control if it happens", "timestamp": "2024-07-25T07:15:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "leuwba3", "text": "To clarify - you are agreeing on a bill rate with the company first? Then you are looking for employees to fill the role and negotiating as low of a rate possible with them?", "timestamp": "2024-07-25T11:58:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x6d1i", "text": "I appreciate this insight, so much of the billing structure/commission payment is unknown to me and this helps me understand it better.", "timestamp": "2023-02-25T05:02:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x8akm", "text": "I probs signed an NDA when I was an agency recruiter but now I’m in house and IDGAF", "timestamp": "2023-02-25T05:21:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ycdm0", "text": "Nothing you said violates an NDA. Lol wtf", "timestamp": "2023-02-25T13:41:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x8s7k", "text": "I appreciate your transparency!", "timestamp": "2023-02-25T05:26:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ywlu0", "text": "sometimes silence is a great response", "timestamp": "2023-02-25T16:16:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ye342", "text": "Dont bother responding. This email is unprofessional as fuck.", "timestamp": "2023-02-25T13:56:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xkofs", "text": "Without knowing full context this recruiter has done the hard thing which is the right thing and was honest. Anyone who says otherwise would prefer to be positive and have rose tinted glasses.", "timestamp": "2023-02-25T07:43:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xkqiw", "text": "The recruiter  didn’t have to say all that. They did to be transparent.", "timestamp": "2023-02-25T07:44:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ylrql", "text": "I read this email as trying to be helpful. I seem to be in the minority though.", "timestamp": "2023-02-25T14:59:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xv33q", "text": "Not for an extra $6/hour. That $6 ate into their commission so they want to make sure the client stays in their role long enough for them to collect as much as possible…\n\nThis is salt with an added touch of self righteousness and preservation", "timestamp": "2023-02-25T10:09:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ygt2a", "text": "Not how it works. This recruiter is probably making MORE with this guys additional 6 bucks an hour. Most likely the hiring manager said “This guy is already at the top of our budget, and we are giving him more on top of that so he better be worth it.” The recruiter is communicating here that expectations are high.", "timestamp": "2023-02-25T14:19:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xwc90", "text": "To be honest I don’t know how contact recruitment work so I can’t really comment", "timestamp": "2023-02-25T10:27:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xlnka", "text": "Honestly for $6 😁", "timestamp": "2023-02-25T07:56:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yh1de", "text": "It’s passhole agresshole. I read a ton of mixed messages but the bottomline \nIs that they don’t show any support.", "timestamp": "2023-02-25T14:21:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9wvek2", "text": "Recruiter strikes me as some 22-23 year old kid who thinks he knows the whole world. This is the cringey sort of thing I would have said my first like 6 months of recruiting when I thought I was hot shit. \n\nIf hes a 3rd party recruiter he has no clue what hes talking about. Brush it off.", "timestamp": "2023-02-25T03:23:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x14x0", "text": "Thanks for your insight. \nI would estimate this person to be in their mid 20s based on graduate date.  So several years younger than me.\n\n\nI never received a message like this and I thought it was a tad bit odd.", "timestamp": "2023-02-25T04:13:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xbksb", "text": "I had a technical engineering recruiter a decade younger (I'm 33yo now) than me end up calling me back after it was deemed I was overqualified for her role...she ended up asking if I could answer some chemical and petroleum engineering questions about the previous job posting because she didn't quite understand what she was recruiting for. Wtf? \n\nI obliged her but damn it was a surreal phone call lol.", "timestamp": "2023-02-25T05:56:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xc43e", "text": "Well, even though you had a negative experience, im glad you took the time to teach her and made her experience positive.\n\nI'm giving you \"imaginary bonus points from a stranger\".", "timestamp": "2023-02-25T06:02:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ybbh0", "text": "It was the company she was working for requirements that made you a no. She was just the messenger. \nBe flattered she reached out to you to understand the industry more.  I see people complain here that the recruiter knows nothing about the role they are working on. At least this recruiter was trying to better herself.", "timestamp": "2023-02-25T13:31:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "leo56e8", "text": "Why was it surreal?", "timestamp": "2024-07-24T06:32:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xathb", "text": "&lt;1 year in recruitment in early 20s myself, that dude is a jackass. Regardless of how experienced the candidate is, this is just a douchey email, forget it exists", "timestamp": "2023-02-25T05:48:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x97ev", "text": "I’d say he knows exactly what he’s talking about and is being a major doucher because OP ate into his commission. Well done, OP.", "timestamp": "2023-02-25T05:31:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yh3n2", "text": "Not how it works in agency recruiting. The more money the candidate makes, the higher the commission. \n\nMost likely the recruiter was warned “ok well pay him what he asked but he better be worth it.” So the recruiter is trying to (in not the best way) communicate the high expectations.", "timestamp": "2023-02-25T14:22:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zba38", "text": "That’s exactly how it works in agency recruitment. I’m an agency recruiter and spent the first year or so in contracts. The higher hourly rate likely closed the gap in the bill rate", "timestamp": "2023-02-25T17:53:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja07fmi", "text": "I’ve done almost two decades in agencies, including negotiating these contracts, and the industry standard is to charge a markup over pay rates, otherwise agencies would lose money left and right. Otherwise how would you account for overtime, or pay increases, or variable pay rates between roles? The way agency contracts work is agency and employer agree on a markup. Let’s say $25% for easy math. For every dollar the agency employee earns, the agency bills the employer $1.25 - that way people can be hired in at different pay rates, work more or less hours, get pay increases, work overtime, etc, and billing remains the same, 25% over what the employee earns.", "timestamp": "2023-02-25T21:29:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x6yib", "text": "I agree this email could have been worded in a different tone. I have never worked with contract recruiters, but on full time placement jobs, I have heard the recruiter catches flak if the candidate does not work out. It sounds like the recruiter is making the candidate aware that “hitting the ground running” will be highly expected. The teach/learn on the job is out with a higher salary/experienced candidate. I’ve seen “staff” candidates hired for “senior” positions and the lack of experience lead to the candidate dropping 1 month in.", "timestamp": "2023-02-25T05:08:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x8oci", "text": "I am a tad bit worried that the salary is quite high compared to the requirement of only 4+ years of relevant experience.  But at the same time, I can't believe the team would hire me, with 5 years of experience, and expect the performance of someone with 25 years of experience.", "timestamp": "2023-02-25T05:25:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xcvol", "text": "I’m totally on the side of the candidate, I’ve been there. My only point is that is the recruiter gets paid on the placement, if that candidate doesn’t work out because of a lack of knowledge, the recruiter now has to find a replacement or forfeit the fee. Seems like CYA on the recruiters part, but if you have read the job description and have those skills, get as much cash as possible and knock it out. All the best", "timestamp": "2023-02-25T06:10:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yr9r9", "text": "if you find a shortcut and skip a few levels on a video game do you complain that multiple levels ahead is also multiple levels harder? this email is fully reasonable", "timestamp": "2023-02-25T15:39:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9z16jw", "text": "I'm not sure the expectation of a 6 x increase in experience (from 4 years to 25 years) is appropriate for a 7.5% increase in comp (from 80K to 86K).  That's a lot of experience for not much more money.", "timestamp": "2023-02-25T16:46:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja09b6s", "text": "Except life isn’t a video game and taking a job elsewhere in your field for more pay isn’t like skipping levels.\n\nIt’s like getting more gold per level with the same difficulty.", "timestamp": "2023-02-25T21:42:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ynl4r", "text": "Can you tell us the salary? I just landed a 300k job ( CS ) and I was worried at first, but then I see some cops and plumber are making 200k now, so the money isn’t what it use to be", "timestamp": "2023-02-25T15:13:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x9kja", "text": "Don’t overthink OP. I mentioned in another comment, the recruiter likely lost a bit of commission and is being passive aggressive towards you. \n\nWhen a company uses a third-party/agency recruiter for contract roles, there are two rates and the candidate only knows about one. Hourly rate is what you get and bill rate is the total amount the client pays the agency to employ you as a W2 employee. So it’s likely the bill rate was $120/$130 an hour and roughly 30-40% of the bill rate (which is fixed and can’t be changed) is for payroll, health insurance, and 401k matching and the leftover is the commission so he’s likely miffed that you got more hourly", "timestamp": "2023-02-25T05:35:07Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xa82z", "text": "That's some good information there.  Thank you!\n\nThough the recruiter would have received no commission if they had not raised my pay rate and I just declined the offer.  I had a competing offer, so they really have no reason to be upset.", "timestamp": "2023-02-25T05:41:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xbcil", "text": "Fair enough. The email you received screams what I like to call, British manipulation. Agency Recruiting as a whole is a fairly British industry. \n\nSource: agency recruiter", "timestamp": "2023-02-25T05:53:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xoubc", "text": "Three week vacay at the start? You in the defense industry by chance? \n\nI am a relatively junior person in a senior role, making principal-level pay. You will only get what they’re willing to pay and what you’re willing to push for. Do not compromise on pushing your hardest and feel glad you’ve been able to do so. \n\nYou may have to take a pay cut in the future. No problem, but don’t forget some are working terrible jobs for low pay. Don’t squander the privilege and do your best. Good luck", "timestamp": "2023-02-25T08:40:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yan84", "text": "That is the type of conversation best done over a phone call, not e-mail.", "timestamp": "2023-02-25T13:24:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y9ke0", "text": "This was good looking out by the recruiter. I'm in a similar situation where I was asking a *slightly* higher base than they usually pay, they made me the offer, but didn't tell me they set my quota 25% higher than usual to make up for it. So despite out producing 80% of my team, I'm technically at a lower percentage of goal than the people I'm running circles around. So for a 12% higher pay ask, I'm expected to produce 25% more in revenue. I just found all this out because my new boss  made me an offer of the lower quota and lower base because I \"had the highest salary on the team\" (the guy that hired me got fired after 3 mos)\n\nLuckily, I've got offers from other companies coming in at 40-60% higher base than I'm at now, so I'm not even giving notice. Just going to bounce.", "timestamp": "2023-02-25T13:14:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yxl59", "text": "Yea good riddance. That just sounds like a shit company.", "timestamp": "2023-02-25T16:22:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xh62c", "text": "Lol that account manager/recruiter put their neck neck on the line to get your pay rate approved. If you are a dud or cause more problems than you solve, you’re going to make them look bad/lose credibility. \n\nIn staffing, they did you a favor and the expectation is set high. You gotta show that you’re worth the higher rate", "timestamp": "2023-02-25T06:59:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xhe2q", "text": "If this was the case, I wish they would make this clear instead of sending this message.\n\nRecruiters always just go away and come back with a revised offer or rejection.  So I appreciate you giving this context to me so I can understand the recruiter better.", "timestamp": "2023-02-25T07:02:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xhk74", "text": "You wouldnt have negotiated it the agency told you that the original offer was their best and final? You had no other competing offers that were higher?", "timestamp": "2023-02-25T07:04:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xhyou", "text": "I wouldn't have tried to negotiate if they told me their original offer was their best and final offer.  \n\nI did have a competing offer that was better, at least compensation wise.", "timestamp": "2023-02-25T07:09:10Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xj0s9", "text": "Would you have accepted their offer over the competing offer tho? I’m not trying to say that you’re not worth your rate or you were wrong for asking for more. It just puts the agency in a tough position. \n\nThey might even be a little pissed off because they’re not making a margin or even  losing money every hour you bill. \n\nFrom their perspective, you agreed to a rate at the start of the process, they send your resume to the hiring manager, the HM loves you and wants to bring you on, the agency says “hey you’ve got the job, here’s the paperwork with the rate you agreed to”. \n\nIt puts them in a crappy position when you say “i have another offer for a higher rate” at the last possible moment. At that point, their options are:  \n* tell you to eat dirt. your offer is for what you already agreed to. You decline, they break the bad news to the HM and they start recruiting for another person like you  \n* tell the HM that you’re declining for a reason that is between the agency and you, not you and the end client. They lose business and jeopardize future business with the HM\n* they convince their managers to let them do a crap deal with the promise that you kick ass and this HM is a big buyer they’ve been trying to get in with. Short term loss for long term gain\n\nEdit: It’s not your fault. Just kinda nature of the game. This email is inappropriate to send to a candidate, but I understand  where it comes from", "timestamp": "2023-02-25T07:22:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xjyj5", "text": "I would have accepted the other offer if nothing changed.\nAnd yes I will admit, I scheduled interviews to obtain competing offers on the same time frame.  ( Very hard to do and Im using everything I can as leverage for myself)\n\nI understand that there was an agreed upon rate up front, but I believe it is subject to negotiation, especialy when u learn of new information, like a competing offer.  They could just as easily reject me.\n\n\nI do understand that coming in with leverage forces the agency into a corner sometimes.  Though I have to fight for my own interests and I will assume that the agency can make a decision in its own best interest as well.  \n\nIf they are feeling bad about the new revised offer, then they shouldn't have extended it.", "timestamp": "2023-02-25T07:34:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xqk7o", "text": "You’re right about all of that. That’s why the agency did it. This is just a great example of why staffing a difficult professional service. You can invest your energy and time towards filling a job  only to receive nothing in return for your service. No one likes working for free. \n\nEdit: regarding them not extending the offer they didn’t feel good about: it’s not a good look to go to a HM and say “OP rejected because we couldn’t come to an agreement on rate”. Negotiating rate is the blocking and tackling of staffing. No one supports a football team that can’t block and tackle. The only thing they shouldn’t have done is send this email. They shouldve taken you out for coffee in 4-6 weeks to see how things were going instead\n\nEdit #2: I wanna be clear, you didnt do anything wrong and your reasons for negotiating are valid. You’re a savvy professional. That probably why the client wants you and they were willing to do a deal with a lower margin than they typically would. Its immature for them to show their cards like they did with this email. You’re someone they should be supporting and partnering with. They need you on their team to grow that account. \n\nThis email sounds like it was written by a butt hurt and painfully self unaware account manager then forwarded to your recruiter with the directive to send to you. It’s really bad", "timestamp": "2023-02-25T09:04:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xg7oq", "text": "I agree with this recruiter 100%. If you are negotiating a higher pay you should understand that comes with increased expectations for your performance. For context I’m an in house recruiter with around 5 years of experience. If you are experienced and know you can deliver increased expectations with increased compensation shouldn’t worry someone though. But every hiring manager has a range they are able to pay for every role and a budget. The higher you get in that range the longer it’s gonna be until you get a promotion. They also will compare a new hires compensation  with their current team. Usually new hires end up having a higher compensation than existing employees due to market rates being higher. And if you are a new hire and one of the highest paid members of a team your manager will expect more.", "timestamp": "2023-02-25T06:48:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xgw89", "text": "Yes I would agree too.\nJust not 20+ years worth of experience for 6$/hr.", "timestamp": "2023-02-25T06:56:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zl6dq", "text": "So my interpretation of it is that they may already have felt like they were stretching their budget with 80$/h because you were a good candidate and wanted to make sure to come up with a good offer. If it’s the case, the math isn’t 6$/extra = 25 years. It’s more that 86$/h is 25 years experience. Which isn’t too crazy to think considering it’s nearly 180k a year..", "timestamp": "2023-02-25T18:57:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zunce", "text": "For an electrical engineer that isn't 25+years experience compensation, especially depending on where the OP lives.", "timestamp": "2023-02-25T20:01:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xk3vw", "text": "If that’s the case, the company has a shitty budget policy. It’s a decent amount of money in the month total, but not 20 years worth amount of money, I’d say 5 tops in specialized tech jobs (and if the demand is high, it’s even less, like 2–3 years).", "timestamp": "2023-02-25T07:36:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja02k2f", "text": "are recruiters really that braindead that they think the hiree doesnt know this?? i mean lolll thanks for the protip.", "timestamp": "2023-02-25T20:55:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x4e07", "text": "Not sure why the hate comments. Trust the recruiting when they are giving you truthful insights. The hiring manager and team obviously liked you as a candidate but stretched their budget to offer you. The recruiter is trying to ensure a) you’re successful (perhaps they get a payout if you last X months?) and b) wants to ensure client is happy with their candidates. It’s about business.", "timestamp": "2023-02-25T04:43:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x5ut7", "text": "Thanks for the opposing view point.\nI think its a fair point.\n\nThough I'm not 100% keen on how these contracts work, but I assume the hiring tem has a set bill rate per hour they would charge my consulting firm for my work.  \n\nSo if I negotiated more pay with my consulting firm, I assume the hiring team would not know that. My understanding is that it's just my consulting firm taking a hit on margin if they agree to my increased wage.\n\nMy point is, I don't think the hiring team stretched their budget for me.\n\nI had not thought about a payout after x months though. If that's true, it would explain the motivation behind this email.l though.", "timestamp": "2023-02-25T04:57:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yivdk", "text": "With agency contracts pay is a markup. So they will bill (random number) 50% over the negotiated pay rate. The more money the candidate makes, the more money the agency makes.\n\n50% of $80/hr = $120 an hour the agency bills for you. They make $40 for every hour you work during that contract.\n\n50% of $86/hr = $129 \n\nLet’s say the contract is 90days or breaks down to about 520 hours - that extra $9 they get will equal about $4,600 extra in their pocket from the contract. No reason to be salty making a few extra thousand off of you. They’re being honest with you, despite the poor delivery.\n\nThe account manager negotiates pay with the client. Did the account manager say yes to your pay request right away, or get back to you about it? If they got back to you it’s because they contacted their client, got approval for the increased pay, and likely was told “we were already paying this guy over market, so he better be worth it.”\n\nA lot of posters are on here giving terrible advice because they have a bias against recruiters and obviously don’t know how it works. Be cautious taking any advice here telling you to do things like contact the employer directly, forward the email to the employer, dismiss the recruiter for being jealous or salty (trust me, they’re making more money on you, not less) and I think you should take this recruiters poorly delivered advice very seriously- be ready to hit the ground running.", "timestamp": "2023-02-25T14:36:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x5nn5", "text": "It’s not hate, it’s vicarious introspection. We’re just trying to give this candidate (OP) some candid feedback.", "timestamp": "2023-02-25T04:55:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xbqa2", "text": "It’s not hate; he’s trying to set you up for success— I’m sure he busted his ass to get you the pay you kept pushing for, which was out of the clients pay range.", "timestamp": "2023-02-25T05:58:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xclg7", "text": "I’m astonished at the lack of hiring professionals who are taking this guys side. \n\n* Reference the candidates other post 5 days ago, regarding him FORGING his current paystubs to reflect he’s being pay more by his current company to submit.", "timestamp": "2023-02-25T06:07:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xd4in", "text": "Why does that even matter anyway? personally I have walled away from jobs that demanded proof of what I was making\n\nBecause You are walking exactly into OPs situation where the hiring end or Recruiter feel they are giving you more than you are worth. If they need to see what you make currently to know what you are worth despite them knowing what exactly they want you to do RUN", "timestamp": "2023-02-25T06:13:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xdc73", "text": "Please don't accuse me of forging documents.\nHonestly, my post last week scared me away from doing that and I never stated that I participated in forging documents.\n\n  So this post here contains a genuine negotiation where I  don't even share any documents as leverage.\n\nIt's up to you to believe me or not.", "timestamp": "2023-02-25T06:16:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xfeum", "text": "It’s also up to me to share your shady &amp; unethical post ASKING ADVICE ABOUT forging a document for financial gain. \n\nDon’t try to gaslight me.", "timestamp": "2023-02-25T06:39:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xhbal", "text": "You're gaslighting OP wdym, bro", "timestamp": "2023-02-25T07:01:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xgqbe", "text": "Go ahead and share I'm not trying to hide anything.\n\nMy post last week was stupid, and that post came after being disgruntled with the whole candidate vs recruiter issue we have going on in the market.\n\nAnd yes I asked for advice and the advice was it's potentially illegal and very unethical.  \n\nSo armed with that knowledge, I learned and steered clear.\n\nSo if you are just trying to point out fault in my posts, I'll join you because I agree that last post was dumb.", "timestamp": "2023-02-25T06:54:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x0daz", "text": "How long has this recruiter been a recruiter??? \n\nThis wouldn't go well with my candidates lol.just do you.\nDon't put all this extra pressure on yourself. I'm sure this is all coming from this recruiter and they think this message was helpful. \n\nThis is so cringe. I'm sorry congrats on your job!", "timestamp": "2023-02-25T04:06:56Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x1uxj", "text": "Thank you!\nAccording to their linked in, less than 2 years.  And based on graduate date, this person is mid 20s.  So I would understand if it's just a bit of inexperience.\n\nGreat to hear from others perspectives!", "timestamp": "2023-02-25T04:20:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x6zlf", "text": "So he’s still green and clearly needs more corporate buttoning-up.", "timestamp": "2023-02-25T05:08:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x99rf", "text": "Did you close the loop on him and negotiate your own rate?", "timestamp": "2023-02-25T05:31:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x9p44", "text": "What do you mean by this?\nBoth the recruiter and the account manager were involved in the negotiation, so as far as I know both were in the loop.\n\nBut I'm probably not understanding your question.", "timestamp": "2023-02-25T05:36:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xa5n8", "text": "I was wondering if he was being salty about the negotiation process. Sometimes Candidates don’t want the Recruiter in the money part. If that’s not the case, man, what a garbage email to send someone over $6/hr. He’s young and dumb.", "timestamp": "2023-02-25T05:41:12Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xb4i1", "text": "Well to be honest, he took 1 day off and was not available.  That is the exact day I decided to negotiate with his account manager.  So the recruiter came back to an increased offer that his managers approved while he was gone.  :/\n\nI didn't mean anything malicious by doing this, just the timing was off because I was trying to make a decision between two offers.", "timestamp": "2023-02-25T05:51:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xbowm", "text": "I’ve worked in upper level engineering most of my career and owned an agency hiring those types of candidates for about 5 years. What he sent was super salty. It’s not the worst thing I’ve seen but it’s super unprofessional and nonsensical given the circumstances. He’s overstepping his bounds and a word with his account manager or above is acceptable here.", "timestamp": "2023-02-25T05:57:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9wym3d", "text": "That was painful to read. \n\nIf a candidate negotiates a higher rate I congratulate them. \n\nI'm also the one that has to go bat for them with the CEO, so I generally have a pretty good idea if is going to fly.  When it doesn't fly, I just tell them I tried my best but it's not in the budget to go over scale. And I do talk with the CEO, but don't push it if there's nothing compelling. \n\nOutstanding candidates can generally negotiate higher rates of they have unique skills.\n\nEither way, the job expectations are the same and a pre-negotiated vacation has ZERO bearing on job duties or expectations. \n\nThis Recruiter is apparently dipping into his own supply of \"overblown hubris\".", "timestamp": "2023-02-25T03:51:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x1i1p", "text": "Hahaha it is quite cringey if I read it in the light.\n\nI originally thought he had an issue with me negotiating.  Like maybe he gets less commission as a result.  But I have no idea how consulting agencies get paid", "timestamp": "2023-02-25T04:17:04Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xje2g", "text": "I disagree. It depends on the type of company but I’ve often heard phrases like “he’s not performing well enough compared to what we pay him / how expensive he is” when a company laid off people or chose not to prolong a contract. The higher the rate, the better results expected.\n\nJust two day ago I’ve learned the news that a senior colleague was let go and a junior one will stay – because “her attitude and results are not worth the extra money she is paid compared to the junior one“. (Vacation is usually not an issue, it might only slow down some results and companies can work with that.)\n\nIt really depends on the company and on their budget policy, performance policy and your boss.\n\nThat being said, that email definitely has a wrong tone and tons of clumsy phrases. Maybe it’s the case in the company and it’s a fair warning, but a phone call would have definitely been better in this case.", "timestamp": "2023-02-25T07:27:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xpjga", "text": "Ya want the pay, show them you worth it. Don't be all talk and no bite.", "timestamp": "2023-02-25T08:49:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xw7o9", "text": "Initially I saw this email as being extremely inappropriate and that the recruiter was over stepping their bounds, but the more I think about it, the recruiter probably was triggered to send this email based on a lot of scrutiny surrounding your offer compensation—leaders often pushback on compensation if it doesn’t align to the average of what other people with similar experience are normally paid within the team. I still don’t think they should have sent the email and it’s definitely not their place to say what the expectations are for you coming into that company, but I do think it gives you some insight into the trouble that the hiring manager and recruiter had to go through to get your offer approved… So yes,  regardless of how inappropriate it was for the recruiter to send that email, I think there is merit to what they are saying here and you’re going to have very high expectations placed on you from the get go.", "timestamp": "2023-02-25T10:25:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yht0n", "text": "People have high expectations for the more expensive product. \n\nThey expect the Porsche to be faster and more exciting than a Camry, for example. And that's what you are now to them.", "timestamp": "2023-02-25T14:27:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yhyqj", "text": "It seems like the recruiter is just communicating honestly to his candidate. Very surprised to see all the hate and people getting so emotional. The reality of the situation is recruiters are privy to backend conversations, we hear things like this. Good information for the candidate, now move forward and do a great job in the new position and leverage it for more pay and experience later down the line.", "timestamp": "2023-02-25T14:29:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ylbkp", "text": "So, it appears from this email, that because they are giving you more than they expected to pay that they have expectations of you hitting the ground running quicker than they normally would. Given that they are the folks who are paying you, this is not an unreasonable expectation and probably good that they put this on the table. At the end of the day, they are paying you what they think you are worth and what you actually asked for. So, I would stop worrying about whether this is weird message, or veiled threat or whatever it is you're suggesting it is.  I'd just do my job and let my performance and the results of my performance do the talking for me and stop worrying about the rest.", "timestamp": "2023-02-25T14:55:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "ja0t2pb", "text": "This is why I hate delivering difficult messages via email/text. You can’t control the tone the reader will interpret the message. It can be positive one day and negative the next the more one thinks about it. \n\nThese conversations should be had over the phone where you make sure everyone is on the same page.\n\nSounds like they are happy you got the offer and things worked out. But on backend there was a lot of negotiations that needed to be done to get you that offer. Agency had to convince hiring manager you were worth the extra X amount you were asking for. With that the hiring manager may have to get additional signatures from VPs etc putting their necks on the line getting these budgets approved. And for whatever reason things don’t work out it’s going to put a bad look on them.", "timestamp": "2023-02-26T00:07:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x95of", "text": "This is absolutely bananas. I'm trying to figure out why this was sent? Is the recruiter doing this of their own accord? Or did someone tell them to send this?\n\nEither way this is nuts.", "timestamp": "2023-02-25T05:30:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x9rtl", "text": "EEs with 25 years plus experience are going to be worth a lot more than this uninformed dipshit is trying to lie to you about.", "timestamp": "2023-02-25T05:37:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xedx4", "text": "This is because the recruiter is worried you'll either drop out of the role before your rebate period is up and he'll have to pay back his commission. Or as you said contract, if that 86 an hour is a contract role, the company is actually paying 100 an hour, your getting 86 and the recruiter is getting 14 which again could be lost.\n\nIt's a shady email to send.", "timestamp": "2023-02-25T06:27:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xi7vb", "text": " \n🚩🚩🚩", "timestamp": "2023-02-25T07:12:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9zy5mj", "text": "They're probably acting like this because their \"cut\" of being a recruiter is dependent on you being with the company for x amount of months before they get paid out.", "timestamp": "2023-02-25T20:25:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xdmvg", "text": "That may just be some of the most passive-aggressive BS I’ve ever witnessed on this thread. Wow. Boggles the mind why a recruiter would act in such a way over just $6/hr… \n\nAs you stated, all this because you were soooo fortunate to jump ahead 21 years in your field! Which, btw, is a shitty and totally unprofessional way to admit that the company absolutely doesn’t value many years of experience in their employees (“Bob, we want to thank you for your loyal service to our company over these past 25 years. Here’s a $300 watch and a $6/hr raise!”). That’s what they call a warning sign my friend. \n\nAlso, WTF would they, or any company for that matter, hire someone at this rate and the expectation not be that OP was capable of hitting the ground running? It’s not like this is some entry-level role. Of course they have ‘high expectations’. I just hope OP didn’t have as high expectations of the company, because this is a red flag. That recruiter is not providing OP with support. That recruiter is giving OP a clear message that OP needs to watch their back", "timestamp": "2023-02-25T06:19:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x8erh", "text": "Why should you have a shorter ramp period for getting more fuck this guy", "timestamp": "2023-02-25T05:23:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xqbza", "text": "Seriously? Higher pay is almost always equated with more experience and a faster ramp up.", "timestamp": "2023-02-25T09:00:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y3sd8", "text": "It's less then 10 percent. We're not talking about a 25 % raise", "timestamp": "2023-02-25T12:09:56Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x9jhj", "text": "It’s like he’s trying to make you fear the job or something. I think it’s all bs and he’s just trying to talk the position up and make it seem like they did you a huge favor, and also pressure you into really doing an amazing job", "timestamp": "2023-02-25T05:34:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x9uk5", "text": "Honestly, I did feel that pressure though.  \nNot the best way to encourage your candidates IMO.", "timestamp": "2023-02-25T05:38:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xa325", "text": "I don’t think so either. But you have a degree and half a decade of experience, so I’m sure you will be completely fine. If not there are always other jobs out there. Good luck on the job and good on you for getting a good salary that works for you!", "timestamp": "2023-02-25T05:40:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xat3e", "text": "Much appreciated!\nBest of luck to you in your endeavors as well.", "timestamp": "2023-02-25T05:48:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xhsiy", "text": "Very unprofessional of them as if they're giving you some kind of weird warning. Imagine if a candidate also sent an email saying the rate is low so I'll only perform sub par. 😁\n\nAnyways rate negotiation and expectations should always be over a phonecall and then put in writing in a simple email.", "timestamp": "2023-02-25T07:07:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xk7h1", "text": "Bro it ain’t that serious. He’s not responsible for you lmao. You obviously had a strong interview performance via the team to negotiate whatever godly comp this guy claims you did. \n\nDudes weird.", "timestamp": "2023-02-25T07:37:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xcpeo", "text": "this is weird af. I think some recruiters are jealous that skilled people get paid way more than them", "timestamp": "2023-02-25T06:08:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xqmd7", "text": "You have this backward. Good recruiters make way more than the skilled people they place, particularly in agencies. I’m corporate, at a Fortune 25, and make more than almost all of our skilled individual contributors, a lot of our skilled managers and even a few of our factory managers.", "timestamp": "2023-02-25T09:05:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xeb1g", "text": "You may need to brush up on Staffing/Recruiting Salary Stats? \nOr visit The American Staffing Association..?", "timestamp": "2023-02-25T06:26:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9x9r38", "text": "Forward this email to HR saying how unproffesional it is.", "timestamp": "2023-02-25T05:37:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xkdcq", "text": "Is this a contractor company? Because typically if the recruiter convinces you to take a significantly lower salary than what the client is paying, they get a portion of the difference. Good on you for keeping hold of your own earnings.", "timestamp": "2023-02-25T07:39:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xslrz", "text": "You negotiated a pay rate for the job presented by the company/recruiter.\n\nThey don’t then get to say “well since we are paying you more, you’re job is actually 1.5x what we posted online”.\n\nThat’s not how this works.", "timestamp": "2023-02-25T09:33:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xzssx", "text": "“Recruiter-to-candidate” puke", "timestamp": "2023-02-25T11:17:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y569p", "text": "Very unprofessional. Clearly recruiter pressed hard to have them consider your offer. They have warned recruiter that the candidate ought to perform better than a “race horse” to justify their salary. Every candidate is allowed 6 months for their learning curve. It seems they want to shorten it. Which means you’ll be spending long hours just to meet expectations which could be unrealistic.\n\nThis is extremely toxic. Recruiter’s email is filled with subtle messaging. Talk to them over the phone and understand first hand what this means.\n\nIf salary expectations were difficult to align with to begin, you’re in for a bumpy ride at this company. No Job is worth your mental peace.", "timestamp": "2023-02-25T12:26:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y85sr", "text": "It makes it sound like they are deliberately setting you up to fail so they can fire you and hire someone cheaper as soon as they find them. Watch your back and work your ass off if you want to stay there!", "timestamp": "2023-02-25T12:59:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yeo2k", "text": "Life sciences recruiter here w 13+years of experience.  Your recruiter sounds a little jelly. Whether its from your higher pay rate or their decreased comish bc their gm is lower bc you negotiated so well. Nevertheless, take heed of  the companies expectations,  work the contract like the rockstar you are (w top tier negotiation skills), get Paid and convert to perm, get extended or seek your next engagement.  I'd use this as extra motivation to show up and show out.  May you enjoy every pay period.  Congrats on the new engagement!!!", "timestamp": "2023-02-25T14:01:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xlrwy", "text": "Any tips for a noob?", "timestamp": "2023-02-25T07:58:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xsb5q", "text": "The recruiter, are they an internal or staffing firm recruiter?\n\nHow many years of recruiting experience does this recruiter have?\n\nI could give you my opinion once I know these answers. Either way this should have been a conversation. Not something done over an email.", "timestamp": "2023-02-25T09:29:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xwy9a", "text": "There's an electrical engineer shortage, because most companies only hired senior electrical engineers and neglected anything less, now the few with talent are being sought after. \n\nIMHO they are paying for your skills, if they demand you work longer and faster then the bonus really isn't a bonus.\n\n\nHow did you negotiate the salary and what is the niche?", "timestamp": "2023-02-25T10:36:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xz3gv", "text": "Recruiter probably has am agreement with the company they pay them a percentage of your hourly rate. So thats 20ish percent of 86, instead of 80. It adds up, and takes you above the 100 mark, which adds a psychological layer to it. \n\nDo NOT underestimate how petty hiring manager can get a hen they feel someone gets more than - wether reasonable or not! \n\nThe client probs told the recruiter you better be fluffing performing for that 100+ salary. And recruiter is trying to prepare you for it. \n\nRecruiter want to make sure you do too, cause if you leave, they’re not getting paid. Either at all, or not as much as they hoped. \n\nRecruiters and your goals are aligned here. Just take it on board. Equally, there will be plenty of jobs for someone with your experience, so don’t stress yourself out.", "timestamp": "2023-02-25T11:07:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9xzkl5", "text": "Looks like hes had buyers remorse on your pay lol", "timestamp": "2023-02-25T11:13:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y0mlo", "text": "I dont know what to feel if i receive this kind of note lol im a recruiter myself but i wont engage my candidates especially those we hired with this drama  😅 im sure there was good intention behind this sure but whyyyyyy", "timestamp": "2023-02-25T11:28:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y22x4", "text": "The recruiter is probably getting paid after the trial period.", "timestamp": "2023-02-25T11:48:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y2txa", "text": "It’s her reputation also for finding you.\nIf you screw up, they won’t use her for additional candidates.", "timestamp": "2023-02-25T11:57:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y4fn5", "text": "If this is in manufacturing, I could offer a different possible scenario.  A lot of my manufacturing clients have people with very long tenures.  This translates into people having lower salaries than their peers in the market.  And often includes the hiring managers.  Some roles are notoriously hard to fill (software engineers, automation engineers) and they either have to “take what they can get”, or the role just stays open and unfilled, and puts a burden on the rest of the team.  Or they pay a premium (compared to the rest of their staff) which is what this company probably did.  $86/hr translates to $178,889 per year.  So you’re probably making more than most everyone in the plant. And this might chafe some people.  So she was being honest that there are high expectations you’re going to come in and ramp up quickly, and add value quickly.", "timestamp": "2023-02-25T12:17:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y8l5m", "text": "I’m going to remember this letter from the recruiter the next time I go through the drive thru at Wendy’s or McDonalds. I’ll politely remind them that since they’ve upped their prices, that I have much higher expectations paying $5.19 for a Dave’s Single or $4.49 for a Big Mac compared to when they were 4.99 or 4.19. \n\nI’ll remember this the next time I see the price at the gas station. I’ll make sure to tell them how  my expectations of better MPG and performance are now higher considering I’m paying the equivalent of what ultra premium used to cost for regular unleaded. \n\nI’ll tell the supermarket manager that these eggs better taste fucking fantastic at over $5 per dozen when they used to cost $1.89 per dozen. \n\nOr maybe - it’s just that everything (including labor) is more expensive these days and it’s just the way it is…\n\nIf they did not change you to a higher role as part of the salary negotiation, remember we are talking $6/hour here, then this is on the company and how they manage. \n\nAnd most recruiters are paid a commission on your salary (or hourly rate if contracting), so they should be pleased. Unless that negotiation involved them paying some of the commission to cover your salary request - in which case they should be upset, but not towards you.", "timestamp": "2023-02-25T13:03:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9y8o44", "text": "No different to any other job, you better be worth it. If you demand a higher salary the expectations are a lot higher. This is all very normal and the recruiter is doing the right thing.", "timestamp": "2023-02-25T13:04:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yejva", "text": "Fwd the email to his manager or colleagues, and back out of the deal. I would do this out of principle alone.", "timestamp": "2023-02-25T14:00:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yf0le", "text": "Tonally sounds like they’re  a bit salty you got paid the market rate, which goes up and down. But also for some reason feels like your performance is somehow going to be a reflection of her abilities; which is silly bc the client/management picked you. The success or failure is on you/them not the recruiter. \n\nNever apologize for pushing for more money. They will pay you what they can get away with and like most companies give you a dog shit COLA increases which then cause you to go find another job just to keep up with inflation.", "timestamp": "2023-02-25T14:04:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yf8qe", "text": "It seems fairly obvious to me that if you have an unusually high level of pay for your position, the expectations will be higher with that. No one's going to pay you that much for long if you're not performing. It's kinda weird that the recruiter would feel like they need to mention it.", "timestamp": "2023-02-25T14:06:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yf8uu", "text": "I haven’t read all the comments but I just wanted to add that if you’re working with a 3rd party agency, the client (company you’re contracting for) has no idea what you’re actually being paid. However; this recruiter has probably asked for a way higher bill rate (think finders fee) on your behalf to accommodate for your pay negotiation as well as keep their pockets lined for your hire. So really this email is saying: “I am making them pay hella money for you and i made a lot of fluffy promises to them, so my relationship with this client probably depends on your ability to do this job well, so please don’t make me look bad”\n\nAnother thing to add though, if they agreed to the negotiation— they NEED YOU. So don’t think you need to overperform or stress yourself out to “prove yourself.” Just be a good, normal employee who shows up on time and gets his work done. I used to source for EEs and coming across a really great one that’s willing to do a contract is a rarity.  You’re good.\n\nLast tip to add, since this recruiter seems so candid make sure you set the expectations for your salary expectations once you convert to full time or ask what they typically offer full time EEs for your position.", "timestamp": "2023-02-25T14:06:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yfm5t", "text": "I would have had this convo over the phone but I understand the message. He wants you aware that the team has higher expectations for you due to your comp.", "timestamp": "2023-02-25T14:09:56Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yfqld", "text": "First question, is the recruiter internal or external, if external, they may be concerned that they are risking their reputation with the company. If internal, you may have hit the top of the range, or even higher requiring further approval.\n\nRegardless, they hired you because they think you will be a good cultural fit, have the experience necessary and ability to grow. I’ve hired throughout my career, both in good economic environments and poor, and the only constant is that you pay for the person you believe will succeed in the role. Make sure expectations are clear, you have regular “get in sync” sessions which are documented and kick ass.", "timestamp": "2023-02-25T14:10:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yiesa", "text": "If the recruiter got to bill the company for your requested pay bump, he/she actually makes more money off this. Maybe the recruiter had a fixed markup and had to take it off their end… either way, from a recruiting perspective the work is already done so put the deal through… it’s tough to find niche local candidates that are local and open to the contract to hire model.", "timestamp": "2023-02-25T14:32:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yj0kj", "text": "So as someone that has recruited engineering on both contract and perm two things could be going on here. \n\n1. You ate his margin and he’s salty he’s not getting paid as much so he’s pushing you to make sure you work your butt off so he either gets a conversion fee or can ask for more money when you “hit the ground running”. \n\n2. He went to the client asked for more money which in all honesty asking for another 6 to you is like 10-12 for him to cover commission and tax etc. and he knows this client is going to be up your butt so he’s giving you a direct fair warning but offering his support as well. \n\nEither way you got the job and negotiated over 170k (per year) in hourly rate for a few years experience. Kudos to you my friend!", "timestamp": "2023-02-25T14:37:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yj6kh", "text": "Over $12,480. 7.5% of the original salary. \nThis seems simply unreasonable to me. \n\nIs this recruiter an engineer as well? Can’t be.", "timestamp": "2023-02-25T14:38:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yn5jh", "text": "She’s sooooo mad that you make way more than her", "timestamp": "2023-02-25T15:09:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yoc8b", "text": "As an agency recruiter we are paying for a candidates experience, our clients pay us a premium to fill their staffing needs, if we pay you more the client has to pay us more, so yes a higher rate means higher expectations. I do believe this should’ve been a phone call, but although other people have said “the recruiter is not your boss”, if your performance for a client doesn’t meet the needs they feel like they are paying a higher rate for then the recruiter would be the one to fire you because technically you are an employee of our staffing agency and not the end client", "timestamp": "2023-02-25T15:18:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yq1ut", "text": "Ghost the recruiter and company.", "timestamp": "2023-02-25T15:30:56Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yreje", "text": "They saw your qualifications and de used to go to the top even though these may not meet a mega top performer… it’s on them not you", "timestamp": "2023-02-25T15:40:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yuf4m", "text": "I don’t understand why this is a bad thing. I thought people wanted to be aware of the expectations their manager has from them? \n\nI’m sure the HM said that if they’re going to be paying more than they originally planned, he better be worth it. It’s not the most gracious thing in the world but I can understand it", "timestamp": "2023-02-25T16:01:07Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yv8c1", "text": "Respond in kind with just a Thank you. Short, sweet, and to the point. \n\nThan get in there and give ‘em hell OP! Best to you in your new job!", "timestamp": "2023-02-25T16:06:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9ywg9j", "text": "to me it sounds like this: the recruiter’s job is to bring the right employees in for the “right” price, and your salary is a little bit north of “right,” which, in a way, means that the recruiter has not done the recruiter’s job perfectly. So this email is there to put pressure on you because if you perform at average for above-average pay, then that could be construed as a recruitment problem. So this is probably about leaving a paper trail so that the recruiter can cover the recruiter’s own ass….", "timestamp": "2023-02-25T16:15:12Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yxj84", "text": "Fast paced project driven= ill go as slow as i want and do the minimum about of work and when people try to hurry me ill go even slower or take a break.", "timestamp": "2023-02-25T16:22:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9yzand", "text": "Sounds like the recruiter was chastised for letting you negotiate up.", "timestamp": "2023-02-25T16:34:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
{"id": "j9z3agz", "text": "Sometimes recruiters only get their commission of a candidate is in a position for months or three months or whenever. Warning you about the higher expectations is good for you, but also good for them. It’s unfortunate companies would put individual employees an awkward situations. Like how you will know that you make more than other people in your position with the same experience. That’s uncomfy. But they were also willing to take a chance on you with a higher salary, so I wouldn’t write them off right away.", "timestamp": "2023-02-25T17:00:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiter sent me this after a successful negotiation of pay.", "url": "https://www.reddit.com/r/recruiting/comments/11b9fka/recruiter_sent_me_this_after_a_successful/"}}
