{"id": "l9b921q", "text": "Retention issues usually are not a recruiter's problem if they are systemic. \n\nThat is a sign of disease in your workplace culture and management, and operating systems. You can hire all the perfect candidates, but if those other items aren't sorted, even perfect people will leave.\n\nUnfortunately, that is tough news to break to leadership. You might briefly tell them that those things are factors, then focus your presentation on the things you can directly impact from your own role, like setting proper expectations with candidates during the hiring and onboarding phases, suggestions to improve the interview process like transparent work expectations being shared with candidates early on or adding questions during the interview that dig in to the common reasons you are seeing people leave.\n\nThe fact they put it on you as a recruiter tells me that there isn't a strong HR presence to guide leadership at all, and they obviously don't understand retention or how it works. If the job market wasn't crap, I'd suggest forming your own exit strategy before you become the scapegoat.", "timestamp": "2024-06-19T14:24:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9bct34", "text": "Thank you!\nA strong HR presence has been an issue but we have a new CHRO that I’m cautiously optimistic about. I’ve a strong relationship with the team as I came from the field and have put myself through their training program to ensure I can provide as realistic of a JD and working conditions/expectations as humanly possible. \nAgreed it’s a broader issue.", "timestamp": "2024-06-19T14:46:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9bex9n", "text": "I think the first solution step to propose is gathering data on why people leave (surveys, during exit interviews, or even reach back out to everyone who has left in the past 6 months), then start by fixing what comes up in that discovery. Not everyone responds, but you have to start somewhere, and this isn't something that gets fixed overnight.\n\nI'm betting on money being the biggest factor, then work schedules, unrealistic management expectations or other issues with their +1 manager, and limited future growth opportunities beyond their current role.", "timestamp": "2024-06-19T14:58:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9b8evs", "text": "Facebook groups\n\nCommunity job boards\n\nEmail drip campaigns to database\n\nReferral program\n\nSEO optimization of your careers page", "timestamp": "2024-06-19T14:20:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9xplh1", "text": "Pay more money", "timestamp": "2024-06-23T18:20:12Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9d96p2", "text": "This is challenging because TO is not a recruiters problem. It's a management problem. I understand the assumption you made but bringing in stronger candidates only accelerates a TO issue if the root cause isn't resolved. The better the employee, the less likely they are to put up with subpar managers/companies. So while it may sound counter intuitive the solution is not to bring in stronger candidates. This will make your problems worse and will cost more money if nothing else is addressed. In these situations, I typically advise building a strong training program and having clear succession planning so that the main component of your employer value proposition is upskilling with a focus on transferable skills with easily defined value. This mirrors the McDonalds system but only works if the organization understands that it will increase the flow of employees at both ends of thw life cycle. \n\nIt would help if you could provide insight into why the TO is high. Do you have access to exit interview data? That would be a great place to start. Unless the data highlights a gap between what they were sold during recruitment and the reality of what they experienced as an employee, you might have a hard time achieving the outcome your leadership is looking for. However if this is the case then an adjustment to the employer value proposition is in order. My philosophy is never to sell a candidate on a job because you are only doing yourself a disservice. Be honest about the total rewards package and the employee experience because over promising and under delivering in this area is a waste of time and money for everyone.\n\nTo find more quality candidates, typically, you work the problem backward. Who are your best managers? What makes them the best? How did they first learn about the opportunity to work for your company? Are they an external hire or an internal promotion? What are their demographics? How did they apply? When did they apply? What rewards or incentives arracted them to your company? What has ensured their retention since hiring? You can dig much deeper if time and resources allow and review personality data, skills assessment data, development data, saftey records etc. Once you have collected all this data you should perform an analysis to look for strong commonalities that will allow you to build an ideal candidate profile. This will allow you to look for indicators of future success in candidates during the recruitment process while also simultaneously narrowing your target candidate pool which should help you increase the ROI of your recruitment efforts. It's important to note that this candidate profile includes both qualitative and quantitative assesments with as many data points and behavioral indicators as you can reliably determine. \n\nThen, you would do a benchmarking exercise or a SWOT analysis. A compensation analysis is also a critical step in this part of the process. Ensure to look at all aspects of total rewards and use things like benefits need assessments or questionnaires to understand what your team wants, what they get and how this compares to your competitors. Focus on how your company compare to its main competitors from an employee perspective absent of the reasons why. Not we pay less because. For the most part employees don't care why they only care about what benefits them. Assess your compensations benefits, culture, perks, advancement opportunities, net promoter score etc. \n\nFurther, you should review your ATS data and see how it breaks down at every stage of the funnel reviewing key metrics and data points like time to hire, candidate demographics, cost of hire, source of application etc. I would also look at trends over the last year. Where are most of your hired candidates coming from and has that changed from your pervious understanding? If so what is the mostly reason? Is the time to hire increasing or decreasing and why? Is the ratio of qualified applicant to total applicants increasing or decreasing and why? Etc.\n\nAll this data couple with the TO data and the candidate profile information, should provide a clear road map for an effective employer value proposition and framework for an effective recruitment strategy. However this is still only part of the picture and doesnt actually provide you all the data you need to set a recruitmentstrategy. What you habe so far would inform an arraction strategy and if your goal is only to increase the number of qualified applications then you can stop here. However, we all know this isn't ever the real end goal. Typically the goal is to hire better, faster, cheaper and more qualified candidates. \n\nTo do so you would need to review your current recruitment practices. What is the interview process like? How long is it? How are candidates being qualified? Are you using data to qualify them or intuition? Is that data reviewed and analyzed throughout the employee life cycle to validate your recruitment process and selection criteria? Are interviews structured or ad hoc? Who conducts the interviews? Does that person have training? Are multiple perspectives part of the hiring process? Is the process unnecessarily long or complicated given the skill level and pay of the role? How does your process compare to your competitors? How many candidate typically apply for each opening? How many do you have at the different stages of your funnel when you make an offer? How many candidates voluntarily drop out of your process? When do they drop out? Why do they drop out? Do you collect user feedback on your process from candidates? What does that information tell you?\n\nWith this information you should be able to see where changes are needed so you can develop a strategy to increase the overall effectiveness of your total recruitment process.\n\nI cannot stress enough the importance of creating a quantitative system used to analyze candidates that is then compared to actual job performance over the employees life cycle. So many companies skip this step which completely invalidates any assumptions made about the effectiveness of their recruitment strategy.\n\nAll that said...\n\nFundamentally, you are being asked to influence something that is not within the scope of your role. Given the right framing, it essential to highlight that employees quit managers, not companies, and that recruitment strategies uncoupled from retention strategies won't solve the problem your company is facing. \n\nI hope this helps! Good luck. You are fighting an uphill battle.", "timestamp": "2024-06-19T21:11:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9bcfn9", "text": "The company needs to pay people more and make it a better place to work. I just love how leadership always believes there’s a pool of “better” candidates out there that recruiters need to find. You’re hiring people. You’re doing your job.  If TO is high there’s a reason and anyone you hire will also leave if retention isn’t addressed.", "timestamp": "2024-06-19T14:44:07Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9czgm9", "text": "As a long time agency recruiter, I always source candidates who would find my clients workplace/ culture / QoL to be an upgrade to their current situation.\n\nCase in point—High-Volume QSR managers (McD, CFA, Cane’s, etc.) are adept at leading significant workflow and staff volume, while being very hands on.\n\nI have placed many QSR GMs with hotels, service businesses, and yes, large car wash franchisees. Sometimes it takes trying it once or twice to sell the process.\n\nThe candidates benefit from “getting out of the industry,” and get a better Quality of Life.\n\nMy clients get someone who is grateful for that, and is happy to work hard to show it.", "timestamp": "2024-06-19T20:16:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9i7t66", "text": "Somebody could make a killing doing this in automotive manufacturing. All of us especially those of us in the office, want to get out.", "timestamp": "2024-06-20T19:06:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9if9y7", "text": "What do you think some relevant/ applicable industries/ sectors would be you could transition to?\n\nAnd curious what’s going on in your industry that so many people are looking elsewhere?", "timestamp": "2024-06-20T19:48:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9ig7zf", "text": "Aerospace/defense would be the closest one, but it all depends on what part of automotive that you’re in. I’m in sales and have chosen to go into the industrial side which is a bit easier to demonstrate transferable skills than someone that sells parts. Semiconductor is starting to look at me more, but that’s because I sell semiconductor processing equipment as well. \n\nThe industry is just toxic and the locations arent great either. While many of the older workers stay in it because of the local/hometown/state pride and hard to learn new tricks after a certain age there are a lot of ppl like me that would get out if we had the chance. Turnover here is insane.", "timestamp": "2024-06-20T19:53:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9ihpbg", "text": "Heard.\nYeah I actually have a manufacturing client who is moving more into aerospace applications.\n\nBut you’re right, they have plants in the middle of nowhere… many of them are. You’re right about local pride but I can totally agree it’s not exactly easy to sell someone on unless they’re already there.\n\nHonestly if you’re in sales it should be possible I think. I just placed a Tech Sales Manager and all the candidates I presented for consideration were from different backgrounds. Robotics, medical devices, HVAC, etc.", "timestamp": "2024-06-20T20:01:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9iiayt", "text": "Every time I talk to tech sales hiring managers they claim that I’m not technical enough or not a good fit for some strange left field reason(I’m the top seller at my current job and even have a degree from UC Berkeley which I know is respected in the tech world). Of course, that was when I applied under my legal name. I changed the name on my resume to an English name back in March and had 4 job offers out of 5 roles interviewed for. So perhaps I should see if the issue is similar in the tech industry given my last round of trying to get in there. I even had a referral in 2 of the tech places that I interviewed with.", "timestamp": "2024-06-20T20:04:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9dhiav", "text": "You need to head hunt, not wait around on job boards. \n\nStart with a competitor analysis. Who are your biggest competitors in your space and pouch their employees.", "timestamp": "2024-06-19T22:01:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9bnxbh", "text": "High turnover is a retention problem, so need to analyze exit survey and employee satisfaction data.\n\nLook at other service organizations that offer a strong management training program (e.g. Enterprise Rent-a-Car). Look for individuals who started off working customer service/support at a B&amp;M location and who have been in their current/management role for at least a year (ideally 4).\n\nIf you're having challenges getting traction for inbound applicants or response rates to proactive messages, if there's employer branding leverage them to help with positioning the brand and benefits of the company and work there.\n\nReferral programs with a paid incentive. Obviously having a 6-12 month retention payout period will help reduce any bad hires (e.g. 50% of referral fee paid at 3 month mark, remaining paid out at 6 month mark).", "timestamp": "2024-06-19T15:49:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9bouwt", "text": "Thank you!!", "timestamp": "2024-06-19T15:54:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9bow25", "text": "&gt;Thank you!!\n\nYou're welcome!", "timestamp": "2024-06-19T15:54:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9brne4", "text": "Look at the managers that are staying, interview them, identify common characteristics, and tune postings and training based on the results.  Contrast those findings with exit interview results from departing candidates.", "timestamp": "2024-06-19T16:10:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9c0nui", "text": "From my initial perspective - your plan looks more like how to hire cheaper or less qualified people. Instead of indeed, it should be incorporating LinkedIn more so. You can suggest the company obtains a LinkedIn Recruiter license to find passive talent (people who are already established but may be open to new roles but aren't actively applying). You'll need to build the pitch out with the cost vs projected ROI. I would also include industry related salary guides or create your own poll to figure out market rates. Make sure your company can budget to be able to attract the best talent. If they have been offering lower than market rates for roles, they won't get better qualified people. Also include a section on culture and scope of role - find the sweet spots that will retain qualified people. Talk about succession planning and incentives to offer employees for retention. Suggest building a preferred supplier list for agency recruitment partners so that if you are struggling on finding better talent for a role, the senior leaders can incorporate agency fees into their budget. You could talk about incorporating an internal referral program (current employees who refer a candidate get a $2000 incentive if their referral gets hired and stays until x amount of time - typically probation period. Your internal retail managers will have their own existing networks of people like them). Lots of ways you can go about this.", "timestamp": "2024-06-19T17:01:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9c6ye5", "text": "This is great, thank you!", "timestamp": "2024-06-19T17:36:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9c9wij", "text": "You're welcome :) Good luck!", "timestamp": "2024-06-19T17:52:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9fwdqu", "text": "Incorporate marketing and branding in your recruitment. To attract talent, you need to make invetsments. What does your JD look like? Is it filled with a whole bunch of flowery words to describe the job? Or very exaggerated words to hype up the applicants? I think strong candidates dont just look at the job description. They want to see what the business is about. Who is in it? Whats the story behind the business? When was it founded, what are the performance metrics of the company that demonstrates stability? What are the benefits of being in the business? Basically, the selling points of the company and the job. Transparency on the salary helps too. \n\nThe interview process need to be streamlined. Who is participating in the process? How many stages? Is everyone aligned with what they are looking for in the potential candidate? \n\nFinally, survey. Send out surveys to candidates who interviewed for the role and see what they have to say regarding the process. Its a good way to understand if the recruitment journey made an impact on the applicants.", "timestamp": "2024-06-20T10:16:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
{"id": "l9i8016", "text": "Have you considered behavioral assessments and using that data to help understand some of your high performing managers and as a guide in selection?", "timestamp": "2024-06-20T19:07:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Need help on building strategy to recruit stronger retail managers. ", "url": "https://www.reddit.com/r/recruiting/comments/1djjqgs/need_help_on_building_strategy_to_recruit/"}}
