{"id": "jibptzx", "text": "I did sales for a bit in between recruiting and when I was interviewing for sales jobs a few times I was asked why sales? IMO a poor question but a great opportunity to really show your value as a candidate if you can come up with a great answer!", "timestamp": "2023-04-30T16:58:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jibt514", "text": "Thanks for your insight! If I’m asked this, I’ll be sure to show my value to the company. Is there any other questions that stood out to you that wasn’t the norm?", "timestamp": "2023-04-30T17:20:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jibw2ml", "text": "So tbh I didn’t really like sales (it was more of a survival job) so I wasn’t great at and you could def tell that during my calls but another big thing they focused on was persistence. \n\nI’m not sure if you’ve ever done sales but some roles are just getting rejected over and over and they want to make sure when they bring someone on that they can stomach that and even excel. So not necessarily any specific questions there but more of like an overall theme!", "timestamp": "2023-04-30T17:39:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jijmwwi", "text": "What’s a good answer to “why sales” would you say?", "timestamp": "2023-05-02T10:15:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jik2bpl", "text": "Unfortunately I don’t have one. I personally recruit for IT but was considering a career pivot (it didn’t pan out) lol.", "timestamp": "2023-05-02T12:53:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jic4vkb", "text": "Before this interview I would learn as much as I can about what products this company sells and who (what kind of companies / people) they sell these products to. Based on this, I'd research the companies they have already sold to to get perspective / feedback on how well/not so well their products perform and the general feedback from their customers on their product(s).  In the interview I'd ask as many questions as I can about who their market is, what works in their sales process and, more importantly, what doesn't work or where they might be able to improve their numbers, what strategies have they employed that have worked, what strategies have not worked, what are their immediate issues they are trying to solve / revenue objectives do they have and how will adding new sales people help them achieve those objectives/goals, what markets have they not yet explored that they want to explore, what, who and where do they want to do that and how can you directly contribute to that effort.  The bottom line is, the more research you do on their products, their customers, their markets, their track record / history the more relevant questions you can ask and the more directly you can address those issues by demonstrating your knowledge, understanding and relevant experience. Interview them as much as they interview you. Don't be reluctant to ask direct, cogent questions that are relevant to what they sell, who they sell to and how you can directly contribute.", "timestamp": "2023-04-30T18:40:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jic4z5d", "text": "I've been in sales for over a decade. I've been in startups mostly and in tech specific roles for over 6 years. So, here are a few things you'll want to ask in your interview (or series of interviews).\n\n1. Why are you hiring for this role - believe it or not, many people don't ask and then are blindsided when they are laid off. This question helps you determine if they're hiring because someone left, the company has grown and can accommodate a new hire or their investors have told them they need to grow and the only way they know how is to hire more bodies (this last one means they are a shit company)\n2. What does success in this role look like?\n3. Can you walk me through the typical day of an SDR here?\n4. What's the collaboration process like between SDR and AE?\n5. Is there a timeframe you all have in mind for promoting SDRs to AEs?\n6. What territory will this position be prospecting into?\n7. What the company goal over the next 2 years?\n8. How will hiring a new SDR help the company meet its goal?\n\nThere could be more but those are good questions to start with.\n\nGood luck!\n\n\\*Also, you should probably head over to r/sales if you want sales advice.", "timestamp": "2023-04-30T18:40:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jidzvty", "text": "i also recommend r/sales \n\ni start my first SDR gig tomorrow after using that sub as a study guide. there’s a lot of great info there", "timestamp": "2023-05-01T03:08:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jidzwsv", "text": "Here's a sneak peek of /r/sales using the [top posts](https://np.reddit.com/r/sales/top/?sort=top&amp;t=year) of the year!\n\n\\#1: [Just got my largest commission check of my life.](https://np.reddit.com/r/sales/comments/y2gk63/just_got_my_largest_commission_check_of_my_life/)  \n\\#2: [I woke up to a Docusign signature to complete a $3.3 million deal this morning. Let’s go!!!!](https://np.reddit.com/r/sales/comments/z9yvnc/i_woke_up_to_a_docusign_signature_to_complete_a/)  \n\\#3: [Well boys and girls, another laid off post coming at you. I'll complete one application for every upvote. Gonna make the rest of 2022 my bitch.](https://np.reddit.com/r/sales/comments/vp34kc/well_boys_and_girls_another_laid_off_post_coming/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)", "timestamp": "2023-05-01T03:08:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jicp9nx", "text": "I’m copying your comment because I have an interview tomorrow and these are great questions!", "timestamp": "2023-04-30T21:03:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jibl4yb", "text": "What sort of questions do you have prepared?", "timestamp": "2023-04-30T16:25:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jibt05e", "text": "Mainly situation based questions:\n\nTell me about a time you struggled with a sale, and how you overcame it?\n\nTell me about a time you went above and beyond for a customer?\n\nWhat is your biggest weakness?\n\nThis is all I really came up with, the rest I felt would just be muscle memory, but please, if you have any interview prep questions, I’d love to hear them so I can practice! :)", "timestamp": "2023-04-30T17:19:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jic3hvs", "text": "Gotcha. If your direct report will be conducting the phone screen, definitely ask about metrics, how they measure success, how they came to be the manager. Your sales manager will make a big impact on whether you stay in the role long term or not, so feel out their personality with culture questions like how they define an ideal candidate, what type of people succeed in this role, etc.\n\nIf it isn’t your direct report and you think this is going to be a multi step interview process, I always like asking how they define the culture of the company to see how it changes (or doesn’t) between the people interviewing. \n\nKeep us posted on how it goes and best of luck to you! :)", "timestamp": "2023-04-30T18:30:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jic6ktb", "text": "The best thing I've learned in sales, especially with sales meetings is one thing. Ask open ended questions. Then you can follow up with can you go more into detail about X? Don't ask yes or no shit too often.", "timestamp": "2023-04-30T18:51:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jic6ldg", "text": "I just got accepted for an SDR role in pharmaceutical sales and something that I think helped a lot in my interviews was explaining how my skills from my past work experience will transfer into this new SDR role. Also explaining why I want to pursue sales and any other hobbies/goals I have that show I am an ambitious person.", "timestamp": "2023-04-30T18:51:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jicay4n", "text": "I hate recruiting sales people because the best ones talk analytics (I love those) and the worst ones spew rhetoric. \n\nIf you're not talking metrics, in my opinion you understand the sales process but not how to create solutions. But like a sports fan that can talk sports it doesn't make them a great athlete.", "timestamp": "2023-04-30T19:22:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jicjf3z", "text": "1. Don’t ask what the base is!! I hate when people do that, and I don’t tell them over the first interview anyway! \n2. Tell them this next move is your last and plan to stay with a company with room to grow.  (Employers, especially in sales, hate seeing people bounce around) \n3. Ask them, “What does a great sales rep look like two years from now, three years from now?” and ask for specifics, income, and different paths, and dive deep.”\n4. Ask them about ownership of your book of clients and if you have a non-compete (if they say yes, then if you leave, they keep your book, so make sure you're picking a company you plan to stay at) \nMainly ask questions about your ability to grow, not the base salary! \n5. Ask about lead programs, coaching, and Sr. Sales reps to work with for the closing; you need details on how to climb up at quickly as possible. \n6. And DONT GIVE THEM AN ANSWER RIGHT AWAY! If it sounds good, set an in-person meeting for next week. That way, you can sleep on what info you got, and when you meet, make sure it matches up. Don’t ever commit the first time you speak, and you will look very desperate!", "timestamp": "2023-04-30T20:22:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jiffcsb", "text": "Why do you hate it when people ask about comp? And why wouldn’t you disclose that upfront? You also say in your third point to ask for specifics on income, so which is it?", "timestamp": "2023-05-01T13:22:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jick0ku", "text": "Thanks for the tips! Are there any “out of the norm” tough questions I should be aware of or prepare for in the interview?", "timestamp": "2023-04-30T20:26:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jifglz6", "text": "For the love of god, please ask about comp!!!! It's a sales role. It matters. \n\nIf that offends the interviewer, then you can bet their offer will offend you so it's best to get that out of the way quickly. You can ask about base salary and the average OTE (on target earnings). Part of interviewing for sales roles is treating the process like discovery. Your job is to qualify (in or out) roles and companies. Knowing the base and OTE helps you do that.", "timestamp": "2023-05-01T13:32:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jigcewl", "text": "I agree with this.  I think you covered most everything.  I think another really great takeaway is asking vibe sorts of questions in any position or industry you are in.  I realize vibe goes out the window when cash is not flowing into the back account.  \n\nBased on sales sub, things like will I be making cold calls in an open office space all day long?  How will I be measured?  Obviously these questions are based on the persons skillset but flags may be raised.  Maybe you take the job but continue to spam apps because you know you’re going to work for a psycho.  \n\nMy best example would be that I once had an interview in a company that I really wanted to work for.  I asked the HM a question three times in a round about way.  The fourth time I said, “I’ve now asked the same question three times and you never directly answered me.  Will x be possible?”  Got a pretty firm no and we wrapped up the dance.  \n\nI would have been miserable there.  Now I do contract work for them and make 4 times the money with about 1/20th the bullshit.", "timestamp": "2023-05-01T17:13:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jigwoxh", "text": "This is a great real-world example of why the hard questions matter. Like you said, when you need income, you're willing to forgo asking tough questions because you want any job. But, if that's not your position, it makes sense to be calculated with how you interview.", "timestamp": "2023-05-01T19:26:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "l2oqtob", "text": "a year later I am coming across this post and all I can think of is.... UH what? Seriously? Why do you not like it when people ask what the base is? I am a recruiter myself and I think it's completely fine for people to know what the pay is when they are interviewing. Wouldn't you want to know? People don't have time to waste and if your pay is low, why would they even want to interview? It's a 2 way street and nobody should just continue interviewing blindly.", "timestamp": "2024-05-05T13:51:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jidt5g0", "text": "I would ask about specifics of compensation- is there a base salary, what is the commission structure? How will your performance be measured? What resources will you be provided with to be successful at your job? This can include a CRM, networking assistance from executives, etc. \n\nI also ask what the interviewer likes most about the company.", "timestamp": "2023-05-01T02:10:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jif16k4", "text": "Do you know what the phone screen is set up to confirm? A phone screen can (and should) only cover minimum requirements but some recruiters turn them into endless exercises as well.", "timestamp": "2023-05-01T11:05:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jif16l0", "text": "Sorry, your submission has been automatically removed. Accounts with less than 5 comment karma a will be flagged for moderator approval. This is to combat spam.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/recruiting) if you have any questions or concerns.*", "timestamp": "2023-05-01T11:05:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
{"id": "jif5amg", "text": "Every sales job I've received I acted like I didn't want it. They are so used to ppl kissing ass to get a job, that if you quasi reject it...they try harder. \n\nI've received salary boosts, commission boosts, sign on bonuses etc just for saying, \"ehh, idk, sounds kinda beneath me.\"", "timestamp": "2023-05-01T11:50:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Sales recruiters, I need your help!", "url": "https://www.reddit.com/r/recruiting/comments/133w7ml/sales_recruiters_i_need_your_help/"}}
