{"id": "mqdm2ca", "text": "You read the resumes. Power through.", "timestamp": "2025-05-03T14:41:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdntvm", "text": "This is the way. You have to put in the work.  Reverse engineer the process. When do you need a new hire in place and starting? Work from that date to the current date and plan budget time to screen applicants, hold interviews and make offer. If you have 500 resumes you need a filtering criteria when glancing at them (certain mix of skills, background, experience), do that for multiple rounds and sessions until you identify an interview pool. \n\nThen contact those filtered out and not advancing to interviews and let them know about it in an update. That's part of your job too.", "timestamp": "2025-05-03T14:51:04Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqg3jej", "text": "You read the resumes and regularly report how many you are reviewing so the hiring manager has a realistic picture of your capacity. I’m noticing they aren’t aware of just how much time we’re already spending on this when they also request a focused effort on sourcing.", "timestamp": "2025-05-03T22:44:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqg3yi7", "text": "My hiring managers are scared of me. I lead with fear not professional respect. \n\nI work for a smaller company ~200 people and we’re spinning up the next company now - I’m at the director level, so I don’t do the recruiting anymore unless I’m needed. However, I’m fiercely protective of my recruiters. The managers know we’re quality over quantity, and they won’t have more than 10 resumes at a time in play. We aren’t wasting our time for managers to not provide feedback.", "timestamp": "2025-05-03T22:47:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdnbw0", "text": "A thousand applications?! Shut down the damn job ad and stop wasting both candidates and recruiters time", "timestamp": "2025-05-03T14:48:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqkpuoy", "text": "This", "timestamp": "2025-05-04T18:15:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdpbkw", "text": "Checking the requisition periodically, when you start to see more than 50 applicants to the role, un-post the position, review the candidates, finding none that are a fit, repost it.", "timestamp": "2025-05-03T14:58:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdqevn", "text": "Thanks. This is essentially what I do right now.", "timestamp": "2025-05-03T15:04:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdrp1f", "text": "Cheaping out on an ATS is probably not the best idea as your time being a hiring manager is more valuable \n\nThere's no need to buy best-in-breed but an ATS that covers the basics would be helpful \n\nCheck indeed's ats. It's basic but might get the job done. Also look at SmartRecruiter.", "timestamp": "2025-05-03T15:11:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqds3tq", "text": "Yes, that's a good point. I haven't been able to convince my company yet, but this sounds like the best approach so far.", "timestamp": "2025-05-03T15:13:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdurr0", "text": "Hiring, while important is not all of your job (probably a tiny fraction thereof). An ATS organizes the hiring event and allows you, the hiring manager, to focus on the work of the firm and bring people on board. \n\nSure, a spreadsheet can organize the names and skills but can provide depth regarding filtering candidates (who wants to read about a line order cook? Not you if you're hiring a product manager).\n\nThe best part about an ATS is the ability to search roles against candidates (that silver medalist might be a good fit for your new position and might be available).\n\nThere are plenty of ATS that can provide value without huge cost\n\nAs your company grows, the time spent using an ATS may encourage the leadership to eventually invest in one that fits the needs of the firm.", "timestamp": "2025-05-03T15:27:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdpehn", "text": "Post it on indeed or LinkedIn with mandatory questions that filter them out. Close the add at 100 applicants - not 1000. You can make an applicant tracking form on excel and connect it to your website so their details are automatically uploaded, enabling you to filter through responses, but otherwise it’s just about reading. A lot of good candidates are filtered out wrongly too, so manual checks are usually better", "timestamp": "2025-05-03T14:59:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqenztb", "text": "Mandatory questions are the best way of filtering, as a job seeker I avoid applying to those jobs requiring multiple open response questions unless I really really think I'm a match. Yes some people use AI to fill it in, but not enough to kill the strategy.", "timestamp": "2025-05-03T17:57:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqh4oo8", "text": "What do you do when 90% of the candidates answer the screening questions perfectly?  I get hundreds of applicants in the first week and they all lie on their applications screening questions these days.  Or the majority of candidates now use AI to “tailor” their resume to align with the description but don’t actually have the experience.", "timestamp": "2025-05-04T02:43:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqj84qq", "text": "You read their job history. Realistically, a lot are going to have relevant experience. Have a 10-15min phone conversation once you have compiled your list of potentials but only ever take a max. 5 people to interview per role. See if they’re a cultural fit, ask what management style they need, figure out who‘s background aligns best with what you need. People lie because getting work nowadays is so difficult, but you can usually tell when talking to them if they are", "timestamp": "2025-05-04T13:35:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqjethg", "text": "Sorry for the long response here.  I'm not talking about an entry level role - these are manager, senior manager, director level roles.  With a time shortage already, there's not time to call to screen, or even email 60 people that from the basics of a quick read through resume, match to screening questions (with no actual mention of that experience on their resumes) and looking into company/industry backgrounds to make sure correlation to the role requirements, it's a matter of timing when there's already no time in the day.\n\n  \nI recruit in a major city (as my main company location + 6-8 other locations across North America based on our companies needs) and the screening/reviewing process is getting so muddy for the exact reasons you mentioned - people like because finding work is difficult so they want to just apply and throw their hats into a ring.  I sympathize with that, I've been laid off and on the other side but the landscape of it all is AWFUL.  so I'm curious what tools or strategies other people use to cut through it all now - seconding the OP posting as I'm in the same boat.\n\n  \nIf I have 350-600 resumes per role (if not more; I had a couple that were in the thousands) - using screening questions to disqualify isn't helpful anymore because people want to find ways to \"pass the ATS\" so that a person reviews their resume so they answer questions that they think will get their resume to a person to look at.  From there, 80% are a match. So yes, then looking at resumes, it could take hours to then look at each resume individually, when each day is filled with 3-5 hours worth of calls (screening calls/hiring manager checks-in), minus time for onboarding/new hire set up and activities, scheduling/emails with current candidates in processes, updates to leadership/management, AND then resume reviewing, that doesn't leave enough time to get through those 80% qualified/unqualified resumes for 8-12 roles in a timely manner.\n\n\n\nThe systems are broken, the technology isn't working.  So I'm ranting a little bit now as a frustration for the entire landscape of recruiting being so difficult to navigate right now.  I love that candidates can use AI to tailor their resumes but a 3-5 year Marketing Coordinator applying to a Marketing Director role requiring at least 10-15 years of experience can now use AI to slightly change their wording and beef up their resumes - leaving dates off of resumes, changing their job titles slightly, using all the right wording, hit all the keywords.  I look for skills and experience, focusing only a little on past job titles cause there's so much fluctuation in that from company to company. It's obvious most times based on the wording they use that they are not at the level but with the use of AI, the resumes are equally so generic but tailored, it requires extra time to get through them and compare to LinkedIn profiles.  Obviously then seeing the truth then. BUT, in doing that, it can take 3-5 min minimum to now look at each one and sort through.\n\n  \nEven if making a quick list of candidates to come back to before digging in deeper to whittle down - it's still the same time.  I could make a short list of 20 resumes and after a little digging, they are ALL not a fit and then it's back to that main list.  I've had 350 resumes for one role, with only 3 actual viable candidates.  Our job posting is VERY CLEAR as well as the screening questions but I'm now thinking applying to jobs is too easy these days, would be needing to look into better screening questions or something else.\n\n\n\nI mention all the above because it's the same for my workload of 8-12 roles (the number is slightly irrelevant) and little time in the day AND with a subpar ATS, I'm genuinely curious how people are getting through this.  It's clear my company needs better systems, that's a future project that will hopefully be in the works.  \n\n\n\nTLDR; OP ([Lopsided\\_Eye\\_901](https://www.reddit.com/user/Lopsided_Eye_901/)) I'm with you on your question as it's been my main focus the last couple months, in trying to find better solutions.  I've worked on tech roles and it's had the same issues you described having.  You're not alone but wish I had more helpful things to add.  I'm also glad you started the conversation as I am also curious what people are doing to navigate it.", "timestamp": "2025-05-04T14:13:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdovjw", "text": "If you don’t have an ATS, where are the applications and resumes housed? In an email box?", "timestamp": "2025-05-03T14:56:34Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdq56m", "text": "TriNet can intake the resumes and I would login to it and review each resume. When I have more applicants than I can screen, I ask our HR to pause the job posting just so I can catch up screening them.", "timestamp": "2025-05-03T15:03:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqeeqjp", "text": "Yep. Unless they’re willing to pay for more ATS features like knock out questions this is the job. It’s not glamorous but it’s what we gotta do sometimes", "timestamp": "2025-05-03T17:11:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqdvbu0", "text": "Make any non-negotiable requirements crystal clear in your job posting. If you're not offering visa sponsorship,  make that very obvious. If you need someone with a particular degree or certification to walk in the door, make that obvious. Don't be afraid to close the job posting whenever you feel the pool is deep enough (it could be a week or less, or whatever), you can always reopen or open a new posting if you don't find what you need. Avoid FOMO. It is your enemy. You can not review every resume in the world. You can't interview everyone either. You have to learn to accept that.\n\nThe first cut is minimum qualifications - scan the resume, and if they don't have these things, reject. Red light/ green light. You can assign that task to your most junior staff or even an intern, but make the requirements easy to understand without interpretation so they aren't making judgment calls, just verification that the short list of non-negotiable requirements is met. You might start with 100 and end up with 50 after this. Lots of people mass apply for jobs and hope they throw enough darts to hit the board, even if not qualified. (Edit to add: you can just track it all in an Excel spreadsheet if you have nothing else).\n\nThe 2nd cut would be a more thorough resume review by the manager the person would report to or a trusted senior member of technical staff in the functional area being hired for. Maybe you target cutting the remaining stack by &gt;75% in this step.\n\nThe remaining dozen-ish candidate resumes are reviewed by the manager and their +1 manager. Choose the top 5-6 of them to be phone screened. 20-minute phone or video call by the manager the person would report to or a trusted member of technical staff in the area being hired for. Focus on non-technical \"get to know you\" questions to look for their people interaction skills plus a maximum of one technical question that would tell you if they know their job field (aka \"shop talk\"). Just making sure they can get along with your team dynamics and that they aren't faking the technical knowledge. \n\nBring the top 2-4 candidates in for an onsite interview. Give them a facility tour and have casual conversation. Interview panel of no more than 5 trusted people. Each interviewer gets to ask 1 technical and 1 non-technical question, coordinated before the first interview, and ask all candidates the exact same questions. Otherwise, there are too many cooks in the kitchen and too many different questions. \n\nTry to schedule the interviews within a few days of each other. The interview panel meets to debrief and make final decisions within 48 hours of the last interview. All of the folks interviewed onsite get a call from the manager to offer/reject personally.", "timestamp": "2025-05-03T15:30:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqegq2f", "text": "This. This is the only way, as somebody who is ALSO dealing with a similar issue (our ATS just sucks). \n\nFor roles with lower application volumes, I’ll go through and do a full review one by one, actioning as I go. But with that type of volume? You’re spot on with the red light/green light approach. I’ll scan for YOE and education (if required for the role) and keep *anybody* who meets those in my pile first. Whittle it down, second pass I’m looking for the “preferred” experience. If they have that, they get flagged for me to call. After that, I usually have a smaller pool that I can dive a little deeper into. \n\nBOO at shitty ATS software though. I can’t understand how in 2025, we still have software that makes me yearn for the days of going through piles of paper resumes 🫠", "timestamp": "2025-05-03T17:21:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqefpui", "text": "Google Drive has a great search function. Add to one folder and use a smart search function to filter for specifics. Then read. Even a good ATS fails frequently. Learning to scan efficiently with your eyes looking for tone and perspective of how the candidate sees their work will tell you a lot.", "timestamp": "2025-05-03T17:15:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqeg8tx", "text": "TriNet has no search or filter capabilities. This is an interesting idea! Thanks!", "timestamp": "2025-05-03T17:18:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqeh1h1", "text": "I like TriNet in some circumstances but I don’t see their software as a real ATS.", "timestamp": "2025-05-03T17:22:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqeh87l", "text": "I maintain tens of thousands of resumes, some in folders. Google Drive is a great tool as it parses everything.", "timestamp": "2025-05-03T17:23:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqegai4", "text": "Use your eyes. If you are too busy to look through applications you are doing it wrong. If most of the applications are garbage, then theres a problem w/ your job posting or you aren’t using knockout questions.", "timestamp": "2025-05-03T17:18:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqfi7v9", "text": "I review them every single day (often 50+) to keep it manageable. I also use a questionnaire to quickly eliminate people who do not meet the minimum quals. \n\nAs soon as I have 10-15 strong apps I close down the pool until I can screen through them and reopen if needed but typically that’s not required. \n\nBy this method I am able to manage 7 or 8 (active) highly technical reqs by myself at a time and still have time for other duties.", "timestamp": "2025-05-03T20:40:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqggdmw", "text": "TriNet is an ATS now? lol I worked for them years back. We used taleo. Anyway, what features are you looking for? I always do it manual. I’ve never had a tool that threw someone out. My process if I have or know I’m going to have that many applicants, I only open the job for a day or only look at the first 40 applicants. Depends on the job", "timestamp": "2025-05-04T00:03:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqh1n3g", "text": " Who is screening hundreds of resumes without an ATS??! Like that’s a legit ridiculous employer if that’s the case 🤦🏻‍♀️", "timestamp": "2025-05-04T02:23:03Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqi9vau", "text": "Sounds like a start up recruitment company, sounds like most tech start ups\n\nBet you own bill 40k annually. Get a grip.", "timestamp": "2025-05-04T08:46:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqh5gjf", "text": "We use Dayforce and it’s awful.  It sounds similar to this.  It has some functionality for more but is basically just a resume warehouse.  Im guessing maybe similar to this.", "timestamp": "2025-05-04T02:48:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqi9qaz", "text": "Wear some Nikes and just do it.", "timestamp": "2025-05-04T08:45:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqytma3", "text": "Im actually building a tool to do exactly this and I would love your feedback if you're open to that!", "timestamp": "2025-05-06T22:28:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "mqz3m6k", "text": "They have many AI agents out there now that can do this. But you'd end up sharing the sensitive resume data with these LLM providers (I.e., openAI). If that's not an issue it's pretty easy to set this up. You could also host a small LLM on your laptop and do it. It'll be slower but faster then reviewing them all yourself", "timestamp": "2025-05-06T23:23:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
{"id": "ms1cnvi", "text": "I’ve been in the same boat, and using a combo of spreadsheets and keyword filters has helped.  \n  \nYou can set up a simple Google Sheet with columns for key skills and use tools like Resumator or even Google’s free resume parsers to pull out relevant info.  \n  \nIf you're handling a lot of applications, you can automate some steps using Zapier to push resumes into the sheet, cutting down on manual work.  \n  \nEven without a full ATS, these lightweight tools help streamline screening. If you're looking for something more dedicated but not as heavy-duty as a full ATS, [Recruit CRM](https://calendly.com/d/dqp-2qn-ww7?utm_source=reddit&amp;utm_medium=reddit+organic+syndication&amp;utm_campaign=012-GptAnswer) might be a good option to check out.", "timestamp": "2025-05-13T04:16:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "How do you screen hundreds of resumes when you don’t have a full ATS?", "url": "https://www.reddit.com/r/recruiting/comments/1kdug6t/how_do_you_screen_hundreds_of_resumes_when_you/"}}
