{"id": "ioo4btf", "text": "Never having worked as a recruiter is an issue. There's no degree in recruiting, but crafting searches is something you will need to spend *a lot* of time learning. \n\nI also don't see most companies trusting engineering screens from anyone but themselves. You'd be better of partnering with an experienced recruiter and handling the client side while they did the candidate side.", "timestamp": "2022-09-16T14:29:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioodz9j", "text": "Second this. Companies will do their own due diligence on a candidate.", "timestamp": "2022-09-16T15:32:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioogbtt", "text": "As they should.   \nMany just over do it.", "timestamp": "2022-09-16T15:47:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioogh0r", "text": "Definitely.", "timestamp": "2022-09-16T15:48:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iopu44j", "text": "Not to mention him assessing their social skills, which is a huge liability and companies aren’t going to trust someone else to do that.", "timestamp": "2022-09-16T21:13:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioo3j1f", "text": "I think the biggest problem is to convince companies to trust your technical assessment and change their hiring process, most of them will ask you to do it but also asses the candidate themselves making the process even longer", "timestamp": "2022-09-16T14:23:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqwoda", "text": "Which in turn goes into a worse candidate experience countering one of OP’s selling points.", "timestamp": "2022-09-17T02:12:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioosbuc", "text": "The market is saturated with software development recruiters and we are going into recession. Check yourself before you wreck yourself", "timestamp": "2022-09-16T17:04:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iooeq40", "text": "This idea won't scale well at all. You will find yourself overwhelmed quickly assuming you even convince clients to go with you and once you do you will have to hire recruiters and realistically they won't have your knowledge in software development so you are basically going to regress to a regular recruiting company at some point.\n\nIts also not easy to convince a company to give u full reign on the hiring process and basically be like \"trust me\". If you do then they are going to want some crazy guarantees like 6 months refund or something.", "timestamp": "2022-09-16T15:37:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioo94rj", "text": "Hmm, I as a recruiter have never been a “Senior software engineer.” However, I’ve dabbled in coding and feel confident that I can solve whatever problems come my way. I will start my own software engineering firm tomorrow.\n\nSee how it sounds when you flip the record? Ridiculous.", "timestamp": "2022-09-16T15:00:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iooqidc", "text": "100%. The whole “I used to be a software engineer so I can recruit software engineers better than seasoned recruiters” argument is bs. Clients don’t care about that, they just want good candidates delivered to their inbox. \n\nI’ve never been a software engineer but I guarantee I could find more software engineers than the OP, in a quicker amount of time as well.", "timestamp": "2022-09-16T16:52:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioost6e", "text": "For sure. I’ve been a healthcare recruiter for some time. Some of the worse recruiters I’ve ever seen were former healthcare workers who “wanted to try something new.”", "timestamp": "2022-09-16T17:07:07Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iootxkm", "text": "100%. Everyone thinks recruiting is so easy until they start doing it lol.", "timestamp": "2022-09-16T17:14:22Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iootxec", "text": "Companies will not trust your technical assessment as they all have different bars and challenges", "timestamp": "2022-09-16T17:14:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iopinip", "text": "I am a software developer recruiter. A seasoned recruiter could start their own business but you would need a nice bank of clients to do this. \n\nWinning clients in an incredibly saturated market is difficult. You would either need to massively under it the rates of well established recruitment agencies, in which case you are going to work with cheap and unreliable companies or you compete with well established agencies which would be very hard. \n\nAlso, recruiting at a high level is very expensive. Most companies have access multiple jobs boards ( a few thousand each per year) plus LinkedIn recruiter (even more expensive) \n\nI personally think without a background in recruiting, this would be extremely difficult and time consuming.", "timestamp": "2022-09-16T19:56:12Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iop2ni8", "text": "You make some valid points in terms of the pain points for clients and candidates. But here are the issues I've seen with this model, I hope this doesn't come across harsh but want to be as straight up as possible. Leaving aside your recruitment experience...\n\n\nImagine if some external party was hired in to technically asses the candidates your company is currently hiring for. Wouldn't you want to verify their ability for yourself? \n\n\nHaving seen this approach before and it always leads to more technical assessments, not less. Most of the companies I remember trying this pivot to a traditional recruitment model, stay really niche or fail. After all, how do you plan on scaling if you're responsible for doing all assessments?\n\n\nWhat you consider a \"good\" candidate based on technical assessment won't necessarily align with the client. Remember you're currently benefiting from being *inside* the company that you're hiring for. This gives you a real understanding of what is and isn't important, as well as intimate understanding of the projects and problems faced. When you're external you don't get any of that insight and changes are communicated slower.\n\n\nIt can also be argued it's a conflict of interest to asses and recommend a candidate for a company, unless they have a verification of the candidate a technical ability. This equals more tests, not less.\n\n\nIf you find the obstacles I mentioned here around testing yourself leading to more rounds, not less, will you decide to abandon the idea of testing, as it's adding unnecessary rounds for the candidate?\n\n\nIf so, what added value do you bring to the client over a regular recruiter? And if just doing regular recruitment, how do you compete with established, experienced recruiters?", "timestamp": "2022-09-16T18:10:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioph2dn", "text": "Thanks for taking the time to flesh out this response. \n\n&gt; Wouldn't you want to verify their ability for yourself?\n\nCertainly. If the company is willing to build trust, then I might try to\n\n* Impress them with our standardized process and detailed interview report?\n* Have them interview me.\n* Have them sit in on an interview.\n* Share recorded interviews.\n\n&gt; After all, how do you plan on scaling if you're responsible for doing all assessments?\n\nI don't think I want to scale this business. I think this would just be building myself a job until my financial goals are met.\n\n&gt; What you consider a \"good\" candidate based on technical assessment won't necessarily align with the client.\n\nA fair point. I guess I'm thinking less of super competitive hiring at FANG and more so government contractors, banks etc that are less concerned with a very specific candidate fit as opposed to finding someone competent, enjoyable, and teachable.\n\n&gt; It can also be argued it's a conflict of interest to asses and recommend a candidate for a company,\n\nI guess that's where reputation comes in to play. I see this as a big problem if I ever send a dud.\n\n&gt; If you find the obstacles I mentioned here around testing yourself leading to more rounds, not less, will you decide to abandon the idea of testing, as it's adding unnecessary rounds for the candidate?\n\nYea, that would make this idea dead in the water.\n\n&gt;If so, what added value do you bring to the client over a regular recruiter? And if just doing regular recruitment, how do you compete with established, experienced recruiters?\n\nDoing regular recruiting doesn't seem super attractive to me so I would abandon the idea. To entertain the question, I would leverage my experience in tech to avoid all the reasons devs tend to ghost most recruiters: poorly written messages, generic pitch, mismatch technology stacks/interests/experience levels/industry. I'd sell them on the dream of a smooth interview process with a dev that understands how shit the process usually is, values as much transparency as possible, can help them negotiate offers, is extremely responsive.... On the flip side, I could entice businesses with my personal network. If they don't want my full vetting, I can get a better idea of whether the candidate has any hope of passing the technical screen than non-technical folk. At least sniff out how much of their resume they can actually speak to from a tech perspective.\n\nThanks for the reality check. I might try to spin this up slowly until I get a bite from some large employers and if nobody cares for it, then just let it die.", "timestamp": "2022-09-16T19:45:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqb38x", "text": "This won’t work. Candidates will still ghost you lol. You will just end up having to recruit and mass message candidates like we all do.", "timestamp": "2022-09-16T23:19:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqzmdv", "text": "&gt;I guess I'm thinking less of super competitive hiring at FANG and more so government contractors, banks etc that are less concerned with a very specific candidate fit as opposed to finding someone competent, enjoyable, and teachable.\n\nSorry but if you feel any company that isn't a FAANG hires anyone off the street like its a charity and somehow has lower expectations then you will have a very hard time keeping your clients.", "timestamp": "2022-09-17T02:37:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iopmjv1", "text": "&gt;I might try to spin this up slowly until I get a bite from some large employers and if nobody cares for it, then just let it die.\n\n\nThis is the right approach. If you said I'm quitting my 9 to 5 and setting this up I'd advise against it. \n\n\nThe value you'll actually add is that you'll save *Clients* time. I work internally now, and I'd consider working with someone that said something along the lines of - \"I'll send you less CV's, but every one of them will be relevant.\" That saves me time and that's something that will get you in the door. What you won't do is get us to change our process, therefore you'll need to be comfortable knowing that you're not adding a huge amount of additional value to the candidates. \n\n\nWhat you probably don't realise is, there are always more candidates to contact, even in highly skilled markets. So although you *might* get a better response rate, a regular recruiter doing more will get more candidates. So the problem some recruiters have with bad messages and low response rate is overcome by contacting more people. So it's not an issue that will prevent a recruiter from making placements. \n\n\nBe careful over selling your network, most seasons recruiters will have as big if not a bigger network to tap into.", "timestamp": "2022-09-16T20:22:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iorutw3", "text": "Man, this thread is full of a bunch of negative Nancys! Despite what everyone here is saying, recruiting is NOT rocket science and yes, your prior dev experience would serve you well. \n\nThe average recruiting firm in the US is less than 3 people and does less than $1M in revenue. What does this tell you? - the market is highly fragmented and hiring managers work with people who they build rapport and trust with. \n\nWhy can’t you be one of those people? Surely there are plenty of technical managers who would entertain a call from someone who they view as a peer. \n\nI don’t know that I’d recommend spending a bunch of dev time building some complex system to automate everything (at least not at first). But if you focus on a white glove experience, are a strong communicator, and don’t piss the devs off by throwing “gotcha” questions at them or trying to prove how smart you are, I think this has legs. \n\nAt the very least, you could build your way up to 10-15 placements a year at 20% fee within a year or two….", "timestamp": "2022-09-17T08:19:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioo79cc", "text": "You either need a recruiter as partner, or even join a recruitment firm to try it out first.\n\nI don't think even as seasoned recruiters, that anyone can so easily dive head first in starting a recruitment business", "timestamp": "2022-09-16T14:48:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioppq5q", "text": "Essentially karat.com for .net", "timestamp": "2022-09-16T20:43:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioq15j3", "text": "Others have already pointed out that recruitment alone is its own specialized skillset and not for the faint of heart , so I’ll just add this:\n\n To my knowledge there are many, many, boutique agencies for specialized skillsets that are run by and/or staffed by people who recruit in their former field. this is entirely anecdotal but I really do know a lot of people personally who have made that transition. \n\nEven if clients/employers were willing to trust an external partner to do all the technical vetting, (they’re not) I imagine you might already have pretty hefty competition.", "timestamp": "2022-09-16T22:04:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioq2toz", "text": "Adding to this as I read comments: \nThere’s a lot of good advice here on how to make this work. The only missing link here is that your initial pitch addresses a lot of issues with the hiring process that would have already been solved by the boutique agencies if they were really solveable things. So my actual piece of advice is to make sure your pitch is watertight in its uniqueness if you want to come across as “not like the other girls” if you will. Best of luck truly, I love recruiting and I hope anyone who tries it gets something great out of it.", "timestamp": "2022-09-16T22:16:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqqmcj", "text": "All sounds good until you get on the phone.\n\nTake a few classes on writing, sourcing, closing and selling. If you are weak in any of these areas your business will suffer.", "timestamp": "2022-09-17T01:23:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iopi1u8", "text": "On the contrary to what other people are saying, you don't need to have years of recruiting experience to open a recruiting business but you need to become very familiar with how it works and how to source candidates effectively. From a candidate perspective, I definitely think developers would connect more with you since you know your craft, but at the end of the day its going to boil down to the clients you have, what they pay, and if their benefits align to what the candidate needs. \n\nThe business development part of running a staffing firm is one of the more difficult parts. You'll need to convince clients to work with you and as much as you're qualified to do technical interviews, they won't trust you to do them because its a conflict of interest and they likely won't care about your experience either because it isn't tied to having experience *recruiting* developers. How do they know you're not just filling in answers for the candidate so that you get the placement fee? They already know you're a seasoned developer based on your pitch. Don't ever expect any client to have any trust in you until you've consistently sent people they follow through with.\n\nThen there is chasing them for payment, which is a whole other thing.  \n\nAll in all, my general recommendation is to partner with a full desk recruiter with documented success in finding clientele and sourcing strong candidates. \n\nMy other recommendation if that is something you're unwilling to do is to find the above recruiter and pay them to consult you on the recruiting side by the hour so that you have a better understanding of how to source candidates and clients. \n\nI think both can give you success, having a partner would solidify that success a bit more. There are so many things in the 7 years I've recruited that I just know as second nature now that I had to learn as I went along in my career.  I think you have a good business plan, and being that you will have a better network of developers and can relate much more, that is a strong point and I wish you much success in your future endeavors.", "timestamp": "2022-09-16T19:52:10Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioptgaa", "text": "Maybe think about into an agency first even just for a couple of years. Don't sign any crazy restrictive covenants, and start honing your craft, then go solo. Search is not as simple as it looks and some time at a company with colleagues will be invaluable. My industry is also a very technical one (legal) and is full of ex lawyers, but lots of them are crap recruiters and flake out within months as the skillets and pressures are actually quite different.\n\nI have my own successful business and working for yourself is the best, so would totally encourage anyone to do the same, but I would never have been able to do it without experience in a larger agency. Our job is essentially just a desk and a phone but some time hearing others on the phone and soaking up the expertise of the high billers is really valuable.", "timestamp": "2022-09-16T21:09:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "muipd1t", "text": "I hope you went for it.", "timestamp": "2025-05-27T14:16:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iop9xrq", "text": "I think you have a good idea overall but you’d be better served having people come to you first.  I would recommend creating a network of subs, bid out and perform work.  You would have a curve as it relates to payroll, insurance and other logistics.  At the end of the day you could still focus on attracting talent while getting paid for providing a service. \n\nI’m just spitballing here, no solution is without challenges which is why we all get paid.", "timestamp": "2022-09-16T18:58:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iopb6rt", "text": "Just sent you a message", "timestamp": "2022-09-16T19:06:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqiny8", "text": "OP our recruitment agency needs someone for the client side you should DM me and we can discuss a mutual partnership 🥳", "timestamp": "2022-09-17T00:19:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqrzfh", "text": "I think first of all that this is a bit funny. Because I don’t think anyone would describe being a recruiter like that. And second of all no company ever would let you do the technical screening or the full interview stage. There is a security reason they do the testing and the interviewing themselves. Unless you have worked with a client for the past like 5 years and they know your grandma by name and show up to her birthday party every year with a gift there is no way they are going to trust you to make those extremely vital decisions for them. Because realistically you are a stranger that is benefiting on them making as many hires as possible at as high of a salary as possible. So it is against their business interests to let you do it. Then lastly recruiting is not a easy task it takes skills and commitment and I would never encourage anyone to start a recruiting business without being one. It’s like saying well I have ran a gas station for 10 years. I am a senior designer but I have sat in on a bunch of accounting meetings I should start my own accounting firm. Those three occurrences have nothing in common unfortunately. You can have experience running a business and still profusely fail because you have no skill in the trade you are getting into. It is more important to have the skills for the trade and then be missing the business skills than the other way around. I think you need to talk some recruiters and see what it actually is like day to day being a recruiter because otherwise and I can if you do and are a experienced recruiter you will probably go at least 6-10 months without a single paycheck.", "timestamp": "2022-09-17T01:34:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqwk80", "text": "Crush it!", "timestamp": "2022-09-17T02:12:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioqyi5v", "text": "I think your concept makes sense on paper and one I've seen since the beginning of time in my recruiting career where the promise is \"let us do the heavy lifting\". But unfortunately, if you're external, your job is to find the most qualified candidate for each position you're recruiting for and time is money. You'll spend more time on those write up reports than what is needed. Every client will have their own process and won't conform to yours. If a client is working with you, they'll likely be working with others that are your competition. You haven't recruited before so you haven't gotten the full scope of the grunt work involved. And you need to figure out your sourcing strategy before you can try to simplify a process halfway into it.", "timestamp": "2022-09-17T02:28:07Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "iorrc8d", "text": "I would check out Facet they did something very similar, developers now recruiters. There are hundreds of new staffing agencies started every year and the agencies that are extremely successful have 10+ years of relationships with companies to hire from them.    \nJust know that it might take a few years to really build out a very profitable firm.", "timestamp": "2022-09-17T07:33:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ioxic6b", "text": "Another key piece of information that everyone isn't mentioning is that tech growth is typically tied really closely to interest rates. We've had a couple 75 basis point hikes and we're going to get another soon, slowing growth more and more. My LinkedIn is a bloodbath of people getting laid off basically every week, the time is wrong.", "timestamp": "2022-09-18T14:27:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "ip5vj9f", "text": "*3. I have no idea how hard it will be to get companies to sign up with my firm.*\n\nThe answer to this is \"extremely hard\".  Finding clients who will hire from you regularly is by far the biggest hurdle, and if you F up a few times then you lose them and are doubly screwed.  Most companies have firms and recruiters reaching out to them CONSTANTLY so getting a foot hold can be tough", "timestamp": "2022-09-20T06:06:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
{"id": "jdp9ujv", "text": "From the company's perspective, if all technical evaluations and HR are already done by \"outsiders\" (assuming they are very good at IT and HR) \n\nWhy does the company need her two employees (IT Manager, HR Manager) ? \n\nYou are a threat to their existence and ironically you want to partner with them", "timestamp": "2023-03-26T02:50:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Reality check on starting a software developer recruiting business.", "url": "https://www.reddit.com/r/recruiting/comments/xfshkz/reality_check_on_starting_a_software_developer/"}}
