{"id": "h9f1jo8", "text": "1. Match key words from the job description. A two page resume isn’t a problem for me.\n2. Never used this approach.\n3. This can vary. Sometimes applicant tracking systems will be used to see whose resume has the matched key words, sometimes the hiring manager will review and decide who gets screened, sometimes the recruiter decides. Sometimes only those who apply in the first few days will get looked at, and sometimes everyone gets looked at. Until the role is filled you still have a chance.\n4. Networking and/or a referral can make all the difference. Better to do that than not do it.\n5. If you are applying and not getting interviews it’s probably your resume that needs work. If you are getting interviews but no job offers it’s your interviewing skills that need work. Also, they might have wanted to hire you half the times you got rejected, so ask if you can stay connected with them through LinkedIn or reach out every few months because another job might open up or they might know of another opportunity somewhere else and put in a good word for you. Best of luck!", "timestamp": "2021-08-18T15:18:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fhldv", "text": "Sometimes I'm nervous when key word matching that it seems too cut and paste. What kind of key words are helpful, like hard or technical skills, years of experience in something, or are soft skills important too?", "timestamp": "2021-08-18T17:17:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fxh06", "text": "Technical and soft skills. These should all be located in the top third of your resume on the first page if possible.", "timestamp": "2021-08-18T19:15:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "ha5uo4g", "text": "Here is the latest version of my resume if you want to critique it :)  \n\n\n[https://www.reddit.com/r/resumes/comments/pansi2/round\\_3\\_please\\_review\\_seeking\\_operationsprogram/](https://www.reddit.com/r/resumes/comments/pansi2/round_3_please_review_seeking_operationsprogram/)", "timestamp": "2021-08-24T13:59:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9f2ryq", "text": "1. Make sure your resume is PDF, if not your formatting may get messed up once submitted. Try and take the time to tailor your resume to the job ads(I know its time consuming, at least do it with the jobs you really want), try and make sure you hit the minimum qualifications and those qualifications are listed in your resume. Also, make sure your resume is clean and easy to read. \n2. Make sure you include your resume, but dont write a whole essay. Say why you're interested in the role, why you like the company(do a bit of research), and if they think you are qualified, ask if they have a few minutes to chat about the role. \n3. Depends on the company/team. Usually, referrals are prioritized since a member of the company can back up that candidate but that doesn't mean you arent out of the running, as long as you are qualified. have a few minutes to chat about the role. \n4. Depends on the company/team. Usually referrals are prioritized since a member of the company can back up that candidate but that doesn't mean you arent out of the running, as long as you are qualified. \n5. If a company is asking for 1 year of experience, and you have 8 months of experience just round up to one year on the screener question as it will push you through to at least be seen.\n6. Also, Once you do get an interview, being personable and likable really does go a long way so try and fluff it up a bit, even if you have to fake it lol. \n\nDepends on the company/team. Usually, referrals are prioritized since a member of the company can back up that candidate but that doesn't mean you aren't out of the running, as long as you are qualified. have a few minutes to chat about the role.", "timestamp": "2021-08-18T15:27:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fhd9q", "text": "Augh I've heard mixed reviews on PDF vs .doc or .docx! At first I thought PDF always then I read something where Word is better unless PDF is specially asked for.", "timestamp": "2021-08-18T17:15:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fj6th", "text": "I guess it really just depends on the system they use, but I’ve never had problems with a PDF.", "timestamp": "2021-08-18T17:28:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9f8mdi", "text": "1. Proofread it.  Also, avoid redundant things - for a sales role, don't list that you did sales.  That's obvious and just a waste of space.  Ideally you should quantify what you've done - increased sales revenue by x %, was the top regional salesperson, etc.  Also try to get some buzz words in, especially matching what the job description is asking for.  \n2. Make sure the recruiter you're reaching out to is actually hiring for the role you want.  Too many times people reached out to me blindly for roles I had nothing to do with and I just didn't have the time to help them so I'd give them a generic \"I'm not familiar with that role, but if you apply on the website a recruiter will review your application.\" \n3. I worked for a large company that required a person screen every resume that met the basic requirements (no felonies, US citizen, above the age of 18), but I do not think this is true for most places.  Also a screen can still mean we rejected a lot of people before interviewing them for any number of reasons (I had a hiring manager that refused to hire anyone with a social work background so I eventually just stopped interviewing those candidates). \n4. It certainly can, but don't feel like you shouldn't apply to something just because you have no network connections to that job. \n5. Don't be discouraged, and try to be creative in your search terms to find job posts.  Sometimes a poorly worded post may not get many applicants because people aren't finding them.  For instance, instead of \"recruiter\" + industry I searched for \"recruiting\" + industry on LinkedIn and different jobs popped up.  You'd think a job board would be smarter than this, but you'd be mistaken.", "timestamp": "2021-08-18T16:11:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fitut", "text": "Thank you! I think in my resume I get too attached to certain achievements that may not be matching the best to the job.\n\nAlso are adding awards to a resume helpful or should I avoid? I've received an award at each role I have on my resume.", "timestamp": "2021-08-18T17:26:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fn0rk", "text": "I’d include the awards under the job itself if that’s the case", "timestamp": "2021-08-18T17:56:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fp5e9", "text": "Something like this?\n\n**Operations Manager, Company A**\n\n*Company A All Voices Matter Award Recipient*\n\n\n-achievement 1\n\n-achievement 2\n\n-etc", "timestamp": "2021-08-18T18:12:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fzwh2", "text": "Yes that seems great! Or you could say “I did x y z for the company and received ____ award dedicated to these accomplishments” either way!", "timestamp": "2021-08-18T19:33:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9j3yid", "text": "That's a good one! I received feedback before that instead of just writing I got X award include the WHY I got the award which I started doing too.", "timestamp": "2021-08-19T13:29:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fkbit", "text": "1.  I recommend using good information architecture and reading up on eye-tracking studies for resume screens.  When you're getting a screen (avg is 7-ish seconds) the eye follows an F-shape pattern.  Put the important key words where we know people will be looking.", "timestamp": "2021-08-18T17:37:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fpcv7", "text": "How do you feel about a Summary or Skills section at the top?\n\nFortunately my most fruitful experience is in my current position which is towards the top", "timestamp": "2021-08-18T18:14:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9ft2l4", "text": "I personally use a summary section in two ways.  First there's space below your name that can be utilized, e.g.:\n\nLine 1: NAME\n\nLine 2:  (large font, bold) acts as your overall bio where you put some keywords \n\nLine 3:  optional.  But I use it to add some contextual information if relevant to the hiring requirements.  it's almost like a Title :: Subtitle relationship with Line 2.\n\nex.  \\_\\_\\_\\_\\_\\_\n\nMIKE MCSCRUFF\n\n**PETCARE INDUSTRY PROJECT MANAGER OF SIX YEARS --- SIX SIGMA CERTIFIED --- BA in OPERATIONS**\n\n*Leading cross-functional projects using Agile, negotiating multi-stakeholder roadblocks and coaching in Agile across the organization*\n\n\\_\\_\\_\\_\n\nThen below the name/header space, I have a formal professional summary area.... just three bullets.  On every bullet I include almost like a subject line in bold matching their language\n\nEX.\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPROFESSIONAL SUMMARY:\n\n* **CROSS-FUNCTIONAL PROJECTS:**  blah blah blah, here's my best stat about these\n* **COACHING PROJECT MANAGEMENT:**  blah blah blah, trains seven idiots, blah blah\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAnyway.  This structure allows \"customizing\" to be pretty fast.  I just make changes to the bolded text on my resume.... and not really touch any actual content.", "timestamp": "2021-08-18T18:42:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9j43nq", "text": "Ahh love this. So you mostly tailor those sections and your bullet points under your work experience needs minimal editing?", "timestamp": "2021-08-19T13:30:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9j5lkx", "text": "Yup.  I don't really touch the bullets.  It's a waste of time.  Think the research suggests that MAYBE the first bullet under your top-listed job gets read..... but after that, it's just glazing over to \"see\" a few keywords.  No need to obsess over tailoring.\n\nI have maybe 20 words total on that page that I'm wiling to touch.  And it works like a charm.\n\nWhat I will say, is that I do test resume ideas using fake resumes I send out.  The text I put underneath my name definitely gets read because my response rate is really sensitive to it.  So be careful with the precise words you pick!  (My test from last week did not go well, haha.  The week prior was phenomenal... applied for jobs for one hour and landed six interviews.)", "timestamp": "2021-08-19T13:42:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9l7j47", "text": "Oh wow! I will definitely try that. I'm taking a bit of a mental break right now because it is... Draining lol", "timestamp": "2021-08-19T22:13:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "ha5v2f2", "text": "I hope the first bullet (and sub bullets lol) of my resume gets read because it's definitely my biggest project and accomplishment! Here's the latest version of my resume if you want to critique it  \nhttps://www.reddit.com/r/resumes/comments/pansi2/round\\_3\\_please\\_review\\_seeking\\_operationsprogram/", "timestamp": "2021-08-24T14:02:10Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9j1arg", "text": "Here is my perspective:\n\n**Resume:**\n\n* Keep it concise (could be 1-2 pages, no more than 3-5 bullet points for each role - and less detail for jobs that were 5+ years ago; also no need for a 'skills' section)\n* A summary can be helpful\n* Make sure that you include responsibilities *and* accomplishments/achievements in your job descriptions. A lot of people just put in their job descriptions and do not talk about anything that they actually did. \n\n**LinkedIn Messages:**\n\n* Make sure to clearly state whether you are reaching out about an open position or not and if you have applied, and if there is an opening make sure to include the Job ID or other details. (applicants for active roles take priority)\n* Apply before you reach out\n* Do not ask to set up a call - if you are viable, the recruiter will set it up. If you are not then it puts an obstacle between them providing you a potentially constructive response\n* Sending InMails can help, but if you are not a strong candidate they will not necessarily change your outcomes. \n* Keep it short/simple: \"I applied to your Software Engineer posting #12345 and wanted to reach out to let you know I am very interested in the role. Please let me know if you have any guidance that might help me to be successful in landing an interview there.\" \n\n**Popular Roles:**\n\n* How many candidates are interviewed? It depends.... in most cases at least 10-20 candidates are getting to a preliminary recruiter interview, but keep in mind that this could also include candidates who the company is actively trying to recruit along with their applicants. It is not unusual for early-career roles at large companies to get 500-1,000+ applicants, and those same companies are likely reaching out and trying to recruit certain candidates at the same time. \n\n**Networking / Referral:**\n\n* It helps a little bit to have someone providing a recommendation for you, but it does not change your qualifications. Recruiters generally look at more resumes than people believe and it is a misconception that \"the ATS rejected me\" or \"applying doesn't work\". Usually, it comes down to candidates not applying to the right roles or simply not having strong qualifications, versus \"getting seen\". (this also applies to the InMails) \n\n**Other:**\n\n* When you start searching I think it is important to consider not just the job description but also the type of talent you are competing with and how you stack up. I hear from a lot of candidates \"the posting says 2+ years of experience and a bachelor's degree, and I meet those qualifications so please give me a call\" but with highly sought-after roles it is not unusual for dozens or even hundreds of candidates to check the boxes for the basic qualifications so recruiters will dial-in on the quality of experience/education, and many other factors. \n* It is sometimes helpful to look at where people who have worked at your company exited to, or individuals who have similar education if you are early career (same school/degree) to give you an idea of potential target roles/employers. This doesn't mean you do not apply for stretch roles or dream jobs, but it helps to balance those applications with options that are more likely to be viable. \n* There is a certain degree of luck when it comes to finding an opportunity, and you can increase those odds with consistent activity, networking, etc. - but it is important to remain strategic otherwise you can burn yourself out applying for roles and not getting traction. \n* Consider the 'go for no' approach. Open yourself up for rejection and ask for feedback/guidance - recruiters are human and no one likes rejecting people so a lot of times if you are reaching out directly and you are not good they just give a vague response or do not reply. If you say *\"it has been a couple of weeks so I assume that you are moving forward with other candidates - can you give me any tips on different roles or companies that might be a good fit for my qualifications?\"* \\- a lot of recruiters will help if you take this approach.", "timestamp": "2021-08-19T13:07:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9j3ro1", "text": "Thank you for the thorough reply! \n\nI think what it is coming down to is I am not showing my value enough in my resume and need to make it more relatable to the job description - but with high competition out there, I really should show even MORE value/achievements to get to that first stage.\n\nI'm currently a Manager in the Education Technology/Higher Education industry, within the Operations/Records Management department. I was a little surprised that I got rejected from a \"Records Management Operations Program Manager\" role lol but it was for a Tech company. A lot of my peers have moved to other Higher Education places, but I would love to branch out to software/tech.   \n\n\nAlso, if anyone is willing to look at my resume and critique for feedback - that would be helpful :)", "timestamp": "2021-08-19T13:27:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9f24gx", "text": "1. Keep it simple.  DO NOT USE FANCY FORMATTING.  The ATS is going to upload and parse it.\n2. Pretty much useless.  You have no idea what Recruiter is assigned to what role and if that Recruiter is working that role at that time.\n3. Varies on the company.  I start with oldest applications and move forward until the role is filled or my schedule is booked for 2 weeks.  \n4. No.  Referrals mean nothing.  Literally nothing.\n5. Don't get sold on one job.  Go for shotgun rather than laser.  Its a numbers game and you'll land a better job by applying to a lot of good jobs.", "timestamp": "2021-08-18T15:22:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fiy2u", "text": "For #3, would you say applying early may increase chances given the applicant has a decent resume and is qualified?", "timestamp": "2021-08-18T17:27:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fjt2c", "text": "This is going to vary wildly depending on the role, the recruiter, and the amount of candidates.  I normally start with the oldest applications, so no.  I don't even look at your resume until I've worked through the ones that applied before you.", "timestamp": "2021-08-18T17:33:24Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fp2aq", "text": "So much of what you asked depends on whether you are applying via a staffing agency or directly to the company. In my experience (regardless of agency or in house) all resumes get screened-up to a point. Once I have my initial batch of candidates who are moving through the process, I stop screening new applications. Unless the initial candidates are unsuccessful, I don’t go back and look for new candidates. So applying as soon as the job is posted is important. We leave the job posting up until someone starts, so it can appear misleading. I personally could care less about cover letters, so I wouldn’t spend a ton of time on them, other than popping in the company, title, and a few key words. It can be helpful to have a couple different versions of your resume that highlight different skill sets depending on what you’re applying for. I reply to 99% of my LinkedIn emails, but I know that’s not always the case. I see no problem with emailing directly after you’ve applied. It doesn’t make you right for the job, but it may get your application reviewed. \n\nAgency recruiters have a much higher bar than internal, in my experience. Agencies get paid, on average, 20% of your salary and are most often utilized for hard to find roles. So I wouldn’t bother applying to agency roles unless you are an exact match. There’s a bit more leeway with direct applications.\n\nNetworking is important to a certain extent. My last three jobs I have gotten via LinkedIn and they reached out to me. I have 1,000’s of LinkedIn connections in my industry and spent a lot of time building my profile. I know this isn’t the case for every industry/job profile, but spending some time connecting with people at companies you want to work for, and connecting with recruiters is always a good idea.", "timestamp": "2021-08-18T18:12:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
{"id": "h9fptpc", "text": "I apply directly with company and mainly use LinkedIn to find job postings, so I've also used the Easy apply option. I like the format and the algorithm shows me jobs I'm genuinely interested in (but also high competition)", "timestamp": "2021-08-18T18:17:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Recruiters of Reddit: Some friendly questions from a job-seeking candidate!", "url": "https://www.reddit.com/r/recruiting/comments/p6sgtx/recruiters_of_reddit_some_friendly_questions_from/"}}
