{"id": "n0zqzyq", "text": "Agency vs. In-House, it's all the same.  This is the job.  I've known many great recruiters over the years who have gotten out of the game for the same reasons you mentioned here.  Don't let the game get you down and make you believe you aren't a good recruiter.  You could be the best recruiter in the world and still feel this way.\n\nIf you want to leave recruiting, more power to you.  There's no judgement here. I've considered moving to a new field many times myself.  Just know that the candidates don't determine our value.  There are good candidates and bad candidates.  Good hiring managers and bad hiring managers.  At the end of the day, we need to control what we can and let the rest fade away.  It's a tough job and if it's not for you anymore, know that your value isn't in any way diminished by this decision.  In fact, leaving when you know it's your time to go means to me that you were likely one of the good ones. Only someone who truly cared about the work would post what you've posted here.  And that means a lot.", "timestamp": "2025-07-02T19:00:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n19ybtp", "text": "I did not expect this heartfelt and human response.\n\nCame to this thread expecting a load of 1st or 2nd year recruitment chads being like 'Get gud', 'Man up' or 'gud, give me all your candidates and clients then lolz'\n\n\nYes I've been in recruitment over 10 years and yes I don't like the new generation of recruiters 😂", "timestamp": "2025-07-04T08:56:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n2o86ce", "text": "Hum.. personally I’ve felt a big difference between agency and in house in the state of Texas. Agency was a complete nightmare, offering jobs that made minimum wage and still required some experience.. making people drive/take the bus to come in and apply just so we have numbers, even if we don’t have actual jobs. Absolute soul crushing! On the other hand, in house where I am at has short interview processes, the only thing that sucks is pay offered. Nevertheless, this job sucks in this economy, feels like no hope, just a big hole.  ", "timestamp": "2025-07-12T03:54:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n3o4oal", "text": "100%. I worked Agency for a very brief period of time, and it felt super exploitative/grimy. In house has been much better. I've worked for one tricky firm for about 18 months that struggled in talent acquisition because their culture was too old school, but the rest have been really pleasant jobs with great pay and benefits. I get no greater joy than offering folks a job that is a dream for them.\n\nI also learned I'm not a big corporate boy; I prefer mid-sized privately owned companies. They don't lay off a good recruiter as soon as they have a hiring slow down, whereas corporate politics make us the first to go in uncertain times.", "timestamp": "2025-07-17T17:44:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1054uj", "text": "I’ve found that full transparency is the best way to handle candidates. Manager taking too long? Tell them. Team feels we can’t hit their comp range? Be honest with them and don’t waste their time….works for the most part, a though you’ll always have problem candidates and problem mangers/teams…", "timestamp": "2025-07-02T20:11:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1634ki", "text": "I had a candidate ask in the middle of an interview if the position was real, because they heard of fake jobs. Mind you, we’re a Fortune 500 corporation. Transparency can’t help these out of control candidates. God speed to the OP try transitioning into Talent Management or Recruiting Analytics.", "timestamp": "2025-07-03T18:09:40Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1smona", "text": "That candidate spent too much time on recruiting hell lol. What an idiot.", "timestamp": "2025-07-07T12:13:12Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25tc30", "text": "How do you segway into Recruiting analytics?", "timestamp": "2025-07-09T12:07:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n2o8khb", "text": "Idk about you, but scales are crazy, and huge companies have jobs that are almost filled still opened, jobs that don’t have the budget or most likely won’t get hired for. In my opinion that’s a scam nevertheless. Waisting peoples time, when they are struggling to make ends meet. This com a TA specialist. ", "timestamp": "2025-07-12T03:57:36Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1xq2pp", "text": "imagine that!", "timestamp": "2025-07-08T05:18:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n5ubyfi", "text": "100% agree, this helps you take the stress off. I share everything as long as I don't break the rules. And I'd say 99% of my candidates appreciate that, even if I ran into a \"bad candidate\" they would behave when you are being honest.", "timestamp": "2025-07-29T18:49:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n10gbow", "text": "My transparency would still make me a bad recruiter. “Sorry, I clicked on your email, then someone called me. And I thought I clicked it unread so I could come back to it but I didn’t. And then I went on with 10 other candidates and forgot to circle back to you because I’ve already reached out to 50 people for this role and can’t remember everyone’s name to not have anyone slip through the cracks.” \n\nI was saying the other day how I can’t do cold calls because it throws my day off and even then another recruiter here was telling me I’m just bad at it. So oh well. I give up.", "timestamp": "2025-07-02T21:05:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n12fbu3", "text": "This is an issue of time management- this is fixable. Candidate attitudes are not.", "timestamp": "2025-07-03T03:42:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25t3uu", "text": "You’re a corporate recruiter and you have to make cold calls? I quit that shit when I went in-house several years ago. I would try not to take it seriously, but sounds like you need a break from the crazy job seekers, I get it.", "timestamp": "2025-07-09T12:06:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25wmnd", "text": "That was just a comment from another redditor. I can’t do cold calls. I mostly don’t answer cold calls either unless someone sends an email or voicemail. Sometimes I get calls from candidates just interested in roles they’re no fit for and they want to talk talk talk. Not sure how they get my number. \n\nI need a break from everything.", "timestamp": "2025-07-09T12:27:39Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25xbpa", "text": "I guess I’m lucky. I’m in a setting where candidates apply and I schedule screenings then send over to the HM. I removed my mobile number from LinkedIn and email my signature and don’t answer or return any candidate calls when they very occasionally happen. I conduct screenings by Teams only unless we’re having technical difficulties. I tell candidates that email is the best way to reach me with any questions or follow-up (not LinkedIn or my mobile). I get paid shit compared to my cold calling sales recruiting days, but I have my sanity and don’t mind my HMs or candidates for the most part.", "timestamp": "2025-07-09T12:31:48Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n2634hx", "text": "You operate exactly how I operate!! But most recruiters here feel that’s wrong. And the candidates want all our time!", "timestamp": "2025-07-09T13:04:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n264tf2", "text": "Nope and nope. I have streamlined the process and so far it’s working. Candidates and hiring managers seem to like me (for the most part) and I’m keeping my sanity! I always end my screening calls with some recruiting 101 advice on best practices on key words as it relates to the JD and signing up on job website and importance of being an early applicant, also explain the interview time line so they don’t stalk me every day :) TBH if I was making the $ I used to make, I would expect a higher candidate touch, but this is working. I had to learn how to establish boundaries which took time.", "timestamp": "2025-07-09T13:14:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n12f0c0", "text": "I totally understand how you’re feeling, and can commiserate if you want, or try to offer advice if you want something actionable! Good recruiters often have ATS systems and company policies which do not help the candidate experience- it’s bigger than just you.", "timestamp": "2025-07-03T03:39:51Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n0zr9ue", "text": "You are spot on. Candidates get mad if you email, text, call, respond too slow or too fast, reject with an email or a phone call, give them feedback or don’t give them feedback. You can’t please everybody.", "timestamp": "2025-07-02T19:01:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n11o17s", "text": "Recruiting isn’t the same animal it was 10 years ago. It’s trendy to be annoyed by things, and people are wayyy too dramatic these days. \n\nYou can only take it one phone call, one email, one candidate, one manager at a time.", "timestamp": "2025-07-03T00:58:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n5syzn3", "text": "\"It’s trendy to be annoyed by things, and people are wayyy too dramatic these days.\"\n\nI haven't seen it said this way, so accurate. And here's why: social media.  yes, we all know if it's free,\"we are the product\". But think about what you are required/asked/motivated to so. Offer your opinion. Constantly. Whether someone asked for it, or not. Whether someone wants it, or not.  And what is most easy to give? Criticism. And you do it ten thousand times over a year, guess what neural pathways get strong and reinforced? Seeing what's wrong with everything, all the time. Are you going to go around and burp up sunshine ALL the time? No. The system encourages disagreement, bickering, one-upsmanship, \"calling out\", teaching \"lessons\", saying \"what for, and how come\".   And you take these new skills and apply it to the real business world in, as u/treaquin said, dramatic fashion.", "timestamp": "2025-07-29T15:03:30Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n5t54ts", "text": "You could get me going on this particular topic. Whether it’s clickbait news articles, “influencers,” reaction videos, or anything my boomer parents are posting on Facebook, it’s a struggle to find neutral, objective information. It does speak to US culture where everyone is entitled to their opinion, and that someone is entitled to post it online for all to hear. (Spoiler alert- you don’t have to post anything at all!)", "timestamp": "2025-07-29T15:32:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n5yuke4", "text": "I dont think it's culture -- I mean -- yes, it became this culture -- but I think the seeds of behavior, whether bad or good, are contained in us all when born -- it's the lubricant/enabler I have a problem with-- social media creates a stage for people who have no training in presenting or acting or logic or manners-- they just are presented with this neurologically addictive tool (designed that was by executives who dont let their own kids anywhere near their own product for these reasons) that brings out the worst in people, bit by bit.  And now, 10-15 years later we are all hitting each other over the head and eagerly climbing over each other's broken down bodies and souls to be \"better\" (worse), be faster, be more right, be more righteous. And all the oxygen is taken from kindness, humility, and true connection (offline!!!!)  lol", "timestamp": "2025-07-30T12:31:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n13sprp", "text": "God yeah, it’s like being stuck between pissed-off candidates and ghosting hiring managers, with zero control on either side. Everyone thinks we’re just chilling behind a dashboard but it’s nonstop chaos and you can’t win. The second I hear “any updates?” I’m already mentally in a different career.", "timestamp": "2025-07-03T10:53:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1116uj", "text": "My only solution to this has been to take vacations, stress management to avoid burnout, and a thicker skin. Sounds like burnout to me. I’d take some PTO and take a break. You can’t please everyone and need to be selfish sometimes.", "timestamp": "2025-07-02T22:54:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n17ax7d", "text": "You need to listen to the Mel Robbin’s podcast Let them theory it’s about shifting your mindset and not worrying so much about others behaviors it’s amazing to listen to and may help you. People today are entitled, rude, very impatient and all that so no matter what job you do you will face this so shift your thinking it will help uou heaps and good luck!!", "timestamp": "2025-07-03T21:47:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1231ws", "text": "Sounds like maybe you need a better system of organization? I have a tracker of all my candidates interviewing and it’s color coded so I know who to follow up with etc. I also have a tracker for all my roles with notes on pregress etc along with different tabs I can move them to when the role is closed which prompts a checklist including “reject all candidates in req” etc.\n\nMaybe ask some of your fellows recruiters how they stay organized so you can minimize things falling through the cracks?\n\nBut yea some people are just difficult and that’s ok too if it’s not for you! Try TA Ops or People Ops or Resource Management?", "timestamp": "2025-07-03T02:22:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n12bann", "text": "Definitely trying to get in Ops and just take the paycut.", "timestamp": "2025-07-03T03:14:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1figpw", "text": "Your tracker system sounds so good. Do you have any tips on how to set that up? I'm going to be a new recruiter and I'm quite nervous!", "timestamp": "2025-07-05T06:20:31Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1ta9bi", "text": "DM your email and I’ll send you a template! It’s company specific though so you will probably want to change some things around", "timestamp": "2025-07-07T14:29:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n2cf2gw", "text": "I've messaged! Sorry about the silly email. It's the one I use for non work stuff", "timestamp": "2025-07-10T11:23:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n13xd8c", "text": "Sounds like your company needs to hire an additional recruiter as you seem overwhelmed.\n\nI'm agency and my issue isn't nearly with the candidates as much as it is with slow response from hiring managers.  I feel awful for the candidates.  Many are unemployed and need work.  Their hopes are high when they get interviews and then crickets from the clients because they are busy, or are rethinking the job, or whatever.\n\nCould part of your issues be resolved with process improvements?  Can you finish your email before picking up the phone?  It sounds like you are juggling a lot and are bouncing from one thing to the next and then losing track?", "timestamp": "2025-07-03T11:29:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n3o5alk", "text": "In house here. I think the hiring managers ghosting or being really slow has to do with the cost of an agency hire. Anytime we hire through an agency, we think extremely carefully about it before we hire. There is nothing worse than losing $40,000 for a candidate that quits in 90 days.", "timestamp": "2025-07-17T17:46:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n3qijz1", "text": "I think the company should think extremely carefully before they decide to bring on an agency then.  If there isn't budget or the ability to professionally handle the interview process, then they should not be engaging with external recruiters.  You stated the financial cost that happens to a company that pays for a hire that doesn't work out.  Well agencies also get hurt when clients don't respond after interviews or after saying they want to talk to a candidate.  All agencies have is our name, and if the clients we represent don't treat our candidates fairly, then it hurts our reputation immensely.", "timestamp": "2025-07-18T01:02:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n3tt81f", "text": "Well, the problem lies in agency marketing strategies. They get in touch with a hiring manager with \"the perfect candidate.\" This in itself wouldn't be a problem, but most places that I've worked, the hiring manager has no control over the budget for the role, and especially no say in whether we pay a recruiting fee or not. So, we have a hiring manager that wants to hire a unicorn and an agency saying they have that person. Usually, I then need to get on a call with the agency and find out about them, negotiate a rate that isn't absolutely insane (see 30% of first year annual salary, lol), and then we get the candidate in for an interview and the bulk of the time the candidate is no better than any candidate that we've already interviewed organically. Then, we have the agency calling every 2 hours for feedback and pushing us to make an offer. This is where the ghosting, lack of feedback, etc., happens. It then becomes a long discussion between the people who control the purse strings, the hiring manager, the HR team, and maybe some other folks as well who think \"we shouldn't spend $40,000 on one hire.\" Then, the internal team has the onus of trying to convince (if we think it's a strong hire) the team to come off the $40k. This isn't easy. Also, sometimes the team wants to wait and see if the internal team can find someone better for a $0 placement fee. \n\nSo, while I agree with you that companies should be very deliberate when engaging with agencies, we literally get solicited non-stop every single day. I just got in this morning, and my inbox already has 2 agencies saying \"We have the perfect candidate!\" These will trickle through all day to all levels of our company. We all just become numb to the constant solicitation, sometimes grabbing someone's attention, but we also try really hard to avoid using agencies to hire because it's expensive and usually doesn't net us a better result. \n\nWhere agencies come in clutch is when a hiring manager screws up and pisses off a key employee that NEEDS to be replaced immediately. There are very few of these people in any given company. I have a few agencies that I know well and can place someone in a few days. These are agencies that I've worked with for years that I know are good. I've rarely had a new agency step in and fill something quickly - so mostly the solicitations are just an annoyance.", "timestamp": "2025-07-18T15:00:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1024bh", "text": "Who cares if they get mad? Agency here.", "timestamp": "2025-07-02T19:56:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n10dt54", "text": "My manager!", "timestamp": "2025-07-02T20:52:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n111poj", "text": "They might not be a great manager.", "timestamp": "2025-07-02T22:57:24Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n11c4id", "text": "Anyone would care. I don’t want negative reviews.", "timestamp": "2025-07-02T23:54:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n12cex6", "text": "We’ve all had em? Some people just get mad.", "timestamp": "2025-07-03T03:22:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n122tno", "text": "Yeah idgaf. Not my job to make them feel good, job is to help clients fill jobs. Don’t be a dick obviously but who cares if they’re mad? Not my problem. ", "timestamp": "2025-07-03T02:20:45Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1x5ppa", "text": "Exactly. This is the strangest thread. Candidates aren’t people, they’re our product. I don’t care if a widget is mad, sad, upset or happy.", "timestamp": "2025-07-08T02:53:55Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25tufv", "text": "They are a corporate recruiter, you are talking agency. Very different animals", "timestamp": "2025-07-09T12:10:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1171c9", "text": "Hi\n\nWould like some insights into recruiting.  Got an opportunity to do it. Would like to learn few things about it. Thanks", "timestamp": "2025-07-02T23:26:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n13zmdh", "text": "i was in house at a company for over a decade. they brought in a new manager and all of a sudden my work is not good enough. nothing i ever did was fast enough. they would never believe that I called and emailed candidates and they would not get back to me. candidates lie and somehow it would end up being my fault. i quit that job and cant bring myself to think about getting back into recruiting. it really can be terrible.", "timestamp": "2025-07-03T11:45:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n14pn07", "text": "It’s really dependent on company. I didn’t have half of the problems I have now at my previous company. But I do think the industry overall is crap too!", "timestamp": "2025-07-03T14:16:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n15l8nf", "text": "My friend, give up, find a better career for you.. You obviously have solid soft skills.  It takes a very short memory, near daily amnesia, to do a recruiting role.  Recruiters get beaten up by hiring managers and candidates in stereo.  Additionally, executive leaders throw recruiting under the bus to  account for missed goals.  \n\nThis profession IS NOT for everyone, but the bar to entry has been low.  The industry is evolving, it has to.  \n\nI have seen many successful transitions into CS/AM, sales, HR, Project Management.  You have options!", "timestamp": "2025-07-03T16:46:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25ujy6", "text": "If you’re a recruiter, you should know that the job market blows! You really think you can just go transition into a PM role magically? I’ll have what you’re smoking then.", "timestamp": "2025-07-09T12:15:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n18pgls", "text": "Even with full transparency,  it seems people will people and not stay, ask for different shifts, etc. I keep all receipts.", "timestamp": "2025-07-04T02:49:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n0zocip", "text": "Sounds like agency and that’s why I got out. Just know it’s not like that everywhere! The grass can be greener.", "timestamp": "2025-07-02T18:47:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n0zp2mu", "text": "I’m a corporate recruiter. I might be exaggerating when I say hundreds but I will say even keeping up with 20 candidates can be difficult when you’re doing everything manually. So I guess I’m really just a crappy recruiter. I can’t do it anymore.", "timestamp": "2025-07-02T18:50:59Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n10339f", "text": "What’s your YOE and do you feel you’ve had proper training over the years?", "timestamp": "2025-07-02T20:01:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n10dnrk", "text": "Honestly it’s just because I think I’m a crappy worker period. I may miss an email. (This has only happened twice.) or I may forget to go in and manually email everyone that a position has closed (this happened in the beginning because I didn’t know our system didn’t send it automatically, no one told me but now I know) or maybe I didn’t do it soon enough and they saw someone was hired… but for any of these mistakes we don’t get grace. \n\nOr for example I told someone that we couldn’t train in a system I needed for a hire. Word politics deemed it was wrong for me to say that and that person went ballistic too. \n\nThere’s a candidate in our inbox telling my manager how terrible a recruiter I am too often. I’m ready to just get fired. \n\n7 years of experience I’ve had plenty of formal and informal “industry” training. I think I’m just tired of putting on the perfect act. \n\nI really need an admin type job that requires less human interaction, less people thinking I have to be perfect with every word and respond right away to every action, which is why I’m ready to take the paycut.", "timestamp": "2025-07-02T20:52:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25v0l5", "text": "I think you’re burned out in customer service role and need a break", "timestamp": "2025-07-09T12:17:56Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n10him5", "text": "Understood! Not here to try and tell you to keep pushing. If it’s time, it’s time 🤷🏽‍♂️", "timestamp": "2025-07-02T21:10:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n10em0s", "text": "Recruiting is a science and art. I’m tired of the art part of it.", "timestamp": "2025-07-02T20:56:47Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n13m0c8", "text": "It's simple, unless you automate; you will keep running on the hamster's wheel.\n\n\nFew easy fixes: \n\n1) increase transparency: highlight your process upfront with usual times needed to follow through\n\n2) automate, with personalization. Leverage AI to integrating client feedback with sanitized inputs\n\n3) understand who pays the bill: your client pays, so you will remain professional and cheerful with candidates, but at the end of day they don't pay the bill.", "timestamp": "2025-07-03T09:55:21Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1fawpg", "text": "As someone from the other side, Let me tell you: More people appreciate recruiters like you that are here working for us (and for yourselves as well). Goes to show that almost everyone that is not a stakeholder is feeling frustrated. The one thing that might help is a defined set of \"next steps\". For example, when you talk about the automated email, even I agree that it is not always the norm. But a follow-up for when someone asks (and even an estimated time for us to hit you with that follow-up. We don't want to bother recruiters that are working and letting the ops flow forward.) The frustration is mostly about \"Should I invest more time or should I move on?\"\n\n  \nGL;HF. And this is not the end of the world. You are still valid. (◕ᴗ◕✿)", "timestamp": "2025-07-05T05:11:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n126mrk", "text": "What do you typically recruit for? Types of roles? Are you agency or corporate?", "timestamp": "2025-07-03T02:44:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n12bjtr", "text": "All types of corporate. Which has been a doozy too because each role I get takes an extra week or so to fully learn the profile and build a pipeline. Thankfully my time to fill is great though. It’s the customer service part I hate and am tired of.", "timestamp": "2025-07-03T03:16:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n12s333", "text": "Read a book called Radical Candor. Its hard but people just respect straight-talking updates. If they are not right, tell them, if you don't have an update, tell them. It helped me", "timestamp": "2025-07-03T05:16:50Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1s8wzh", "text": "Recruiting burns people out fast when you're stuck doing everything manually. Tighten  your process and perhaps get support with sourcing and screening so your team wouldn't be chasing every candidate yourselves. From experience, focusing on quality over volume made things much more manageable. It's not always about grinding harder.", "timestamp": "2025-07-07T10:25:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1wespn", "text": "What kind of automations would you prefer you had?", "timestamp": "2025-07-08T00:18:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1zn37a", "text": "I am currently trying to use bookings for screenings scheduling to cut down some of the back and forth. \n\nI would love automations for hiring manager review so I can stop taking time to send submittal emails like we’re in the early 2000s. \n\nWould love a ATS I can keep notes in. And more easily filter candidate step. \n\nWould love for candidates to be able to see the step they are in when they log into the profile. (If they are in HM review or being moved to scheduling interviewing or whatever). Even all of our interviewing in manual. The system sends nothing!", "timestamp": "2025-07-08T14:18:18Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n25kncg", "text": "Oh alright.\n\n\nBtw what do you mean by \"easily filter candidate step\"? I think all ATS allow you to do that. How are you doing it right now?", "timestamp": "2025-07-09T11:10:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n23vkuc", "text": "I'm the founder of an AI Interviewer AND I face this issue. At the end of the day recruitment is still a people job and people want everything done FAST", "timestamp": "2025-07-09T02:52:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n264v33", "text": "This is so interesting to me. I’m sorry OP. Man, I have loved the 2 recruiters I’ve utilized! They both really believed in me and my abilities. One didn’t get me the job but I know they advocated for me. The other did get me a great job and was pleasant to work with. I appreciate the work y’all do.", "timestamp": "2025-07-09T13:14:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n29evyq", "text": "I feel your pain ... in my (small) company we started using [msts.ai](https://msts.ai/?d=1) (use Rescruiters view on top), they have a quick vid explaining how their platform works - [https://www.youtube.com/watch?v=U8IklkgEHlI](https://www.youtube.com/watch?v=U8IklkgEHlI) you might find it useful. They are a startup so if you are looking for something specific for the platform they might look into it (as they did for us). cheers!", "timestamp": "2025-07-09T22:27:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n11ad9w", "text": "You may want to look into project management jobs. I attended a company meeting where we discussed the PMBOK and the facilitator said that alot of the work we do as recruiters is in alignment with the skills of a project manager. \n\nIts somewhat admin related using tools like JIRA and other pm software to update tasks and timelines while also working with people on a team or external stakeholders. \n\nI have thought about moving from recruiting to that. Im more of a strategic thinking and recruiting is just way more tactical, day to day without really looking at the long term picture of a finished product. \n\nAlso it pisses me off when I have a consultant in my payroll that gets effected by a layoff and they've been doing a great job. The compensation at my company is mainly commission so there's way too much at risk funds to make it viable for me anymore. Some people I know are younger than me and making great money, get out to for promotion and im over here like for what? Because they made the company more money? So much of it is luck and im sick of it.", "timestamp": "2025-07-02T23:44:52Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n11dxbo", "text": "I’m not sure where everyone is getting that we can get PM jobs? Every PM I’ve ever hired for the hiring manager would only look at those with the experience already. Especially considering many are laid off right now.", "timestamp": "2025-07-03T00:03:58Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1cx254", "text": "Stakeholders management is a big part of recruiting. Managing the timelines of deliverables like resume and reference checks is another. There are many cross relatable tasks and duties we do as recruiters that are similar to PM and Project Coordinators.", "timestamp": "2025-07-04T19:39:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n174l7m", "text": "I mean, you are just not cut out for it. And that’s fine.", "timestamp": "2025-07-03T21:14:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n148skz", "text": "lol we give up on you. Hounding us to apply just to give the company a second look to feel good about their number one or getting 3 interviews in to just ghost us? Lie about comp when we can make 20% without using a recruiter? Constant AI messages on LinkedIn or hiring for jobs already closed? Give me a break. 10-20k per placement to cry about someone asking for a call back in under a week! Wait till you get a real job.", "timestamp": "2025-07-03T12:44:28Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n14ooqh", "text": "I work for one company, I don’t get any commission, I don’t use AI in my messages because it makes it way too long. Anything else?", "timestamp": "2025-07-03T14:11:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n14p3g5", "text": "It’s all the same. You are internal now, but in one or two years you’ll be external complaining about resumes you see with job hopping. Don’t come and complain to job seekers about this stuff. Takes us 1000s of applications just to deal with a recruiter with no power and very little follow though.", "timestamp": "2025-07-03T14:13:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1bgnyt", "text": "How long have you been recruiting?", "timestamp": "2025-07-04T15:09:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1iu5xr", "text": "10-20k per placement??? 😂\nMost agencies charge anywhere between 12-20% of the candidates first year’s salary. The recruiter gets literally SLITHERS of that money only when the placement was successful and the client has paid for services (if they are able to get commission). \nAlso, feel free to bear in mind that this not “real job” has unpaid overtime and each placement typically goes through two or three interviews and in most cases takes over a month to get to the offer stage. \nI hate to break it to you but it’s a fucking hard job. You’re constantly calling candidates, constantly getting rejected, constantly chasing up candidates and clients to speed up the process, only to maybe get a couple hundred quid after at least two months from working none stop. \n\nStop trying to rage bait and complain about something you clearly have no idea about. It’s embarrassing.", "timestamp": "2025-07-05T20:02:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n14fe0c", "text": "Btw, what's the new deal with recruiters offering to chat on the phone after being rejected ??? Will they really call you, or is that just the new \"we will keep you in our database\".", "timestamp": "2025-07-03T13:22:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1fdfas", "text": "keep you in the database - sorry", "timestamp": "2025-07-05T05:34:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1kuaqs", "text": "Wow- has this happened to you a bunch? I've only had this one and I 100% called them for answers.", "timestamp": "2025-07-06T03:33:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n1g31kt", "text": "I mistakenly browsed /r/recruiting instead of /r/recruitinghell like usual. What a trip.", "timestamp": "2025-07-05T09:48:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
{"id": "n36k663", "text": "&gt; with little to no automation\n\nI'm a poor recruiter and my no-good manager is forcing me to recruit people... This is literally torture!!!!", "timestamp": "2025-07-15T01:09:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "I give up on recruiting.", "url": "https://www.reddit.com/r/recruiting/comments/1lq373n/i_give_up_on_recruiting/"}}
