{"id": "kp209cd", "text": "Not worried about it at all - I like to use the tools to help me recruit. I edit my communication, pd’s, I write presentations. If you want it to write Boolean strings for you it can. I just use it to increase and improve my work", "timestamp": "2024-02-05T18:00:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp20gp6", "text": "I mean sure, that’s current state. But I’m talking 10 years from now.", "timestamp": "2024-02-05T18:02:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp2123z", "text": "I am not worried about the job market 10 years from now \n\nBank everything you can and remain agile \n\nI’m not going to be working in 10 years anyway", "timestamp": "2024-02-05T18:05:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp22i2g", "text": "When I started recruiting 15 years ago I used to see the same articles talking about how AI is going to take over recruiter/HR jobs. Lots of fear mongering. It’s been 15 years and the recruitment industry is still alive and I’m still employed. \n\nHaven’t seen AI take over any recruiter jobs yet. Of course, it may happen one day, but that day won’t be anytime soon.", "timestamp": "2024-02-05T18:13:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp30ned", "text": "wouldn’t be too sure, companies are actually implementing AI tools and automations into their recruitment processes now. at a scale that hasn’t been seen before.", "timestamp": "2024-02-05T21:23:44Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp31mgh", "text": "What AI tools are they using? Haven’t personally experienced this, sounds like bs.", "timestamp": "2024-02-05T21:29:09Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp33p5z", "text": "resume screening software like HireVue, Ideal, Textio. Predictive analytics tools like PredictiveHire and Pymetrics. Sourcing tools like Entelo and seekout. video interviewing platforms like spark hire, vidcruiter. skill assessment platforms like hackerrank and vervoe. D&amp;I tools like blendoor and talvista. chatbots like mya and xor. ATS’ with AI features like lever and greenhouse have been testing. \n\nthese aren’t perfect, end all be all, but they’re constantly being improved and implemented by companies to cut TA costs. there’s also more companies entering this space, so competition is increasing.", "timestamp": "2024-02-05T21:40:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp346zt", "text": "Ok but none of those AI tools have completely replaced recruiter jobs. They’re just add ons and features.", "timestamp": "2024-02-05T21:43:26Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp34ord", "text": "1 recruiter can do the job of 5-10 now with these tools, that’s the point i’m trying to make. ofc recruiters aren’t obsolete, but companies don’t need to employ nearly as many today. \n\nyou originally said “haven’t seen AI take over *any* recruiter jobs yet” … which isn’t entirely true since these tools have replaced the need to have so many on a team.", "timestamp": "2024-02-05T21:46:13Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp34zbv", "text": "I disagree, but I don’t think we are going to change each other’s minds. I don’t think a recruiter can do the job of 5-10 recruiters just with a few AI add ons. Most companies aren’t using those AI tools.", "timestamp": "2024-02-05T21:47:54Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp36o8i", "text": "&gt; Most companies aren’t using those AI tools. \n\ninterested to see a source on this, i don’t think these companies would be in business if nobody was using their services.", "timestamp": "2024-02-05T21:57:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp37c2g", "text": "Just curious, are you a recruiter? I’ve recruited for various large, small, and mid size companies, not one used any AI tools. I’m sure they exist, I’m sure some companies use them, but I’ve just never personally seen it. Most companies have very limited recruitment budgets, and we have to beg for a simple LinkedIn recruiter license. I don’t think many companies are spending lots of money on AI tools, especially in this market.", "timestamp": "2024-02-05T22:01:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp3afoc", "text": "I am, seems like you’re using anecdotal experiences and trying to pass them off as facts. i’m not denying your experiences, but they certainly don’t represent every company like you’re implying. limited budgets are even more of a reason to invest in AI tools, since it’s a lot cheaper than employing several recruiters.", "timestamp": "2024-02-05T22:19:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp4zwks", "text": "As a recruiter, what field of tech do you focus on? Unless you’re involved with some of the bleeding edge of these advancements, how would you know what’s coming down the pipeline?\n\nFact is, the rate of change in this tech is astounding, and it’s in everyone’s best interest here to try to stay on top of the latest tech advancements that can *supplement* their recruiting abilities.", "timestamp": "2024-02-06T05:07:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp5zayq", "text": "I’m not in the tech industry.", "timestamp": "2024-02-06T11:52:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp61woi", "text": "This might be why you’re not seeing it. I recruit engineers in tech, specifically ML, Data engineers, data scientists, ML Ops, NLP, so my insight is different than yours. \n\nThere’s a swell forming and the tidal wave is on its way. This subreddit isn’t the best place to get info on the direction of this tech, but there’s hundreds of really good subreddits that will give you further insight. \n\nIt’s not there yet where recruiters are replaced, I’m not suggesting that, but the rate of change is coming in hot… so be ready for it.", "timestamp": "2024-02-06T12:18:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp63mjb", "text": "Just curious, do you work for an agency?", "timestamp": "2024-02-06T12:34:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp6icjw", "text": "Sure do", "timestamp": "2024-02-06T14:26:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp6j3w4", "text": "I think that’s the disconnect. Agencies are the ones using these features. The companies with internal recruitment teams are not.", "timestamp": "2024-02-06T14:31:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp6l9ps", "text": "But I never once talked about any features for recruitment per se. My comment was more in general terms about AI and its impact on every industry. The engineers I recruit are internal somewhere, and then they’re placed as internal candidates at another company eventually. \n\nAnyways the point I was trying to make was that I hear about the fascinsting application of AI tech in such a wide range of industries, that we can’t sit here and think recruiting has a special shield over its head. The tidal wave is gonna wash over this space soon, even if we aren’t privy to every project. I’ve seen a few already in the works, and those are just the tip of the iceberg, because I never even set out looking for them in the first place. \n\nIf we’re talking about tools and features on an internal level, it’s not hard to imagine a single recruiter equipped with the right tools, to do the job of 5 not too far down the road. I’m not a fan of that, because personally I like seeing people employed. But capitalism tries to extract as much as possible by paying as little as possible, and this is a way that capitalism will inevitably go.", "timestamp": "2024-02-06T14:45:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp2188b", "text": "i recruit for tech jobs. the best advice someone gave me at the beginning of my career was this:\n\n\"about every 4 years, there is a fundemental change in technology. That means, if you're not growing your knowledge, skills, or process by 25% each year, in 4 years, you'll be irrelevant.\"\n\nAI isn't going to take our jobs overnight, but I wouldn't be so bold to say think that no job in TA will be replaced by AI. As long as your skills, knowlkedge, and process are modern and relevant, your job should be secure...for now ;)", "timestamp": "2024-02-05T18:06:24Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp2bka0", "text": "You know, we are in the process of changing from one ATS to another and as I go through training, the idea that AI will EVER replace recruiters dissipates into a fine cloud of mist.\n\nThis shit is so complicated that I’m afraid the entire implementation will fail as the hiring managers learning curve will be daunting. The more functionality they add into an ATS, the more cumbersome it becomes.\n\nI’ve watched ATS develop from first SaaS based solutions such as CATS to current AI driven solutions and I am not impressed… like in 20 years of technology development the only thing that has changed is the UI.", "timestamp": "2024-02-05T19:04:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp24cot", "text": "We’ve been automating things for decades. Somehow, recruiters exist now. Maybe it could pose a threat in the future, but I’m not losing sleep over it.", "timestamp": "2024-02-05T18:24:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp28lhg", "text": "I think there's too many qualitative aspects of our field to be completely automated. People will always prefer to engage with real people, especially since we're usually the first person they speak to and give a window in. I've seen some automated recruitment offerings, but it is a terrible candidate experience and ultimately risks diluting the company's brand when they use them.", "timestamp": "2024-02-05T18:47:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp2ezy4", "text": "I’m not worried. I’ve been using AI in recruitment since I started and I have heard that automation will be taking my job any day now for like 20 years.", "timestamp": "2024-02-05T19:23:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp2fbue", "text": "I don’t know if I’m more worried about AI taking over my job, or AI taking over *other people’s*, resulting in a decreased requirement for Recruiters overall.", "timestamp": "2024-02-05T19:25:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp34hiu", "text": "Adapt or die as the old saying goes.", "timestamp": "2024-02-05T21:45:05Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp97ydj", "text": "Thanks neddy.", "timestamp": "2024-02-06T23:50:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp2t8e7", "text": "nope, no more than I was concerned about Monster or Career Builder", "timestamp": "2024-02-05T20:43:01Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp302lw", "text": "time to pivot while you can! easy to pivot into peopleops/hr/hcm/hris", "timestamp": "2024-02-05T21:20:33Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp3yxqi", "text": "I’m worried about AI (sort of) but not in the ways that gets a lot of attention\n\nWill AI replace recruiters? I think some part of the role are ripe for innovation and yes, automation or AI, will have a hand in reducing the staff needed for these roles\n\nThat said, I think what is going to happen is AI is going to drastically reduce the volume of staff needed in Engineering or other fields (Accounting, Finance, Legal) that have traditionally been lucrative areas for recruiting \n\nFor example, an attorney can leverage AI to dramatically accelerate their work. Why would a law firm or department hire 30 attorneys in the future when 15 will do? What effects does that have on recruiting? \n\nIf an engineering department can become 200% more productive, that is less hires to be made\n\nI think the same will be said for recruiting. I don’t see recruiting vanishing but I do see it evolving to something that we don’t yet recognize. Recruiting in the future will leverage an AI ‘Copilot’ that will take remedial work away altogether. And, as a result, reduce the need for many recruiters and concentrate recruiting teams down further\n\nWho knows? Maybe this leads to more companies being created (since everyone benefits for being more productive, including small teams) and as a result, its net neutral", "timestamp": "2024-02-06T00:49:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp3zqj9", "text": "Yep, this is exactly my concern, said much more eloquently. I don’t think Recruiters as a whole will be eliminated, but I think an overall reduction in staffing needs will result in a reduction of recruitment needs, which will result in a reduction of Recruiters. There’s some estimates that AI will replace 30% of white collar jobs in the next five to 10 years. What does that mean for your recruitment job when you have 30% less reqs to fill?", "timestamp": "2024-02-06T00:55:03Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp40edr", "text": "Thanks\n\nI’ll expand on that statement a bit though and argue that more companies will emerge as a result of AI. \n\nFrom what I’ve learned in my life is there is an endless supplies of ambition, ideas and desire to make money. More companies means more people needed to be hired\n\nI think ultimatelyCompany A might hire less but now Company B needs to hire and so on. We could see thousands of new companies enter the marketplace and disrupt when, where and how companies hire in the same way Cloud platforms vs. On Prem did in the past", "timestamp": "2024-02-06T00:59:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp4figc", "text": "You know, that’s a good point too. Companies may hire less, but the sheer number of companies hiring may be more since the barrier to entry will be lower. No more spending millions on payroll, just hire a handful of people, get some AI, and you can start up in the short-term.", "timestamp": "2024-02-06T02:35:35Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "lh6hsya", "text": "The way I see it, AI tools are a way for recruiters to become even more productive and efficient. I don't think recruiters will ever be fully replaced, as it is fundamentally a peoples business, however, I do think that the role will adapt.\n\nThere are already some useful tools out there today that make recruiters' lives easier. Take PeopleGPT, for example, which allows you to source talent more efficiently through natural language search, tailored talent pool insights, and personalized AI Email Outreach.", "timestamp": "2024-08-08T21:55:40Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp3eq3m", "text": "Kind of. It would be difficult, but I imagine someone out there in a high ranking position is strategizing how to replace recruiters to save the company money. If I recruited at a company that was highly automated and data obsessed, I would think they are at least discussing how they could replace us.", "timestamp": "2024-02-05T22:44:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp46am9", "text": "I’m not at all worried.", "timestamp": "2024-02-06T01:36:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp4f7lf", "text": "I’ve thought about it. No harm in thinking about a way to pivot to something else in the future. Who knows what new careers will develop in general with new technology.", "timestamp": "2024-02-06T02:33:37Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kp4myre", "text": "No. The technology is far more limited in use than people like to think. Once they actually achieve AGI and have an entity that understands concepts and doesn't just autocomplete prompts, then maybe we have a problem. But there's no indication we'll hit that in our lifetime.", "timestamp": "2024-02-06T03:25:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
{"id": "kpr2kqi", "text": "I am concerned that my company does not want us using it at this point. Privacy and Cyber security concerns.", "timestamp": "2024-02-10T06:39:41Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Are you concerned about AI?", "url": "https://www.reddit.com/r/recruiting/comments/1ajmgqm/are_you_concerned_about_ai/"}}
