{"id": "mqyv6zo", "text": "It’s been really tough. Went through a no contact duration in my applications and then stuff really started to pick up, made it to final rounds but kept losing out to people who were more senior and willing to take more junior salaries.\n\nI’ve hit another lull and notice less and less jobs being posted everyday. It’s really stressing me out.\n\nI’m also 8 months pregnant and can’t interview onsite without being discriminated against and am not willing to be onsite full time until September. So all I can do right now is apply to remote and it’s just not going well.\n\nIt pains me to see people with way more experience than me not finding jobs because what chance do I even have at this point? \n\nI’m very fortunate my husband makes more than enough to support us and my family but I really do enjoy recruiting and like having my own career. \n\nI am currently studying for the SHRM-CP and planning on taking it in July to possibly help me pivot. We’ll see!", "timestamp": "2025-05-06T22:37:38Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqyxjhq", "text": "I’m senior level and might be forced to take a large pay cut. I’ve done this in the past and absolutely do not want to be stuck in a similar situation again", "timestamp": "2025-05-06T22:50:29Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqyyg92", "text": "Yeah unfortunately a large paycut at my level I won’t even cover childcare. I’m targeting $75k now which doesn’t feel unreasonable but if I can’t get that, there’s no point in me working at all :/", "timestamp": "2025-05-06T22:55:27Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr2w4nt", "text": "I graduated college in 2018 and have been recruiting or HR since. I was laid off once in 2020, and again in 2022, no fault of my own just hiring freezes and recruiters are the first on the chopping block.\n\n  \nMy previous job paid me $72,000 + 10% bonus and unlimited PTO. My current job pays $58,000 and I get no holidays, and combined sick and vacation of 21 days. Been applying to all kinds of related jobs, had a couple phone screens, one onsite interview and fucking radio silence from the other hundred apps. \n\n  \nHonestly it makes me sick to think about it too much. It feels like the rest of my life is just going to be struggling for peanuts.", "timestamp": "2025-05-07T15:25:03Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr8g2mi", "text": "Agreed.  Brutal.  There was a similar post this last week from a poster getting an offer for $55 K.  I saw another job post on LinkedIn at $55 K.   Candidates are slow to understand the market has totally changed.  Hiring managers failed to understand that there are some very veteran recruiters unemployed.  Tip:  If you are unemployed, and have lots of experience....remember you are dealing with hiring manager who HAVE NOT been unemployed for 8-10 years.  They sometimes won't move forward with candidates with senior titles....rebrand.  Remove \"Director\", \"Manager\", and probably \"Lead\" from your resume.  Candidate who work for $65 K get offers.", "timestamp": "2025-05-08T12:32:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mwpvutp", "text": "I feel this. Im staying put where I'm at. 2% raise every year without commission is better than a 20% pay cut", "timestamp": "2025-06-08T20:46:57Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqyzyi5", "text": "Recruiter here. I’ve been unemployed for 7 months. I’ve been through 2 round interviews as well. I got a job offer with $15k pay cut, however the role will definitely help me expand my skills and background for future opportunities.", "timestamp": "2025-05-06T23:03:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqz9qdm", "text": "Been 3 years since my RIF and only had sporadic contracts. There’s about 60k recruiters laid off in tech and my resume is fine….you just don’t get interviews unless you get a personal referral. \n\nIt’s a shit show.", "timestamp": "2025-05-06T23:58:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqz13v0", "text": "It's been two years since I was laid off by a large publicly traded autonomous semi-truck company (they imploded after an FBI/SEC investigation into our CEO) which I was hoping would be a good move after being laid off from a major chip maker just after they had received funding from the CHIP's act. \nSince then, I've applied to hundreds of jobs, had a handful of interviews but no luck. \nI've worked for some top companies like Google and Microsoft.  Also scaled multiple startups as the first recruiter, grew them from a handful to hundreds and been promoted several times. \nThe longest I've ever been out of work was two months. \nI'm an optimist by nature so I'm going to stick it out as long as it takes!", "timestamp": "2025-05-06T23:10:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqz4qwr", "text": "Are you still unemployed?", "timestamp": "2025-05-06T23:30:11Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqz6dyl", "text": "I'm volunteering to help a former hiring manager ramp up his software development business but it will be commission only. It could eventually be lucrative but it's essentially a sales job.", "timestamp": "2025-05-06T23:39:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqzc5qi", "text": "I’ve had so many first rounds and nothing. I’ve even had quite a few reach out for phone screens and when I respond they ghost me. I’m starting to feel like I’m radioactive! I have always been good at interviewing but this time around is so different.", "timestamp": "2025-05-07T00:12:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqzchux", "text": "Right?!", "timestamp": "2025-05-07T00:14:14Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr3rsys", "text": "You are fortunate to get the interviews.  I’ve been unemployed for over a year but doing independent recruiting work while I look which is noted on my resume. The only interviews I’ve received are through direct referrals but either the job goes on hold or they downgrade and reduce wages by $50K or decide to hire overseas.  I’ve never seen anything like it.  I am a proven, tenured tech recruiter with both agency (Korn Ferry)  and internal corporate experience but I am over 40 which I’m sure plays into my situation based on the ages of those listed on the company’s LinkedIn and recent new hires.  It’s rather depressing but I still keep pressing forward.", "timestamp": "2025-05-07T17:56:16Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr5lfon", "text": "X Headhunter here, have been in the biz since the 2000's. I sold out and went government -State first then federal. I'm headed back to the state bc the craziness with the feds right now. Voc Rehab is in each state and pays well with a state pension to place ppl with disabilities which should be cake for any good recruiter. Life is stable benefits are cheap. Go government if you can while you are young. You will thank yourself when you get my age (pushing 50). State HR jobs also pay well and most recruiters will qualify so long as you word your resume right and make it through the system. There are also split placements for those with candidates that need a quick turnaround. Good luck. Until things turn around, go state/city gov.", "timestamp": "2025-05-07T23:26:19Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqzub5z", "text": "I started in recruitment in 2011. Iwas laid off from my Sr. TA role (management consulting startup) in 2020 (pandemic caused downturn in business). It took me 9 months to find a new role, which was a contract position with an automotive OEM. When the market stabilized, I was rehired into the permanent salaried position I was initially laid off from in 2020. Then they laid me off again in 2024 because our top client had a drastic cut in professional services spending. I applied for new roles weekly, had really good interviews with several companies. I made it to the final round with a few, but no offers. I eventually accepted an operational role in a completely different industry for about 1/2 the total comp package I had before the pandemic. It's been very challenging.", "timestamp": "2025-05-07T01:57:56Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr029zn", "text": "I’m nervous I’ll have to do a career pivot shift given this is what I’ve been doing since graduating college", "timestamp": "2025-05-07T02:44:42Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr2vihz", "text": "It fucking sucks honestly. It's disgusting how much wages have dipped for recruiters in the past 5-10 years. When I started recruiting in 2018 I was making $20 an hour with bobby half. I've seen that same job posted, in the same fucking office, for $17 an hour. And good thing everything is 27% more expensive since then.", "timestamp": "2025-05-07T15:22:06Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqzlxfj", "text": "It’s a dumpster fire. I’ve been looking for 7 months now (worked for Google partner before), had a couple interviews (all through referrals) and one short contract. I’m looking into finishing my PhD and doing something else now. I don’t think it’ll get better. My husband and I want another baby and I can’t sit around for years and hope recruiting will get better.", "timestamp": "2025-05-07T01:10:03Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqze6ij", "text": "It's bad. I launched my own firm in September 2021 and we were making placements like gangbusters. Fast forward to a little over a year ago, my partner determines he can no longer support his family with the slowdown in the industry, and goes back to the evil empire. I am forced to buy him out, get a loan from my mom to do so. Meanwhile through all of this, I have been dealing with and finally getting diagnosed with lupus. I've gone a couple months with no placements. It's surprising how much the infrastructure for a teeny staffing firm costs. Don't pm me, I won't get into it for you. Things are finally turning around and my health has turned around and I'm becoming cautiously optimistic. Last year, I actually hired a recruiter, and she turned out to be psycho. So much wasted money there. I'm relying so much on existing relationships and my ability to build relationships over the phone. Thank god I started in a shitty cold calling job fifteen years ago. If I can keep this going, I'll be so rich. I'm so lucky to have a husband who can take over some bills when things get tight. I feel SO BAD for the recruiters who got laid off, but I do think that period of 2022 when things were off the hook, too many recruiters were hired and this was the inevitable outcome for many.", "timestamp": "2025-05-07T00:24:08Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqzm5lw", "text": "Hope all goes well for you!", "timestamp": "2025-05-07T01:11:25Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqzwirv", "text": "Thank you!", "timestamp": "2025-05-07T02:10:32Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr0ewgt", "text": "How was she psycho?", "timestamp": "2025-05-07T04:09:23Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqz7yu6", "text": "I started a new role in October. It took me well over a year and half of passively applying. I was maybe putting in 1-2 applications a week. Thankfully I l was still employed but it had never taken that long for me to switch jobs before!", "timestamp": "2025-05-06T23:48:10Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr0ehl9", "text": "You really need a personal referral to get a job these days. I’m sure your resume is good but the people you are competing against are good too. Go through your network of everyone you know and have ever worked with and let them know you’re looking. Eventually some company will be hiring a recruiter. Keep applying for sure online but I wouldn’t expect that’ll be how you find a job.", "timestamp": "2025-05-07T04:06:24Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr0ep24", "text": "It’s going to be like this or worse for a few years so I think a career change longterm is a great idea", "timestamp": "2025-05-07T04:07:53Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr6kdxt", "text": "I'm a senior recruiter, tech &amp; GTM. I've been looking for 21 months &amp; currently experiencing a dry spell on interview requests, 5 months. I've created AI resumes, shortened the resume, applied for customer service jobs &amp; still nothing.", "timestamp": "2025-05-08T02:50:15Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr7hsib", "text": "Unfortunately this isn’t the first time I’ve heard of a dry spell in our industry. Keep your head up and remain persistent \n\nA friend was the type to constantly be headhunted for years. He was laid off from a his job in 2023 and it took him a full year to find something new. He was in medical editing", "timestamp": "2025-05-08T07:29:43Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr9ko5h", "text": "👍", "timestamp": "2025-05-08T16:04:07Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqz2wgk", "text": "Hey I know someone who needs a job and wants to work with a recruiter. Could they pay you to help them find a job?", "timestamp": "2025-05-06T23:19:56Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqz77um", "text": "Companies are the ones paying a 3rd party Recruiter, not candidates. It’s unethical any other way.", "timestamp": "2025-05-06T23:44:00Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mqzedpa", "text": "Ope! Did not know. Thanks!", "timestamp": "2025-05-07T00:25:20Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr38wvq", "text": "There are some folks who will offer what you're asking but I've never heard of it being very successful. They typically refer to themselves as Reverse Recruiters", "timestamp": "2025-05-07T16:26:49Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr65ykr", "text": "Your friend needs a career coach. I am one. I also work as an internal recruiter and have my own career coaching practice .", "timestamp": "2025-05-08T01:25:17Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "n0vr1j0", "text": "Do you need IT help? I have worked in IT for 8 years. Mostly End-User Support, Compliance, and IT Asset Management.", "timestamp": "2025-07-02T03:28:46Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
{"id": "mr0ftx4", "text": "You are going to need to do a lot of outbound sourcing on LinkedIn and find someone willing to relocate. High level healthcare professionals aren’t just hanging out in small towns", "timestamp": "2025-05-07T04:16:02Z", "source": "reddit", "metadata": {"subreddit": "recruiting", "post_title": "Current market for recruiters", "url": "https://www.reddit.com/r/recruiting/comments/1kggobg/current_market_for_recruiters/"}}
